{"Chapter 1": {"Name": "The Awakening of Martial Souls", "Translator": "Transn", "Editor": "Transn", "Story": ["The story started in Sunnywood City, Skymoon Country.", "In the mansion of the Sus, a ceremony of Martial Soul awakening was being held in a huge martial practice field.", "An altar stood in the center of the martial practice field.", "Many elders and disciples of the Sus were clustered in the field, watching the ceremony.", "“Rank 2 Human Class Martial Soul!”", "“Rank 3 Human Class Martial Soul!”", "“Rank 3 Human Class Martial Soul!”", "The elder hosting the ceremony continuously announced the ranks of the Su disciples’ awakened Martial Souls.", "The level of the Martial Soul indicated the cultivating talent of martial artists. Both Rank 2 and Rank 3 Human Class Martial Soul were common Martial Souls and were considered mediocre.", "Many people in the martial practice field fixed their eyes on two young men who were standing in the front row.", "One was dressed in teal clothes, and the other one was wearing purple clothes. They were both quite handsome.", "The young man in teal was called Su Mo, the young master of the Sus and the son of the Master of the Sus.", "The young man in purple was the son of the First Elder of the Sus.", "They both were seeded disciples with great talents among all inferiors, especially Su Mo.", "The young master had accomplished Lv 9 Body Tempering Realm at the age of 15, and he was endowed with the highest talent among all inferiors.", "Therefore, everyone looked forward to seeing what levels of Martial Souls they would awaken.", "In the first row, Su Yu, dressed in purple clothes, glanced at Su Mo, who was next to him. He sneered and said, “You’re called the top genius of the entire Su clan. I hope that you can awaken a Martial Soul that is well worthy of your identity.”", "The eyes of Su Yu were full of sarcasm. He had an extremely high talent, but Su Mo was spoken more highly of than him in the Su clan.", "The so-called nickname of top genius made Su Mo so famous that he stole Su Yu’s honors.", "As a result, Su Yu could only be second to him every time.", "Su Yu was so furious, because even the lady he liked had a crush on Su Mo.", "Now, his opportunity had finally arrived. As long as he could awaken a Martial Soul with a higher level than that of Su Mo, he would claim the title of first genius among the Sus.", "However, Su Mo was unprovoked. He did not say anything, because he clearly knew Su Yu’s hostility toward him.", "Then, the hosting elder exclaimed,", "“Next up, Su Mo!”", "Su Mo instantly strode onto the altar.", "Right at this moment, all people fixed their eyes on him and the entire martial practice field immediately quietened. They were wondering what the level of Martial Soul Su Mo, the first genius of the Su clan, could awaken.", "After entering the altar, Su Mo sat cross-legged with his eyes tightly closed.", "Glowing runes emerged consecutively beneath the altar and entered into Su Mo’s body.", "The surrounding disciples of the Sus started to whisper after Su Mo entered the altar.", "“Can you guess which level of Martial Soul brother Su Mo can awaken?”", "“As the young master, the level of his Martial Soul must be very high.”", "“You’re right. He has accomplished Lv 9 Body Tempering Realm at less than 15 years old, so he’ll awaken a Martial Soul with an extremely high level.”", "Amidst the disciples’ heated discussion, more and more sparkling runes floated above the altar and enveloped Su Mo’s body.", "With his legs crossed and eyes closed, Su Mo started to breathe quickly, and roaring sounds gradually arose.", "Everyone stopped breathing and stared closely at the altar.", "Boom!", "Finally, with a mighty booming sound, a dark shadow abruptly rose from his body.", "This dark shadow was a huge vortex, inside which was a bottomless black hole, making people feel a chill.", "At the same time, a yellow halo appeared above the shadow.", "Ah!", "All the Sus were instantly glassy-eyed.", "“Why is there only one halo?”", "“His Martial Soul is Rank 1 Human Class?”", "“How is this possible?”", "Everyone was stunned, and even Su Yu felt startled with his mouth agape.", "He had not expected that Su Mo would only awaken a Rank 1 Human Class Martial Soul.", "The Rank 1 Human Class Martial Soul was the lowest one and totally useless.", "Seated on the altar with his legs crossed, Su Mo slowly opened his eyes. He was also dumbfounded when he saw his Martial Soul.", "“Rank 1 Human Class Martial Soul…” Su Mo murmured with a bitter smile on his lips. He had never thought that he would awaken a lowest rank Martial Soul.", "After a while, everyone regained consciousness, and the martial practice field was suddenly in an uproar.", "“Oh my, my eyes must be playing tricks on me. It’s a Rank 1 Human Class Martial Soul, the totally useless one?”", "“He awakened a useless Martial Soul. Crap, I can’t believe I anticipated for so long!”", "“He isn’t a genius, but the most useless person in our clan!”", "“…”", "All the spectators were talking about the matter, and all the elders and inferiors of the Sus changed their view of Su Mo.", "They used to look at him with respect and admiration, but now, they were looking at him with disappointment and contempt.", "On the altar, Su Mo managed to slowly stand up with his fists clenched.", "He looked around and saw their expressions.“What snobbish people they are!”Su Mo smiled satirically in his heart.", "Previously, when he was considered to be highly talented, all of them showed their respect to him. Wherever he went, they all swarmed to him and kissed his ass.", "Now, after he awakened a useless Martial Soul, they all instantly looked at him with contempt.", "After a while, Su Mo took a deep breath and strode off the altar.", "“Next one, Su Yu!” exclaimed the hosting elder.", "Glancing at Su Mo, he shook his head secretly. The former genius was a genius no more!", "Upon hearing this, Su Yu walked toward the altar with a prideful look.", "When he passed by Su Mo, he coldly laughed and disdainfully said, “I used to regard you as my rival. But from now on, the rivalry is gone, and I’ll tread you under my foot forever!”", "Su Yu felt extremely happy. Now that Su Mo had awakened the lowest rank Martial Soul, Su Mo would not even be eligible to lick his shoes.", "Even if he awakened a bad Martial Soul, it would still be higher than Su Mo’s.", "Su Yu strode onto the altar after saying these words.", "Without responding to his provocation, Su Mo returned to the martial practice field and calmly observed the ceremony.", "Standing in the martial practice field, he felt some disparaging eyes fixed upon him and saw the disdainful expressions of disciples around him.", "Su Mo’s heart could not stop twitching. After all, the feeling of falling from heaven to hell was indeed torture.", "Now, Su Yu sat on the altar cross-legged. The glowing runes emerged from the black alter and all entered his body.", "The martial practice field quieted down again, and everyone looked forward to seeing his Martial Soul.", "Su Mo had awakened a useless Martial Soul, so it was impossible that Su Yu would awaken another useless one.", "Otherwise, the Sus would become a joke in Sunnywood City.", "Howl!", "As everyone was anticipating, a beast’s roar abruptly came out from Su Yu’s body.", "A giant virtual shadow of a snake rose above the head of him, triumphantly.", "There were five dazzling yellow halos around the python’s shadow.", "The hosting elder was stunned at the sight of his Martial Soul. Then, he shouted excitedly, “Five halos! It’s a Rank 5 Human Class Martial Soul —Iron-scaled Python.”", "The Rank 5 Human Class Martial Soul was the highest one in all of Sunnywood City. Finally, another genius had appeared in the Sus.", "The entire martial practice field fell into silence at the sight of Su Yu’s Martial Soul.", "Then, it was in an uproar again.", "“Rank 5 Human Class Martial Soul!”", "“Haha! The top genius appeared in the Su clan.”", "“Brother Su Yu turned out to be the first genius of our Su clan. Su Mo is nothing!”", "“You’re right! Su Mo only has a useless Martial Soul. He can’t be compared with Su Yu!”", "All disciples of the Sus looked at Su Yu with admiration.", "On the altar, Su Yu saw that he awakened a Rank 5 Human Class Martial Soul and heard the surprise and admiration from the crowd.", "A thick of pride arose in his heart and felt that everything was beautiful. He was full of high spirits and thought that no one could rival him.", "He arrogantly turned to Su Mo and looked at him with eyes full of sarcasm, as if to say, “I will always tread you under my foot from now on.”", "After seeing Su Yu’s proud look and hearing the praise from the crowd, Su Mo sighed in his heart and left the martial practice field."]}, "Chapter 2": {"Name": "The Previous and Present Lives", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo went straight back to his yard after leaving the martial practice field.", "Sitting on a stone bench, he moped over what happened at the awakening ceremony.", "He was also surprised that he had such a low-rank Martial Soul.", "“It’s been 14 years!” Su Mo murmured distractedly.", "He was actually not born in this world and came from the Earth.", "He had been a mercenary in the 21st century. To be exact, he was a king of mercenaries, a legendary hero in the field.", "As an orphan, he had lived with his relatives since he was a child. At the age of 17, he decided to drop out of school and join the army.", "After two years’ training, Su Mo was recruited into the strongest special forces in China for his excellent martial skills and soon became the top member of the special forces.", "Within four years, Su Mo had successfully executed nearly 100 national military missions.", "Su Mo had thought that he would devote his entire life to his motherland, to the army. But unfortunately, he had got discharged from the army for an accident and left the army dismally.", "After returning home, he could not fit into normal society or find a job because he had no diploma, skills, or network.", "Half sitting around for six months, Su Mo decided to embark on a new journey.", "He enlisted several past comrades in arms and formed Dragon Soul, a small mercenary organization.", "In the ensuing years, Su Mo and the Dragon Soul Mercenary Group travelled all over the world.", "They were on the spot in all wars, including ones in Africa, the Middle East, Eastern Europe, and Southeast Asia.", "The Dragon Soul Mercenary Group developed rapidly from its initial size of a few people into dozens, hundreds, and finally, thousands of people.", "It went from an unknown small organization into a powerful mercenary army that ruled over a dark world.", "Dragon Soul Mercenary had never failed its missions. For the right price, the organization could accomplish any mission, like destroying the army of a small country or overthrowing governments.", "Last year, Dragon Soul Mercenary even defeated Blackblood Mercenary, which used to be the top mercenary organization in the world, thus becoming the new ruler of the mercenary field.", "As the leader of Dragon Soul Mercenary, Su Mo was regarded as king of all mercenaries.", "One could say that his name remained a taboo in the dark world. When he stomped his foot, the entire dark world would shake.", "However, no one could keep his shoes dry if he always walked along the riverside. In the end, he was completely betrayed!", "He was sold out by his most trusted brothers and died with his enemies in a trap.", "After being in this world for 14 years, he was fully adapted and had almost completely forgotten his previous life.", "He was greatly curious about this world, which was a very magical place that was completely different from Earth.", "This continent was called Firmament and Continent and had a vast and unmeasurable landscape.", "This world highly revered martial arts and believed in survival of the fittest. The strong were worshipped like kings, while the weak were crushed like ants.", "If a person could achieve grand completion in cultivation, he would possess the most powerful skills and could travel to anywhere he wanted in the universe.", "A powerful martial artist could access unlimited power, status, money and women.", "In order to become a powerful martial artist, one needed to awaken his Martial Soul, absorb Spiritual Qi from the heaven and earth, fortify his body, and refine his genuine Qi.", "There were countless types of Martial Souls with varying levels of strength.", "They were divided into three classes, namely heaven, earth and human class, each of which was classified into nine ranks.", "The higher a martial artist’s level of Martial Soul, the stronger his power and potential were, and the faster his ability to cultivate was.", "After coming to this world, Su Mo had worked very hard to cultivate.", "He did this because he wanted to explore this big and exciting world.", "In his previous life, he had been a powerful man and ruled the whole world.", "In this present life, he still wanted to be a strong man who could overlook others.", "However, today’s Martial Soul awakening ceremony was a humbling slap to the face.", "His dream was wonderful, but the reality was much too cruel.", "Suddenly, a deep voice sounded at the door and brought him back to his senses.", "“Mo’er.”", "The voice belonged to a tall and solemn middle-aged man. He was Su Hong, the Master of the Sus.", "Upon seeing Su Mo, Su Hong tried to comfort him, saying, “Stop thinking about your Martial Soul. You may have a weaker one, but if you try your hardest to cultivate, you’ll still become powerful one day.”", "Su Mo gave him a bitter smile, thinking,“My Martial Soul isn’t just weaker. It’s the weakest one.”", "“Don’t worry, Father. I’ll work harder!” he said, forcing a smile.", "He knew that his father was comforting him.", "Everyone knew that the level of one’s Martial Soul decided his future accomplishments. The stronger the Martial Soul one awakened, the further one would go in martial arts.", "This was an indisputable law.", "It was impossible for him to become powerful with his Rank 1 Human Class Martial Soul.", "“Good.” Su Hong nodded.", "He took out a jade jar and handed it to Su Mo, saying, “This is a Qi Condensation Elixir that’ll help you break through your cultivation and enter the Qi Cultivation Realm.”", "“Father…”", "Su Mo felt his heart ache. After he awakened a Rank 1 Human Class Martial Soul, he would be considered as a total failure to cultivate.", "Qi Condensation Elixir was so priceless that the Sus could not have bought it for him, so Su Hong must have bought it with his own money.", "Su Mo accepted this elixir, and the two chatted for a while before Su Hong left.", "“What type of Martial Soul have I awakened?”", "Su Mo was not in a haste to take the elixir after his father left. Instead, he sat cross-legged in his room and released his Martial Soul.", "A dark vortex surrounded by a shining yellow halo suspended quietly above him.", "“What special skills does it have? I’d better cultivate it for a while.”", "Su Mo calmed his heart, used his mind to connect with the Martial Soul, and sensed the Spiritual Qi from heaven and earth", "The black vortex began to slowly rotate, and the center of the vortex emitted a strong suction force.", "Wisps of Spiritual Qi converged toward Su Mo and entered his body.", "He was soon immersed in cultivating and drove his Martial Soul to continuously absorb the Spiritual Qi.", "After a long time, Su Mo stopped.", "He opened his eyes with a hint of surprise.", "“My Martial Soul is Rank 1 Human Class, but its cultivating pace equals the speed of Rank 2 Human Class.”", "Su Mo had met many martial artists whose Martial Souls were of the Rank 2 Human Class, and his Martial Soul was no worse than theirs.", "This unexpected surprise greatly alleviated his depression.", "After some pondering, Su Mo realized that this speed was probably related to the property of his Martial Soul.", "His Martial Soul was a vortex which naturally had the property of suction.", "Therefore, it was normal for his Martial Soul to absorb Spiritual Qi at a speed that equaled that of Rank 2 Human Class Martial Soul.", "He took out the Qi Condensation Elixir his father had given to him and prepared to enter the Qi Cultivation Realm.", "At the beginning of the martial arts journey, one must complete Lv 9 Body Tempering Realm. Then, one could awaken the Martial Soul to absorb Spiritual Qi, refine genuine Qi, and enter the Qi Cultivation Realm.", "Only after entering the Qi Cultivation Realm would one be considered a true martial artist.", "As soon as he swallowed the Qi Condensation Elixir, its effects immediately surged throughout his body.", "Su Mo hurriedly ushered its powers into his elixir field and started to refine genuine Qi.", "Time slowly passed. After four hours, Su Mo abruptly opened his eyes, and a sliver of light flashed in his eyes.", "At this moment, a mass of vaporous genuine Qi had gathered in his elixir field.", "The Qi Condensation Elixir was proven to be worthy and had helped him enter Lv 1 Qi Cultivation Realm."]}, "Chapter 3": {"Name": "Ninefold Ocean Wave Fist", "Translator": "Transn", "Editor": "Transn", "Story": ["The next morning,Su Mo got up early, freshened up, and headed into the Book Collection Pavilion.", "The Book Collection Pavilion, a four-storey tower, was where the Sus stored scrolls of martial arts.", "Before Su Mo had awakened his Martial Soul, he could only study the elementary martial arts on the first floor. Now that he had awakened his Martial Soul, and his cultivation was at Lv 1 Qi Cultivation Realm, he could choose cultivation skill and martial skill suited for him.", "There were nine levels of cultivation skill and martial skill.", "Each level was divided into three grades: Lower, Medium, and Upper.", "Martial artists who used higher grade cultivation skill were naturally more powerful.", "“Elder, I want to choose a scroll on the second floor,” Su Mo said, saluting the pavilion protector as he stepped into the Book Collection Pavilion.", "“The second floor?”", "The pavilion protector, a fat old man, said indifferently, “Su Mo, the second floor can only be accessed by those whose cultivation is at the Qi Cultivation Realm. No exceptions.”", "“I know that, elder. My cultivation is at Lv 1 Qi Cultivation Realm,” Su Mo nodded and said.", "“Lv 1 Qi Cultivation Realm?” The pavilion protector was stunned. Then, he said with a cold expression, “Su Mo, you just awakened your Martial Soul yesterday, and it was at Rank 1 Human Class. How could you be at the Qi Cultivation Realm so soon with that crappy Martial Soul? Even if you had a Rank 3 Human Class Martial Soul, it wouldn’t be possible. Are you kidding me?”", "“Humph! You’ll see!”", "Su Mo released an aura of Lv 1 Qi Cultivation Realm with a serious expression.", "Then, he turned around and went up to the second floor of the Book Collection Pavilion, leaving the pavilion protector behind.", "“He… he did it!”", "The pavilion protector was stunned, but then he laughed disdainfully and said to himself, “The Master must have given him some precious elixir, but he still won’t be able to go much further with his crappy Martial Soul.”", "Su Mo went to the second floor and saw rows of antique bookshelves, which were full of scrolls.", "The Sus was one of two main clans in Sunnywood City, so they had many cultivation skills and martial skills. There were almost 100 scrolls on the second floor of the Book Collection Pavilion.", "A tall young man was browsing the scrolls there.", "“Su Mo!”", "The young man was initially surprised to see Su Mo, but then he glared at him with complete disdain.", "“Su Heng!” Su Mo glanced back at him.", "Su Heng also awakened a Martial Soul yesterday. His Martial Soul was of Rank 4 Human Class Martial Soul, which was not as good as Su Yu’s, but a high rank nonetheless.", "Since Su Heng was on the second floor, his cultivation must have also reached the Qi Cultivation Realm.", "“Well, this is unexpected, Su Mo. I heard yesterday that the Master bought a ‘Qi Condensation Elixir’ from the Herbs Shop, which is probably what you used to increase your cultivation!”", "Su Heng looked at Sumo and said disdainfully, “Otherwise, you wouldn’t even be able to reach the Qi Cultivation Realm with that crappy Rank 1 Human Class Martial Soul.”", "“It’s none of your business how I got this cultivation,” Su Mo said coldly. Then, he began to browse the manuals and ignored him.", "Su Mo knew Su Heng very well.", "When Su Mo was still considered the top genius of the Sus, Su Heng had fawned on him, and Su Mo had been very kind to him.", "However, Su Heng now had a completely different attitude towards Su Mo.", "“Humph! So much for being a genius. You’re nothing but a piece of trash!” Su Heng snorted and continued selecting his manuals.", "Su Mo picked up a manual in the cultivation skill category and began reading it.", "“Raging Fire Skill.Medium Lv 1 Cultivation Skill. The Genuine Qi cultivated through this method has extremely powerful fire power and has a very strong attack…”", "Su Mo continued to browse after reading a few pages of this book.", "He wanted to read a few more manuals to choose the most suitable cultivation skill.", "All of the manuals on this floor were at Medium Lv 1. The manuals of Upper Lv 1 were only on the third floor.", "However, those manuals were only available for those whose cultivation was at Lv 7 Qi Cultivation Realm.", "“Huge Rock Skill.Medium Lv 1 cultivation skill. The Genuine Qi cultivated through this method is dense and has strong defense…”", "“Clouds Skill.Medium Lv 1 cultivation skill. The Genuine Qi cultivated through this method is pure and has equally strong attack and defense…”", "After reading several manuals, Su Mo selectedCloud Skillbecause of its pure genuine Qi and strong attack and defense.", "After choosing a cultivation skill, it was time to choose a martial skill.", "“Iron Fist.This fistplay is fierce and can easily crack open stones after practicing to the great Completion Realm… ”", "“Flying Swordplay.This swordsmanship is ethereal, agile, and gorgeous…”", "“Breeze Palm…”", "“Infinite Push Hands…”", "Su Mo was not satisfied with a dozen martial skills that he read.", "“Ninefold Ocean Wave Fist?”", "Su Mo’s eyes brightened when he saw the name of this manual. He could recognize that it was extraordinary.", "He opened the manual excitedly.“Ninefold Ocean Wave Fist.Medium Lv 1 Martial Skill. The body is like the sea, and the fist is like a wave. The fist force has many levels, and each level is stronger than the previous one.”", "“This is the one!”After reading for a moment, Su Mo nodded with satisfaction.", "As he was about to leave with the two manuals, Su Heng suddenly blocked him.", "“Su Mo, put downNinefold Ocean Wave Fist,”Su Heng shouted arrogantly.", "Su Mo glanced at him and asked, “Why should I?”", "“I was thinking about taking that manual, and I’ve decided that I want it, so give it back to me!” Su Heng raised his chin and ordered.", "“Give it back to you? It was never yours!”", "Su Mo scoffed and said, “The book is mine now, so you’re not getting it.”", "“Are you sure?” Su Heng’s eyes grew cold, and he said, “Su Mo, do you know what the consequences of angering me are?”", "“What consequences?” Su Mo smiled and said, “I have no idea. Please tell me.”", "“You’re a piece of trash, but you’re still so arrogant.” Su Heng shouted furiously, “Su Mo, I’ll say it again. Give it to me, kneel, and apologize, or I’ll break your legs.”", "“Kneel and apologize, or you’ll break my legs?”", "A cold light flashed in Su Mo’s eyes, and he said indifferently, “I’d like to see you try!”", "“You’re courting death!”", "Su Heng shouted, and his spirit of Lv 1 Qi Cultivation Realm exploded. A yellow light shone behind him, which meant that he was arousing his Martial Soul to attack.", "“Stop it!”", "At that moment, the pavilion protector said with an icy voice, “No fighting in the Book Collection Pavilion, or you’ll be banned for life!”", "These words stopped Su Heng.", "“Elder, I’m sorry. I won’t violate the rules,” Su Heng said hastily to the elder, stifling his anger.", "Even though he wanted to teach Su Mo a lesson, Su Heng did not dare to violate the rules.", "It would be a great loss if he was banned from the Book Collection Pavilion for life.", "“Today is your lucky day. I won’t let you off next time,” Su Heng turned to Su Mo and snarled.", "“Idiot!” Su Mo glanced at him and turned to leave.", "“What did you say?”", "Su Heng became furious again. He glared at the leaving Su Mo and gnashed his teeth in anger.", "Since he had awakened a Rank 4 Human Class Martial Soul, his status had risen a lot in the Sus, and others were polite to him.", "Today, he was insulted by this useless man with a crappy Martial Soul, and that drove him mad.", "“Damn it, I’ll make you pay!”"]}, "Chapter 4": {"Name": "Pros and Cons", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo could not wait to begin cultivating as soon as he returned to his room.", "Clouds Skillhad five realms, and the higher the realm, the purer the genuine Qi it cultivated.", "Also, a higher realm of cultivation skill meant stronger attack and faster cultivating.", "Su Mo continued to cultivate over the next couple of days.", "His dark vortex of a Martial Soul was rotating in the room, and plumes of Spiritual Qi twined around Su Mo. His cultivation was slowly increasing.", "While Su Mo was cultivating, the news that he awakened a Rank 1 Human Class Martial Soul spread all throughout Sunnywood City.", "The young master and the first genius of the Sus unexpectedly had a crappy Martial Soul!", "This caused a stir in Sunnywood City, and many people treated him like a joke.", "…", "Five days later, Su Mo stopped cultivating.", "“The level of my Martial Soul is so low that it’s slowing down my cultivating!” Su Mo sighed.", "After five days of hard work, his cultivation had only increased marginally.", "At this rate, it would take at least six months to enter Lv 2 Qi Cultivation Realm .", "Luckily, he had cultivatedClouds Skillto the second level and purified and condensed a good amount of genuine Qi in five days.", "“Time to cultivate my martial skill!”", "Su Mo took outNinefold Ocean Wave Fistand carefully read it.", "After he fully understood all of the details, he closed the scroll and walked into the yard.", "“The purpose ofNinefold Ocean Wave Fistis to regard the body as a raging sea and the fists as waves, each one stronger than the one before…”", "With the key to this fistplay in mind, he practiced every gesture and motion according to the manual.", "“Ho! Ho! Ho!”", "He punched very slowly at first, but gradually moved faster and faster. In the end, his fists exploded like bombs and stirred up endless gusts of wind.", "Another five days passed by.", "The wind from his fist power was screaming, and the air was endlessly stirred.", "“Ho!” Su Mo lifted up a shout and landed a punch on the stone bench ahead.", "Bang!", "The stone bench exploded with a rumbling sound, and its fragments flew everywhere.", "“Hu!”", "Su Mo took a deep breath and stood with his fists clenched.", "“Not bad! I’ve achieved Minor Completion!”Su Mo could not stop smiling.", "He was now able to punch with a fivefold fist force, but after reaching Completion Realm, his fist force would be ninefold.", "Almost no one in Sunnywood City could reach the Minor Completion Realm of a Medium Lv 1 Martial Skill in only five days. Su Mo was able to do so because living two lives had given him very strong comprehension.", "“Now, it’s time to enter Breezewind Mountain to try my luck.”", "Su Mo whispered. Then, he packed up and set out.", "Breezewind Mountain lay in a mountain range that covered about 49,000 square kilometers,and it was 15 kilometers away from Sunnywood City. It was lofty and densely covered in forests.", "Since there were a lot of Spiritual Herbs there, many martial artists in Sunnywood City always went into the mountains to collect them.", "However, opportunity always came with danger. Lots of martial artists were killed and eaten by the large number of demonic beasts that lived in the mountains.", "In spite of the dangers, Su Mo had to take a chance. It was too hard for him to cultivate with his low-grade Martial Soul.", "Su Mo was walking down a tree-lined path when he suddenly heard a burst of a giggles.", "He turned around and was stunned by what he saw.", "A boy and a girl were cuddling happily with each other under a pavilion beside a pond.", "The girl was a true beauty. Tall and slim, she wore a purple dress over her fair skin, and her loose black hair was draped over her shoulders.", "She was Liu Yushan, Su Mo’s childhood sweetheart and cousin.", "Liu Yushan was the eldest daughter of the Liu clan, which was a small clan in Sunnywood City that depended upon the Sus.", "Su Mo and Liu Yushan grew up together, so they were very close.", "Their parents had wanted them to get engaged at the beginning of next year.", "The young man with Liu Yushan was no other than Su Yu, the martial artist who replaced Su Mo as first genius of the Sus.", "…", "Su Mo made eye contact with them.", "“Yushan, why are you two together?” Su Mo asked with a frown, walking toward them.", "Liu Yushan turned her head away with an inexplicable glint in her eyes and said nothing.", "Su Yu glanced at Su Mo and coldly smiled. “Su Mo, from now on, Yushan is mine. Leave her alone, or you will have to answer to me.”", "“Yushan!” Su Mo ignored Su Yu and stared at Liu Yushan.", "“Su Mo, did you hear what I said?” Su Yu’s eyes were cold, and he said, “A piece of trash like you doesn’t deserve her. Only I, a genius, am the best fit for Yushan.”", "Liu Yushan nodded and said, “He’s right.”", "“Why? Because of my Martial Soul?”", "Although Su Mo was upset, he did not let himself get enraged and remained calm. He was a mercenary king during his past life and had gotten his fair share of women. If a girl did not like him, it did not bother him.", "“Cousin, we don’t belong to the same kind of people anymore,” Liu Yushan nodded and said.", "“Don’t belong to the same type of people anymore?” Su Mo muttered and smiled bitterly, thinking,", "“Three days ago, I awakened a Rank 4 Human Class Martial Soul. We will only grow further apart as time goes on.” Liu Yushan said pridefully, “Su Yu, the genius of the Sus, is my ideal spouse. As for you, my cousin, you’re a good-for-nothing. The difference between you and him is extremely apparent.”", "“Rank 4 Human Class Martial Soul?”", "Su Mo was not surprised by her Martial Soul, because Liu Yushan was very talented.", "“I see!” Su Mo nodded and said calmly. Everyone was entitled to a choice. Since she had chosen to abandon him, he would not try to change her mind.", "Liu Yushan frowned at Su Mo’s placid face.", "She had thought that he would be devastated and would beg desperately for her,", "So his cool demeanor bothered her.", "“Yushan, remember what you said today. I hope that you won’t regret it in the future!”", "Su Mo took a deep breath as he said those words and left.", "“Regret? How is that possible?” Liu Yushan laughed and shook her head.", "…", "After leaving the Sus, Su Mo sprinted straight toward Breezewind Mountain.", "An hour later, he arrived at the foot of Breezewind Mountain.", "Breezewind Mountain looked like a huge monster creeping on the ground, giving off a cold and ruthless aura.", "Without hesitation, Su Mo sprang into the mountains.", "Before long, Su Mo had run five kilometers into the forest, where the trees towered over him with thick trunks and completely blocked out all the sunlight.", "“Howl!”", "Then, a giant black wolf sprang out into Su Mo’s path.", "“Evilwind Wolf, Class 1 Lv 1 Demonic Beast!”", "Su Mo recognized it. A demonic beast at this level was as powerful as martial artists at Lv 1 Qi Cultivation Realm.", "“Well, I’ll practice with you!”", "Su Mo flew forward like a flying arrow and hit the Evilwind Wolf with his fist, which was covered with strong genuine Qi.", "“Ninefold Ocean Wave Fist!”", "“Howl!”", "The Evilwind Wolf was enraged by Su Mo’s attack, roared, and pounced on him. Its sharp wolf claws split toward his head.", "Bang!", "The claws and fist clashed with a muffled sound.", "Boom! Boom! Boom!", "Su Mo was stumbled back three steps, but the Evilwind Wolf was blown 10 meters away.", "The Evilwind Wolf was quite powerful, but its rough force was no match for Su Mo’s martial arts.", "“Haha! Let’s go again.”", "As Su Mo moved forward and continually punched, the Evilwind Wolf retreated one step after another.", "Soon, the flesh of the wolf was split into shreds, and several of its bones were broken.", "The Evilwind Wolf would have been dead if it were not so tough.", "“Howl!”", "The seriously injured Evilwind Wolf roared and slunk away instead of attacking again."]}, "Chapter 5": {"Name": "Rank 3 Human Class Martial Soul", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo was shocked that the Evilwind Wolf would suddenly run away.", "Although low level demonic beasts were very unintelligent, they were still decisive in the face of danger.", "Su Mo certainly would not have allowed it to escape because the demonic beast had a valuable Demonic Core.", "With genuine Qi spewing out from under his feet, Su Mo rushed toward the Evilwind Wolf.", "The Evilwind Wolf rushed into a small valley and then into a cave.", "Su Mo stopped in front of the pitch black cave and did not rashly enter it.", "After hesitating for a while, he still decided to rush in.", "The cave was obviously the den of the Evilwind Wolf, so there would be no other dangers present.", "As expected,after rushing into the cave, Su Mo saw only the injured Evilwind Wolf lying on the ground.", "“What?”", "At that moment, Su Mo saw a 5-inch-tall plant growing in a crevice not far from the Evilwind Wolf. The plant had eight green leaves surrounding a pale red fruit, which was only the size of a thumb but exuded a fruity fragrance.", "“Is that… Purple Spirit Fruit?”", "Su Mo stared at it and became excited.", "Purple Spirit Fruit was a Medium Lv 1 Spirit Fruit, which could increase by one level the cultivation of martial artists who were below Lv 4 Qi Cultivation Realm.", "However, judging by its color, the fruit was not yet fully ripe.", "Nevertheless, eating this fruit would still increase Su Mo’s cultivation to Lv 2 Qi Cultivation Realm.", "The Evilwind Wolf must have selected the cave as its den for the sake of eating Purple Spirit Fruit.", "“Howl!”", "Seeing Su Mo enter the cave, the injured Evilwind Wolf roared and bit toward the Purple Spirit Fruit.", "“Damn it…”", "Su Mo was rattled. If the Evilwind Wolf swallowed the Purple Spirit Fruit, all hope would be lost.", "“Die!”", "Su Mo roared and stepped suddenly. Genuine Qi spewed out from under his feet, propelling him over the Evilwind Wolf.", "“Ninefold Ocean Wave Fist!”", "After motivating his genuine Qi to the extreme, Su Mo heavily struck the head of the Evilwind Wolf with his fivefold fist force.", "Bang!", "With blood splashing and brains spraying, the Evilwind Wolf was blasted to pieces.", "After killing the Evilwind Wolf, Su Mo was finally relieved.", "Walking to the side of the corpse, Su Mo pulled a gray crystal, its Demonic Core, from the Evilwind Wolf’s skull.", "The Demonic Core of a Class 1 Lv 1 Demonic Beast was at least worth 10 taels of silver.", "Then, Su Mo plucked the Purple Spirit Fruit without hesitation.", "Although the Purple Spirit Fruit was not ripe, Su Mo could not afford to wait. After all, a Medium Grade Purple Spirit Fruit was quite rare.", "He sat down cross-legged and swallowed it.", "The cave was secluded, so it was not dangerous to refine the fruit there.", "As soon as the Purple Spirit Fruit was swallowed, its strong medicinal effects spread throughout Su Mo’s body.", "Su Mo hastily held his breath and concentrated so he could transfer the effects flowing in his meridians into genuine Qi and guide them into his elixir field.", "After a while, Su Mo’s elixir field bulged with abundant Qi.", "“I’ve finally broken into the Late Lv 2 Qi Cultivation Realm!”", "Su Mo exclaimed and nodded with satisfaction.", "The Purple Spirit Fruit not only helped him reach Lv 2 Qi Cultivation Realm but also promoted him to the Late Lv 2 Qi Cultivation Realm.", "Now, Su Mo’s genuine Qi was twice as dense as it was before.", "He could obviously feel that his senses were more acute than before.", "“I should stabilize my cultivation before leaving.”", "Su Mo smiled and began cultivating again.", "A black vortex Martial Soul rose from behind him and rotated slowly.", "Then, something strange happened.", "The dead Evilwind Wolf’s Blood Qi and energy were all sucked in by the vortex Martial Soul.", "Moreover, an illusory Beast Soul floated up slowly from the corpse and was devoured by the vortex Martial Soul.", "All of the Evilwind Wolf’s Blood Qi was transformed into a strong energy after entering Su Mo’s body.", "Su Mo felt his Qi increase greatly and approach the peak of Lv 2 Qi Cultivation Realm.", "“What is this…?”", "Su Mo trembled in shock.", "“Can a Martial Soul devour Blood Qi?”", "“Can a Martial Soul devour Beast Souls?”", "Su Mo had never heard of or seen such a Martial Soul.", "In the midst of his marveling, something strange happened.", "The vortex Martial Soul that had devoured the Beast Soul began vibrating and then exploded with yellow light.", "Instead of having its previous yellow halo, it was now shining with two yellow halos.", "The vortex Martial Soul now was twice as fast at abosrbing Spiritual Qi as before.", "“What?”", "Although Su Mo was usually a composed person, he was filled with excitement at that moment.", "Everyone knew that the rank of one’s Martial Soul was determined at birth and unchangeable after awakening. This was an eternally immutable truth.", "The cultivating talent of a martial artist was mainly determined by the level of their Martial Soul.", "Su Mo’s Martial Soul had just broken the logic of this world.", "His Martial Soul had progressed from Rank 1 Human Class to Rank 2 Human Class.", "If he could devour enough Beast Souls, his Martial Soul level could even increase to Earth Class and Heaven Class.", "“The Heaven Class! How exciting it would be!”Su Mo felt very excited.", "“Haha, Haha!”", "After a while, Su Mo calmed down but couldnot help laughing.", "“Is this my luck as a time traveler?”he thought.", "Since his awakening, Su Mo had felt depressed by the level of his Martial Soul.", "He did not know about his Martial Soul’s special ability before.", "However, this supernatural ability exceeded all of his expectations.", "Su Mo’s excitement dispelled all of his depression.", "“I’ll call you Devouring Martial Spirit from now on!” Su Mo said with a laugh.", "After that, Su Mo quickly left the cave and could not wait to kill demonic beasts and devour Beast Souls.", "Over the next two days, Su Mo crazily slaughtered more than 50 demonic beasts.", "Among these beasts, 10 demonic beasts were Class 2 Lv 1, and the others were Class 1 Lv 1.", "Having devoured the essence, blood and Beast Souls of all the demonic beasts, not only had Su Mo’s cultivation broken through to Lv 3 Qi Cultivation Realm, but also his Martial Soul had progressed to Rank 3 Human Class.", "His fistplay had also greatly improved by killing those demonic beasts.", "His Ninefold Ocean Wave Fist now had sixfold fist force, and its attack had greatly increased.", "Su Mo sat cross-legged in the cave. The black Devouring Martial Spirit floated behind him with three dazzling yellow halos.", "The surrounding Spiritual Qi was being absorbed into Su Mo’s body in torrents.", "After his Martial Soul progressed to Rank 3 Human Class, it was ten times faster at absorbing Spiritual Qi than at Rank 1.", "After a while, Su Mo opened his eyes.", "“With my cultivation fully stabilized at Lv 3 Qi Cultivation Realm, I can kill stronger demonic beasts!”", "Su Mo grinned exuberantly.", "After the progression of his cultivation and Martial Soul, Su Mo had returned to the cave again. After all, his sharp increase in cultivation over the past two days needed to be well consolidated.", "Pitter-patter, pitter-patter…", "Footsteps suddenly sounded from outside the cave.", "“Brother Wei Long, the Purple Spirit Fruit is in this cave, and it is probably almost ripe.”", "“Be careful, I think there’s an Evilwind Wolf guarding it.”", "“Hah! A mere Evilwind Wolf? I can kill it with a turn of my hand.”", "Hearing the voices, Su Mo saw two tall young men stride into the cave."]}, "Chapter 6": {"Name": "Killed in a Second", "Translator": "Transn", "Editor": "Transn", "Story": ["The Qi given off by these two young men was not that strong.", "The handsome young man in the front was at the Peak Lv 2 Qi Cultivation Realm, while the long-faced youth was just at the Early Lv 2 Qi Cultivation Realm.", "When they saw Su Mo, their expressions changed.", "They glared at the empty stalk without the Purple Spirit Fruit.", "“Hey! Did you steal our Purple Spirit Fruit?” Wei Long, the handsome one, barked at Su Mo.", "“Your Purple Spirit Fruit?”", "“Spiritual Herbs grow naturally in the mountains, so they’re fair game. Why is it yours?” Su Mo sneered.", "“Go to hell! How dare you steal our Spiritual Fruit!” shouted Wei Shan, the long-faced youth.", "“We found the Purple Spirit Fruit 10 days ago and were just waiting for it to ripen! How dare you take it from us!”", "“Why do you look so familiar?”", "Wei Long suddenly said with a glint in his eye, “I remember. You are Su Mo, a piece of trash with a Martial Soul of the Rank 1 Human Class.”", "“Oh, it’s you!” Wei Shan said scornfully.", "“Are you two from the Weis?”", "Su Mo saw on their clothes the symbol of the Weis, one of the two main clans in Sunnywood City.", "The Weis and the Sus were equally matched as the two most powerful families in Sunnywood City, and they constantly contested and clashed.", "“Exactly! Come on, give me the fruit!” Wei Shan arrogantly yelled.", "“Forget it. I have already swallowed it,” said Su Mo indifferently.", "“What?” Both men were instantly enraged.", "Since they had waited for the Purple Spirit Fruit for over half a month, how could they not be angry that they got nothing in the end?", "“Damn it! How dare you eat my fruit? Kneel to me and destroy your cultivation, or die!” Wei Long yelled in a rage.", "“Kneel? Destroy my own cultivation?”", "Su Mo was speechless.“Are they playing God? Maybe I was so nice after coming to this world that they think I can be easily bullied?”", "“Crap! Brother Wei Long, let me kill this piece of trash.”", "With an angry shout, Wei Shan punched toward Su Mo’s face, thinking that one punch would be enough to defeat him.", "“Die for your arrogance!” Su Mo coldly said, and he slightly lifted up his palm and punched back.", "Wei Shan sneered, “Do you want to play rough? How stupid! Go to hell!”", "However, his smile froze in the very next second.", "As they collided, Wei Shan felt a horrible power from Su Mo’s fist, like that of a monstrous wave.", "“Ah!”", "With a scream, Wei Shan was blasted against the wall of the cave and passed out.", "“What? How can it be?”", "Wei Long was shocked. He looked at Su Mo and said, “The Lv 3 Qi Cultivation Realm? Damn it! Aren’t you just a piece of trash with a Rank 1 Human Class Martial Soul?”", "“A piece of trash?”", "With a cold laugh, Su Mo blocked their exit and strode toward Wei Long, saying, “How dare you to call me a piece of trash? Dumb-ass!”", "Seeing Su Mo moving toward him, Wei Long frowned and yelled, “What do you want?”", "“To kill you!” Su Mo laughed coldly.", "“Kill me? How dare you! My father is one of the elders in the Weis. If you kill me, he will find you and kill you, wherever you go.”", "Wei Long was quite confident and fearless.", "“Idiot! No one will know that I killed you in this remote mountain.”", "Ignoring Wei Long’s threat, Su Mo was preparing to kill him as he gathered genuine Qi in his fist.", "Fear instantly appeared on Wei Long’s face. His cultivation was at the Peak Lv 2 Qi Cultivation Realm, only a little bit stronger than Wei Shan’s, so it was impossible for him to defeat Su Mo.", "“Su Mo, don’t kill me… don’t kill me!”", "“Give me a reason not to.”", "“A reason… A reason…” Wei Long was anxious like a cat on hot bricks. Suddenly, his eyes brightened up and he said, “Look, I have a treasure map which can lead you to find treasure.”", "“Treasure map? What treasure map? Show me first,” Su Mo said.", "“I can give it to you if you promise you won’t kill me!” Wei Long was not stupid, so he wanted Su Mo to promise him first.", "Su Mo scoffed at Wei Long’s words. He knew what he was thinking.", "“Don’t want to give it to me? OK! I’ll kill you first and then find it on your body.”", "“Here it is… Here it is!”", "Wei Long was scared. He immediately took out a small piece of animal skin and gave it to Su Mo.", "Su Mo checked it out. Indeed, it was an antique and simple map, obviously from long ages ago.", "According to the map, there was treasure right in Breezewind Mountain.", "“Su… Su Mo, I already gave you the treasure map. Can I leave now?” Wei Long asked nervously.", "Hearing no response from Su Mo, Wei Long carefully walked toward the exit.", "As soon as he was close to the cave entrance, Wei Long looked back with a trace of a viciousness at Su Mo. He was planning to bring some people back from outside the mountain to kill Su Mo.", "“Boom!”", "At that moment, Su Mo jumped up and punched him.", "Wei Long was killed on the spot.", "“I will never be merciful to my enemies!” Su Mo said flatly.", "He had killed countless people in his previous life, but that was his first kill in this world.", "Returning to the unconscious Wei Shan, Su Mo gave him another punch.", "Wei Shan was completely killed.", "After that, Su Mo took the map and decided to look for the treasure.", "“Ah-ha!”", "Su Mo stopped suddenly with a glint in his eyes.“If my Martial Soul can devour Beast Souls, can it also devour human Martial Souls?”", "He walked back to the two bodies and released his Devouring Martial Spirit.", "His Devouring Martial Spirit with three halos looked like a bottomless black hole. It spun two times faster than it had at Rank 1 Human Class and had extremely strong suction.", "Wei Long and Wei Shan had just died. Their Blood Qi and Martial Souls, which had not yet disappeared, were immediately sucked up.", "The Martial Soul of Wei Shan was a small green tree with two yellow halos. It was Rank 2 Human Class Martial Soul.", "The Martial Soul of Wei Long was a bird with three halos. Obviously, it was Rank 3 Human Class Martial Soul.", "As the two Martial Souls were instantly swallowed, Su Mo felt his own Martial Soul shake, and its three halos shone brighter.", "However, his Devouring Martial Spirit did not progress out of Rank 3 Human Class.", "“Haha! I was right! I can devour both Beast Souls and Martial Souls!”", "Su Mo was overjoyed and surprised by his Devouring Martial Spirit once again.", "The ability of his Devouring Martial Spirit was beyond imagination.", "Not only did it have the ability to progress, but it also could devour others’ Martial Souls.", "If Su Mo released his Martial Soul in a fight, his enemy’s Martial Soul would be out of their control and devoured by his.", "“Well, time to find the treasure!”", "Having enjoyed the surprise, Su Mo left the cave."]}, "Chapter 7": {"Name": "Storage Ring", "Translator": "Transn", "Editor": "Transn", "Story": ["In the mountains, Su Mo passed through the jungle, guided by his map.", "He was extremely careful the entire time.", "He was more than 25 kilometers deep into the Breezewind Mountain, and there were many Class 4 Lv 1 Demonic Beasts nearby, and even some at Class 5.", "He might not beat a Class 4 Lv 1 Demonic Beasts with his current strength, let alone one at Class 5.", "Therefore, he was constantly on the lookout.", "Finally, after another perilous half hour, Su Mo arrived in an overgrown valley.", "The valley had only one entrance and was surrounded by cliffs that were hundreds of meters high.", "Full of thistles, thorns and bushes, it looked extremely desolation.", "Su Mo stayed alert of his surroundings and prepared to escape at the first sign of danger.", "Although treasures were important, nothing was more important than his life.", "Su Mo saw that this exact valley was the place marked on the map.", "He carefully scoured the surrounding environment and soon found a large crack on a rock wall.", "It was a horizontal crack that was hundreds of meters long and looked like a huge, unfathomable mouth.", "It was overgrown with weeds and not easily noticeable.", "Su Mo frowned as he peered inside.", "Worse than the small cave before, the crevice was gloomy, cold and full of unknown danger.", "After hesitating for a while, Su Mo gritted his teeth and entered.", "Since he had already come, he must find something.", "Danger?", "Su Mo had never been afraid of danger.", "As he walked deeper into the crevice, his vision became dimmer and dimmer, until he was completely surrounded by darkness.", "Su Mo used genuine Qi to improve his eyesight and continued walking.", "After a moment, the pathway in the crevice began gradually sloping downward.", "He estimated that he was about ten meters underground.", "After walking further, Su Mo felt a cold breeze and heard the sound of running water.", "Intrigued by this change, he quickened his pace.", "Soon, Su Mo was suddenly met with a bright light. He saw a huge space, which was over five meters tall, over seven meters wide, and unfathomably long.", "It was a secret underground world.", "A river flowed through the space toward an unknown destination.", "Fish swam in the river, and natural cobblestones on the bank gave off a fluorescent light, allowing Su Mo to see the whole underground world clearly.", "A demolished stone room stood nearby.", "Several dried bones lay outside the stone room. Their owner had obviously been dead for a long time.", "“Has the treasure been taken by others?”", "Su Mo walked over slowly and entered the stone room.", "With a length and width of less than five meters, the room was quite small, and half of it had collapsed.", "There was nothing inside except for two skeletons in the center.", "Thinking that the treasure had already been taken, Su Mo was inevitably a little disappointed.", "“Hmm?”", "Then, he was suddenly astonished.", "He found that one of the skeletons had not decayed and gave off a light gold hue.", "“Why is the skeleton light gold?”", "Su Mo was puzzled.", "This was indeed the skeleton of a human martial artist, but he had never heard of a light gold skeleton.", "“What? Is that…”", "Su Mo noticed an antique and simple ring on the left hand of the golden skeleton.", "“Is that a storage ring?”", "Su Mo excitedly snatched up the ring.", "A storage ring was a treasure capable of storing objects in its own space, so it was quite precious.", "No one in all of Sunnywood City had a storage ring. Common martial artists stored objects in storage pouches, which were of a lower grade than rings.", "After taking a deep breath, Su Mo applied genuine Qi to the ring.", "In the next moment, his awareness entered a dusky space.", "The space was not big. It had a length, width and height of about five meters.", "Several scrolls, a long bright sword and a pile of milk white crystals were piled in the corner of the space.", "With a single thought, the long sword appeared in Su Mo’s hand, instantly giving off a sword sound when injected with genuine Qi.", "Swish! Swish!", "The long sword emitted a sword ray to the wall one meter away and cut through the hard stone wall.", "“What?”", "Su Mo was quite surprised. He had not expected the sword to be so strong and to be able to cut through the stone wall so easily.", "“Spirit-slayer, Medium Lv 3!”", "Su Mo saw several obvious small characters etched on the hilt of the sword.", "“It’s a weapon of Medium Lv 3?”", "Su Mo was immediately overjoyed.", "There were no Upper Lv 2 weapons at all in Sunnywood City, so a Medium Lv 3 weapon was extremely precious.", "“‘Spirit-slayer’ must be the name of the sword.”", "After a while, Su Mo put the long sword back in the storage ring and took out several scrolls.", "There were four scrolls in total, includingDivine Wind Swordplay,Elephants Strength Skill,Shadow Steps, andPrimordial Qi Manual.", "Su Mo openedElephants Strength Skillgently and read it.", "Elephants Strength Skill, Upper Lv 5 Body Refining Skill, with a total of 15 levels. After grasping the manual, one’s body would become strong like an Archean Fierce Beast with the strength of 10,000 elephants.", "It enhanced strength from the first level to the third level!", "It tempered bones from the fourth level to the sixth level!", "It fortified the body from the seventh level to the ninth level!", "It intensified extraordinary power from the tenth level to the twelfth level!", "It amplified Panorama from the thirteenth level to the fifteenth level!", "As he read the contents of the book, Su Mo was shocked once again.", "Upper Lv 5 Cultivation Skill?", "Body Refining Skill?", "Elephants Strength?", "What was the force of Elephants Strength? The force of over ten thousand elephants?", "The “elephant” here was not a normal Demonic Elephant but a Post-archean Elephant.", "An adult Post-archean Elephant had a huge force of more than 10,000 kilograms even without cultivating.", "How powerful was the force of over 10,000 Post-archean Elephants?", "Fifty million kilograms?", "Several billion kilograms?", "Su Mo suddenly felt overwhelmed by all this information.", "“It’s an Upper Lv 5 Cultivation Skill! Not to mention, it’s a Body Refining Skill!”", "Su Mo was overjoyed. This treasure hunt was truly worth it!", "He knew that Sunnywood City had no book about Lv 3 Cultivation Skill, let alone Lv 5 Cultivation Skill.", "As one of the two big families in Sunnywood City, the Sus’ supreme grade cultivation skill was just Medium Lv 2, which was a Secret Clan Manual, so ordinary members could not cultivate it.", "Now, he had an Upper Lv 5 Cultivation Skill, and it was even a Body Refining Skill.", "Body Refining Skill was more precious than Qi Cultivation Skill because of its rarity.", "It was the true skill of fortifying one’s body. The Body Tempering Realm before the Qi Cultivation Realm could only exercise the body.", "The Sus had only two Body Refining Skills, but the young disciples seldom cultivated them because it was slow-cultivating and time-consuming.", "Instead, their first target was to improve their cultivation and increase strength.", "Elephants Strength Skillwas even more precious than the Spirit-slayer Sword.", "“Huff!”", "Taking a deep breath, Su Mo looked at the other three scrolls.", "Compared to Spirit-slayer Sword andElephants Strength Skill, the other three manuals were more ordinary.", "The three scrolls were all Lower Lv 3, and they were respectively on swordsmanship, footwork, and cultivation.", "Although not as good asElephants Strength Skill,the three scrolls were still much better than those of the Sus.", "These were exactly all that Su Mo needed.", "He did not know what the remaining milk white crystals were, but judging from their strong Spiritual Qi, he knew they were precious.", "After a while, Su Mo calmed down and put away the other manuals, leaving onlyElephants Strength Skill.", "He carefully read the formulas and key points and memorized them.", "The underground world was safe and quiet, so he sat down cross-legged, released his Martial Soul, and started cultivating.", "Elephants Strength Skillwas a mysterious cultivation skill that quenched the body with the Spiritual Qi from heaven and earth or one’s own genuine Qi.", "Su Mo’s genuine Qi became an elephant-shaped rune, entering and quenching his body.", "After an hour, he suddenly opened his eyes in shock.", "“This cultivation method requires so much genuine Qi!”", "After cultivating for two hours, Su Mo’s genuine Qi was almost completely consumed.", "Next, Su Mo could only use his Martial Soul to absorb Spiritual Qi from heaven and earth to quench his body.", "All the absorbed Spiritual Qi became runes and entered his body.", "Su Mo’s body absorbed Spiritual Qi runes crazily like a bottomless pit.", "How time flew!", "Su Mo kept cultivating for eight days, during which he caught fish to sate his hunger.", "On the sixth day, Su Mo succeeded in cultivating the first realm ofElephants Strength Skill.", "After this success, his body became much more powerful. The force of his fist alone was more than the force of three tigers, which was stronger than that of a martial artist at Lv 3 Qi Cultivation Realm.", "A martial artist at the Qi Cultivation Realm could increase his force by that of one tiger by increasing a realm of cultivation.", "The force of one tiger was about 250 kilograms, making the force of three about 750 kilograms.", "Su Mo felt that his force was almost 1000 kilograms, the force of four tigers.", "His strength advanced rapidly after cultivating for a few days, which encouraged him to try to complete the cultivation method.", "If he could grasp more than 10 realms of the cultivation skill, he would be invincible in Skymoon Country, let alone Sunnywood City.", "However, he obviously felt that cultivating the second realm would be ten times slower than cultivating the first realm.", "It had only taken six days to cultivate the first realm, but it would take at least two months to completely cultivate the second realm.", "Therefore, after two days of cultivating, Su Mo stopped.", "After being here for ten days, it was time to go back.", "After Su Mo’s genuine Qi completely recovered, he buried the golden skeleton, left the underground world, and ran like the wind back to Sunnywood City.", "The golden skeleton gave Su Mo an opportunity through its storage ring, so Su Mo repaid it by laying it to rest.", "On his way back, Su Mo suddenly thought of something.", "CultivatingElephants Strength Skillneeded a great deal of Spiritual Qi, and more Spiritual Qi would be required in future cultivating.", "If he kept cultivating with this skill, all the Spiritual Qi absorbed by his Martial Soul would be used up.", "His genuine Qi would not increase, and his cultivation would not improve.", "If Qi Refining and Body Cultivation were conducted at the same time, the cultivation of both aspects would be greatly slowed down.", "“Should I give up Qi Refining and focus on Body Cultivation?”", "Su Mo immediately rejected this idea.", "Carrying out Qi Refining and Body Cultivation at the same time was probably difficult for others, but it would be no problem for him, because he could upgrade his Martial Soul.", "As long as the level of his Martial Soul improved, so would the speed of absorbing Spiritual Qi, so that cultivation could be enhanced quickly as well.", "His Martial Soul was now of Rank 3 Human Class, and its speed of absorbing Spiritual Qi was ten times faster than that of Rank 1 Human Class.", "If his Martial Soul upgraded a few ranks, his cultivating would certainly accelerate greatly.", "Therefore, Qi Refining and Body Cultivation could only enhance his strength, and they would have little effect on his cultivating speed.", "“Haha! It seems like I’ll have to kill more in the future!”", "Su Mo smiled bitterly, thinking that only killing could help him devour both Beast and Martial Souls!"]}, "Chapter 8": {"Name": "Worse than Trash", "Translator": "Transn", "Editor": "Transn", "Story": ["The martial practice field of the Sus, Sunnywood City.", "Dozens of inferior Su disciples were gathered on the large martial practice field.", "A middle-aged man in a gray robe sat in the center of the field, describing his martial arts experience to the inferiors.", "He was Su Tai, the Fourth Elder of the Sus.", "The inferiors present had all recently awakened their Martial Souls.", "They had just reached the Qi Cultivation Realm and lacked cultivation experiences, so the Sus arranged for elders to speak to them.", "As one of the three major clans in the city, the Sus had many more inferior disciples than the ones present. Some of the older disciples had awakened their Martial Souls two years ago, even reaching Lv 7 or 8 Qi Cultivation Realm.", "Those disciples with high cultivations would not attend these lectures.", "After returning, Su Mo spotted the Fourth Elder in the field and walked over to him.", "“Su Mo, all the other disciples who awakened their Martial Souls with you arrived a long time ago. Why are you only showing up now?”", "The Fourth Elder paused his lesson and sullenly asked the unhurried Su Mo.", "It was a great honor to attend a lecture given by him, and all the other disciples came early to wait for him, yet Su Mo’s late arrival showed that he had no respect for the elder.", "Many of the disciples smirked to see Su Mo get into trouble.", "Su Mo never expected the Fourth Elder to scold him for being late, since elders’ lectures were completely optional.", "“Fourth Elder, I just returned from an expedition,” Su Mo respectfully replied.", "“Expedition?”", "The Fourth Elder smirked and said, “With your crappy Martial Soul? You won’t achieve anything great in your lifetime. You have nothing to experience!”", "Su Mo’s expression instantly became cold, and he huffed, “Fourth Elder, I respect you because you’re an elder, but you should know that an elder without good qualities isn’t worthy of respect!”", "“What? Are you saying I’m unworthy of respect?”", "The Fourth Elder was fuming. How dare a useless fool, a piece of trash provoke him?", "“Doesn’t calling me trash as an elder make you unworthy of respect?”", "Su Mo was also infuriated. Ever since he awakened his Martial Soul, not only did inferior disciples despise him, now even elders treated him with contempt.", "Did they all think he could be easily bullied?", "It seemed that he should not keep a low profile in the future!", "“How dare you!”", "The Fourth Elder shouted in rage. “Am I wrong? Aren’t you trash and a useless fool with your Rank 1 Human Class Martial Soul? Is there anyone else in the city with such a crappy martial soul?”", "“That’s right! You’re nothing but trash! You’re a disgrace to our clan!”", "One of the disciples yelled.", "Su Mo turned his head and saw that it was Su Heng who had spoken.", "With Su Heng’s words, other disciples followed suit.", "“Right! Rank 1 Human Class! You’re a good-for-nothing!”", "“That’s right! Shame on you!”", "“…”", "Su Heng laughed as many disciples echoed him. He looked at Su Mo and said, “Su Mo, so many people are calling you trash and a good-for-nothing. Do you know your place?”", "The Fourth Elder laughed and said with a sneer, “Su Mo, I told you so!”", "Su Mo walked up to Su Heng and said, “Su Heng, you call me a piece of trash and a good-for-nothing, but let me ask you this: if you find out you’re not as good as me, what does that make you?”", "“I’m not as good as you? Haha! This is the funniest joke I’ve ever heard.” Su Heng sneered.", "Not as good as Su Mo?", "He had to be joking.", "Su Mo’s eyes glinted coldly, and he said with a smile, “Su Heng, I’m issuing you a challenge. Do you dare to accept it?”", "His words silenced everyone.", "They all looked at Su Mo in disbelief.", "Su Mo actually challenged Su Heng?", "Su Heng was also stunned. After he awakened a Martial Soul of the Rank 4 Human Class, his position in the clan rose greatly, and he was awarded many family resources, which allowed him to reach Lv 3 Qi Cultivation Realm.", "Yet, this good-for-nothing Su Mo still dared to challenge him?", "The Fourth Elder was the first to respond. He said to Su Heng in a hurry, “Since he wants to challenge you, you should teach him a lesson.”", "Su Mo’s earlier provocation had angered him. As an elder, he could not directly punish his inferior, but luckily, Su Mo presented the opportunity himself.", "“Haha! Don’t worry, Fourth Elder! I definitely won’t disappoint you!”", "Su Heng smiled and walked towards Su Mo, his eyes flickering with malice.", "Ever since Su Mo provoked him in the Book Collection Pavilion, he had been looking for an opportunity to teach him a lesson!", "This unexpected challenge greatly excited him.", "“Su Mo, how many moves of mine can you endure? Three? Or just one?”", "Now that he was about to beat up Su Mo, he was in a very good mood.", "Su Mo lifted his index finger and shook it.", "“Haha! You’re quite self-aware! At least, you’re aware that you can only endure one move.” Su Heng chuckled.", "“No! I mean I only need one move to deal with you,” Su Mo shook his head and said calmly.", "Su Mo was not being cocky. Even without using genuine Qi, his physical strength was far more powerful than that of a martial artist of Level 3 Qi Cultivation Realm, rivaling the power of a martial artist of Level 4.", "“One Move!”", "Everyone was shocked by Su Mo’s words and thought he was a retard.", "Even between martial artists of the same level, it was rare for one to defeat the other with one move. Never mind Su Mo, whose cultivation was much lower than Su Heng’s.", "Defeating Su Heng with one move! They really had no idea if Su Mo was conceited or idiotic!", "“Defeat me with one move?”", "Su Heng became unpleasant. He did not think a piece of trash like Su Mo would dare look down on him like this.", "“If I don’t cripple you today, my name won’t be Su Heng!”", "Boom!", "With a roar, Su Heng immediately released his Martial Soul, and four yellow halos shined behind him.", "Rank 4 Human Class Martial Soul!", "Su Heng’s Martial Soul was a majestic goshawk with sharp eyes.", "After he released his Martial Soul, Su Heng’s aura rose sharply.", "His cultivation completely exploded.", "“Die, Su Mo!”", "Su Heng roared and was the first to strike, clawing at Su Mo’s chest.", "Su Heng used his strongest skill so he could defeat Su Mo in one move and let Su Mo know the distance between them.", "He also wanted Su Mo to know what a joke his earlier pride was!", "Su Mo raised his hand and punched Su Heng’s claw.", "This was a regular punch without using Martial Soul or Genuine Qi.", "Su Heng sneered. This good-for-nothing was so arrogant that he wanted to stop him with a punch? Impossible!", "“I’ll break you!”", "Genuine Qi swiftly spewed from Su Heng’s hand, and his five fingers turned to silver spears. He wanted to break Su Mo’s fist.", "What happened next was completely unexpected.", "When his claw hit Su Mo’s fist, Su Heng felt a strong force that pushed his hand away and hit his chest.", "Bang!", "The fist squarely landed on Su Heng’s chest. A raging force surged from Su Mo’s fist, fracturing his chest with the sound of cracking bones. Su Heng was thrown about six meters away and crashed on the ground, spewing blood.", "The audience was completely silent. All eyes were frozen on him.", "Su Mo defeated Su Heng with a single punch?", "The Fourth Elder looked at Su Heng, who was lying on the ground in a daze.", "“How could it be… How could it be?”", "Su Heng was unable to accept the outcome and roared angrily with a twisted expression. However, just after he finished shouting, he was spitting blood again.", "“You called me a piece trash and a good-for-nothing every time you opened your mouth, but this piece of trash just defeated you with a single punch. Doesn’t that make you worse than trash?”", "Su Mo said mockingly, walking to Su Heng and looking down on him.", "“You… ” Su Heng looked livid, ashamed, and resentful.", "“And you, Fourth Elder. Do you still think I’m useless now? I’ve defeated your prodigy, Su Heng, whom you thought highly of. What is he now?”", "Su Mo looked at the Fourth Elder.", "“You only won through sheer luck. You have nothing to be smug about!”", "The Fourth Elder’s expression was unpleasant. “The year-end clan meeting is in two months. When that time comes, you’ll realize the true abilities of the outstanding talents in our clan. You’re nothing compared to them!”", "“Through sheer luck?” Su Mo said with a smile, “I am quite lucky. Perhaps “through sheer luck”, I can achieve a high ranking in the clan meeting.”", "At that, he turned around and left."]}, "Chapter 9": {"Name": "Purple Gold Pavilion", "Translator": "Transn", "Editor": "Transn", "Story": ["Purple Gold Pavilion", "In the yard, Su Mo kept swinging his fist with sharp whistling sounds and layes of fist shadows.", "Bam! Bam! Bam!", "Amidst constant resounding collisions, Su Mo immersed himself in his fistplay.", "He pictured himself as the sea, the genuine Qi as the water, and his fist force as great waves dashing against the rocks and constantly gushing.", "After a long time, he stopped, wiped sweat off his forehead, and sat down in the yard.", "Su Mo had made rapid progress in cultivating Ninefold Ocean Wave Fist. He had already achieved the Great Completion Realm in just two days.", "InNinefold Ocean Wave Fist, threefold fist force was a sign of crossing the threshold, fivefold fist force was a sign of Minor Completion, and sevenfold fist force was a sign of Great Completion. Now that he had achieved sevenfold fist force, he was not far from achieving ninefold fist force, which was a sign of the Completion Realm.", "With his strength and physical force nowadays, Su Mo was not afraid of martial artists at Lv 4 Qi Cultivation Realm at all.", "He did not rush to cultivate the scrolls in the storage ring, because it was more urgent to improve his cultivation.", "“I have to find a way to increase the rank of my Martial Soul,” Su Mo murmured to himself.", "He was now performing both Qi Cultivation and Body Refining at the same time. He needed a great amount of Spiritual Qi for Elephants Strength Skill, but his Rank 3 Human Class Martial Soul did not absorb Spiritual Qi quickly enough.", "The only way to improve the rank of a Martial Soul was to devour Beast Souls and other Martial Souls.", "Devouring Martial Souls was not practical for now, since he could not kill people in the city, so he had to devour Beast Souls.", "In addition to hunting for Beast Souls, he could also buy them with gold from any big shop in Sunnywood City.", "However, they were not cheap. The higher the rank of demonic beast, the pricier its Beast Soul was.", "As far as Su Mo knew, the Beast Soul of a demonic beast with Lv 3 or 4 Qi Cultivation Realm usually cost over one kilogram of gold each.", "After pondering for a while, he had an idea and walked to the Master Mansion.", "“Haha! Mo’er, you came just in time. I have something to ask you.”", "In the Master Mansion, Su Hong smiled at his son and asked, “Is it true that you beat Su Heng with just one move the other day?”", "“Yes.” Su Mo nodded.", "“Haha! Good, you proved yourself to be my son.”", "After hearing his son confirm it personally, Su Hong was very satisfied. He knew that Su Mo might have encountered some miracles, but he did not inquire about them and just said encouragingly, “Mo’er, just keep trying. Even though your Martial Soul doesn’t have a high rank, you may still reach the Spiritual Martial Realm one day.”", "“Yes, Father.”", "“Alright. Why are you here?”", "“I have a favor to ask. Please help me,” Su Mo answered earnestly.", "Su Hong was a little bit surprised by Su Mo’s seriousness and said, “Mo’er, I’m your father, not a stranger. Tell me what you want, and as long as I can do it, I will never decline.”", "“Father, I need 500 kilograms of gold,” Su Mo said.", "He looked at his father nervously, for fear of refusal.", "500 kilograms of gold was not a small sum. Usually, the income of the entire Su family for a whole year was only 5,000 kilograms of gold, so 500 kilograms of gold was more than the Sus’ monthly income.", "If Su Mo was still regarded as a genius, it would not be difficult to get him 500 kilograms of gold.", "However, with his Martial Soul, he was regarded as a piece of trash. Even if Su Hong managed to get him the gold, he would be under a lot of pressure from the family.", "Su Mo had asked for such a large quantity of gold because he wanted to buy a lot of Beast Souls. As long as he could get enough Beast Souls, the rank of his Martial Soul would soar, and along with it, his cultivation speed.", "Su Hong was surprised. He stared at his son to make sure he was not kidding, but after a while, he nodded and said, “Wait here. I’ll be back in a minute.”", "Then, he left.", "He did not ask Su Mo why he asked for so much because he trusted his son.", "Su Mo waited in silence, and soon, Su Hong returned.", "“Here are the gold tickets for 500 kilograms of gold. Take them!” Su Hong passed Su Mo several gold tickets.", "Holding the tickets, Su Mo took a deep breath and said, “Father, I won’t let you down in the clan meeting in 2 months.”", "…", "Su Mo headed toward the marketplace.", "After an hour, he stood at the door of a big store. It had a gilded tablet with bold script that read: Purple Gold Pavilion.", "Purple Gold Pavilion was a three-storey tower covering over 100 acres. It was the biggest store in the entire city. As long as you had enough money, you could get any cultivation skill, elixir, weapon, or anything else related to cultivation.", "It was said that Purple Gold Pavilion had powerful connections, belonged to a major chamber, and had branches in many cities in Skymoon Country.", "It held so much power in Sunnywood City that even the Sus and the Weis dared not to get in trouble with it.", "“How can I help you?” asked a young and beautiful maid reverently as Su Mo entered the pavilion.", "“I want to buy some Beast Souls,” Su Mo answered.", "“You want to buy Beast Souls? Come with me!”", "Su Mo soon followed her to a counter that specialized in Beast Souls, where there stood an old man in gray. He smiled and asked, “Could you tell me what rank of Beast Souls you want to buy?”", "“How much Beast Souls of Middle Lv 1 cost?” Su Mo asked.", "A Beast Soul of Middle Lv 1 was of Class 4 Lv 1, Class 5 Lv 1, or Class 6 Lv 1.", "“Class 4 Lv 1 Beast Souls cost one and a half kilograms of gold each, Class 5 Lv 1 Beast Souls are two and a half kilograms, and Class 6 Lv 1 Beast Souls are five kilograms,” the old man answered.", "“I’ll take 200 Class 5 Lv 1 Beast Souls,” Su Mo said after some quick consideration.", "He had devoured a lot of Beast Souls in Breezewind Mountain, so he knew that Beast Souls of higher rank were more effective.", "While the prices of Beast Souls doubled with each one level, his Martial Soul was only at Rank 3, so Class 5 Lv 1 Beast Souls were enough for him.", "“What?”", "The old man was so astonished, so he checked again:”Are you sure you are taking 200 Class 5 Lv 1 Beast Souls?”", "“Yes, is there a problem?” Su Mo asked.", "“I can’t call the shots for such a grand deal. I need to inform the leader of Pavilion. Please wait a moment!” the old man answered and rushed into the backyard of Purple Gold Pavilion.", "Su Mo could do nothing but wait.", "Soon, the old man rushed back and told Su Mo, “The leader of Pavilion would like to meet you.”", "“Show me the way,” Su Mo said.", "In the backyard of Purple Gold Pavilion, there was a small house. Su Mo followed the old man into a side hall.", "He was stunned when he got inside.", "There was an extraordinarily stunning woman sitting in the hall.", "She looked like she was in her late 20s, with refined facial features on her charming face, and her skin was snow-white. She wore a tight leather skirt that fit her curvy body perfectly.", "This was an enchanting beauty with peerless charm!", "She was the leader of Pavilion, Luo Huan."]}, "Chapter 10": {"Name": "Luo Huan", "Translator": "Transn", "Editor": "Transn", "Story": ["Luo Huan", "“Young Master Su, welcome to Purple Gold Pavilion.”", "Luo Huan smiled coyly, giving off an air of seduction. Even the sound of her voice held a hint of charm.", "Su Mo quickly regained his composure while secretly scolding himself for losing focus and almost being captivated by her.", "However, this woman was truly exceptional. He had rarely seen anyone like her, even in his past life.", "“Please take a seat, Young Master Su.”", "Luo Huan arched her thin brow slightly and could not help but feel impressed by Su Mo.", "She was very confident about her looks. Any man who saw her was often rendered speechless or would have a lewd expression on his face.", "Meanwhile, this 14-year-old young man was only slightly stunned before regaining his composure.", "“Thank you, Her Excellency.”", "Su Mo sat down, confused by the fact that she knew his name.", "However, Su Mo soon realized that he was now “well-known”.", "“Ha ha! Don’t be so formal. My last name is Luo, and I’m a couple of years older than you, so you can call me Sister Luo,” Luo Huan said with an unwavering and charismatic smile.", "Um!", "Su Mo was dumbfounded, and then immediately nodded his head.", "Luo Huan continued, “I heard that Young Master Su wants to purchase 200 Class 5 Lv 1 Beast Souls, but our pavilion only has 150. Would Young Master Su be willing to have the remaining 50 replaced by Beast Souls of other levels?”", "“Class 4 Lv 1 Beast Souls would be fine!” said Su Mo.", "He did not mind that Class 4 were less effective because he could simply take more.", "“Yes, Young Master!” Luo Huan nodded, took out a gray pouch, and handed it to him.", "“Here are 150 Class 5 Lv 1 Beast Souls, and 85 Class 4 Lv 1 Beast Souls. That’ll be 500 kilograms of gold. Also, this storage pouch is a gift from me to you.”", "Su Mo was shocked by her generosity.", "This storage pouch was definitely not cheap. Even the cheapest pouches cost over 35 kilograms of gold.", "“Ha ha! Thank you so much, Sister Luo!”", "Su Mo did not object and accepted the storage pouch.", "After buying the Beast Souls, Su Mo immediately said his goodbyes and left.", "“My Lady? I heard that young master Su only has a Martial Soul of Rank 1 Human Class, why are you…?” asked a frowning old woman, who appeared silently in the hall.", "“Aunt Xu, Su Mo isn’t as simple as he seems. I can feel that he has incredibly strong Qi blood, much stronger than that of other martial artists of his level.”", "…", "While Su Mo was out purchasing Beast Souls in Purple Gold Pavilion, there was a meeting going on in the Su meeting hall.", "“First Elder, why have you called this meeting?”", "asked Su Hong, who was seated at the head of the table and eyeing the First Elder.", "“Master, I heard from the Accounting Department that you took out 500 kilograms of gold today. What were you planning on using this money for?”", "The First Elder Su Yue, a grumpy middle-aged man in his 40s, interrogated Master Su Hong as soon as the meeting began.", "As the First Elder of the Sus, Su Yue was second only to the Master in power and status.", "He was also the only person in the Sus who had the nerve to speak to Su Hong in this manner.", "“These 500 kilograms of gold were funds for Su Mo to purchase resources for his cultivation,” admitted Su Hong frankly.", "“What!?” The First Elder was shocked.", "All the elders were also completely shocked!", "“Su Hong, are you insane?”", "The First Elder came to his senses, sprung to his feet, and roared, “Su Hong, how dare you use 500 kilograms of gold to cultivate your failed son! As the Master, what right do you have to spend that much gold on your own son? The Sus doesn’t consist of only your family. I won’t allow it!”", "“That’s true. Su Mo is a failure. We shouldn’t waste so much on raising him!” agreed the Fourth Elder, Su Tai.", "“Exactly, Master. It’s so selfish of you to care only about your own son!”", "“How could you waste so much gold on raising your degenerate son?”", "“…”", "All the other elders spoke to echo the First Elder.", "“Are you all done talking?”", "Su Hong waited for everyone to quiet down and scanned the room of elders coldly. “I’ve already spent the 500 kilograms of gold. This issue is over. If there’s nothing else to discuss, let’s end this meeting!”", "“What? It’s all been spent already?”", "Everyone was stunned.", "The First Elder’s countenance hardened.", "His son, Su Yu, had awakened a Rank 5 Human Class Martial Soul and was regarded as the first genius in the Sus, yet all his monthly cultivating expenses barely exceeded 50 kilograms of gold.", "Yet, a piece of trash like Su Mo somehow managed to use up over 500 kilograms.", "…", "After successfully buying his Beast Souls, Su Mo was extremely excited and impatiently ran home.", "He was eager to see what level his Martial Soul would advance to after devouring these Beast Souls.", "“It should be enough to advance to Rank 6 Human Class!”thought Su Mo.", "“Ha ha! Little lady, with me, you’ll feel like a goddess every day.”", "“Get out of my way!”", "“Damn, don’t flatter yourself. It’s an honor to be selected by me.”", "Suddenly, Su Mo heard a ruckus and saw three young men ahead of him surrounding a maid in blue.", "She was extremely pretty, with a stunning face, pale skin, and willowy figure.", "The leader of the young men was about 16 or 17 years old and sickly pale, and he was staring lewdly at the maid.", "The maid was terrified but could not escape, since she was surrounded.", "“Ha ha! You have nowhere to run!”", "The young man cackled perversely and reached out to grab her hand.", "BAM!", "Suddenly, a palm reached out and cast away his hand.", "“Damn it, what nuisance has the nerve to interfere with my business?” the young man yelled angrily.", "He turned around to see who it was, and immediately chortled, “Wow! Look who it is, the top ‘genius’ of the Sus!”", "The young man heavily emphasized the word “genius” with a jeering expression on his face.", "It was indeed Su Mo.", "“Come here, Qingqing!”", "Su Mo gestured for the maid to stand behind him.", "This maid in blue also belonged to the Sus and was called Su Qingqing. Although Su Mo was not close to her, he still knew who she was.", "He could not bear to watch the inferiors of the Sus being bullied without doing something.", "“Brother Su Mo!”", "As soon as Su Qingqing saw Su Mo, she hurriedly hid behind him like he was her savior.", "“Only you, Wei Lin, would be so shameless to harass women in broad daylight!” chuckled Su Mo at the perverted young man.", "The young man’s name was Wei Lin. He was the second son of the Master of the Weis.", "He was notorious in Sunnywood City for using his clan’s power as an excuse to commit all kinds of atrocious deeds.", "Countless women had been violated by him.", "“How dare such a piece of trash like you interfere with my business. You must be tired of living!” said Wei Lin in a wild and boasting tone.", "“Are you calling me a piece of trash?” Su Mo’s expression hardened. He was instantly enraged by the title.", "“That’s right. You have a Rank 1 Human Class Martial Soul. That makes you a piece of trash!” scoffed Wei Lin.", "“You have two choices: One, give Su Qingqing to me, kneel and bow your head to me in repentance, and call me grandfather three times, so that I will let you go. Two, I’ll shatter all your limbs, then take Su Qingqing with me.”", "Wei Lin was determined to have Su Qingqing today. He had pined for her beauty for a long time, and he was not willing to give up his opportunity to have her.", "Although Su Qingqing belonged to the Su clan, she was only a common inferior, and her parents had little status in the clan. Even if Wei Lin forced himself on her, there would be few consequences.", "“Kneel and bow my head in repentance? Call you grandfather three times?”", "Su Mo’s eyes flashed with rage.“Are all members of the Wei clan the same? Both Wei Long and Wei Lin love to make people bow down to them!”", "“I’m giving you the span of three breaths to disappear from my sight, or you’ll have to deal with the consequences,” said Su Mo coldly.", "He was not at all scared of these three people.", "Aside from Wei Lin, who was at Lv 4 Qi Cultivation Realm, the other two with him were both at Lv 3.", "“What?”", "Wei Lin was shocked and then scoffed, “Deal with the consequences? How dare a piece of trash like you say such bold things to me!”", "“You two, attack him! Don’t beat him to death. Just break his limbs,” ordered Wei Lin.", "“Ha ha, don’t worry young master. Leave it to us!”", "His two companions cackled and rushed toward Su Mo."]}, "Chapter 11": {"Name": "Rank 5 Human Class", "Translator": "Transn", "Editor": "Transn", "Story": ["Wei Lin’s two lackeys rushed at Su Mo without hesitation.", "However, they were thrown back much faster.", "Bang! Bang!", "With two crashes, the men flew back and fell to the ground heavily with painful screams.", "“Wei Lin, do you really think these two degenerates can break my limbs?” Su Mo said with a disdainful smile.", "“You…!”", "Wei Lin had not expected that Su Mo could defeat them in merely a second, so he felt very angry.", "“Humph! You’re at Lv 3 Qi Cultivation Realm. No wonder you’re so arrogant.”", "Wei Lin laughed at him and threatened. “But your strength is nothing compared to mine. Today, I’ll not only break your limbs but also destroy your cultivation and make you a truly useless piece of trash.”", "“Ho!”", "As Wei Lin shouted out loud, he fully released his Lv 4 Qi Cultivation, and his Martial Soul rose up behind him, bathed in yellow light.", "His Martial Soul was a demonic wolf of Rank 3 Human Class, so it had three yellow halos.", "His talent was only average, but he was older and had awakened his Martial Soul last year, so he was able to reach Lv 4 Qi cultivation Realm.", "…", "The commotion had already attracted many spectators.", "They all burst into a discussion since the two were both “well-known”.", "“He’s Su Mo, the young master of the Sus. He’ll get a really bad beating today for insulting Wei Lin, the second son of the Weis!”", "“Yeah! He might be capable of defeating those two subordinates, but he can’t defeat Wei Lin.”", "“…”", "Standing behind Su Mo, Su Qingqing instantly became pale after seeing Wei Lin releasing all his spirit.", "She was only a normal girl who had not awakened her Martial Soul, so Wei Lin’s menacing aura made her very nervous.", "“Brother Su Mo, I shouldn’t have gotten you involved. It’s best if you leave! Don’t worry about me,” Su Qingqing said to Su Mo hastily.", "Su Mo smiled and said, “Qingqing, relax. He’s all bark and no bite.”", "“Hum! Su Mo, you’re so arrogant and ignorant.”", "Wei Lin punched toward Su Mo’s lower abdomen, shouting, “Go to hell!”", "He intended to destroy Su Mo’s elixir field first.", "“You’re asking to die!”", "At the same time, Su Mo punched toward Su Heng’s fist, channeling his genuine Qi and sevenfold fist force coupled with the strength of his body.", "“Ninefold Ocean Wave Fist!”", "Bang!", "The two fists crashed into each other, releasing a blast wave around. Su Mo stood in place, while Wei Lin was knocked back and exposed his vulnerable torso.", "Dong!", "Su Mo seized this opportunity to quickly rushed forward and punched toward Wei Lin’s lower abdomen.", "“You piece of trash! How dare you?”", "Wei Lin was very shocked, but he did not have enough time to dodge it. In a hurry, he tried to use his left arm to block the attack.", "Crack! Pop!", "After the sounds of breaking bones followed a sound similar to that of popping a balloon.", "Wei Lin’s arm was snapped by the powerful force, and his bare bones exposed.", "Even though his arm had blocked Su Mo’s fist, his elixir field was shattered.", "“You… you destroyed my elixir field?”", "Wei Lin became numb shock, then he instantly started to scream.", "“Since you want to destroy mine, you run the risk of having yours destroyed. Get used to being a useless waste!” Su Mo said coldly.", "He would never hold back against such dirtbags.", "Wei Lin was at Lv 4 Qi Cultivation Realm, but he had indulged so much in wine and women that his genuine Qi was weak. Therefore, he was barely better than Su Heng, who was at Lv 3 Qi cultivation Realm.", "After saying those words, Su Mo pulled the shell-shocked Su Qingqing away, leaving the stunned crowd behind.", "…", "In the mansion of the Sus—", "After coming back to the mansion, Su Mo went to his room.", "He took out his storage pouch and poured out over 200 gray crystals.", "These were Soul Crystals, which were used to contain Beast Souls.", "Since the beasts’ level were too low, the Beast Souls had lost their consciousness after death.", "If not contained in the Soul Crystals, Beast Souls would vanish in a very short time.", "Su Mo released his Martial Soul, a dark vortex, floating behind him with three shining yellow halos.", "Crack!", "Su Mo crushed two Class 4 Lv 1 Soul Crystals, and the Beast Souls instantly floated out.", "He hurriedly channeled his Devouring Martial Spirit, which immediately produced a strong suction and devoured the two Beast Souls.", "His Devouring Martial Spirit did not change after devouring two Beast Souls, so he continued to crush the crystals.", "Crack! Crack! Crack! Crack!", "10 Beast Souls!", "20 Beast Souls!", "40 Beast Souls!", "As he devoured the 60th Class 4 Lv 1 Beast Soul, the Devouring Martial Soul abruptly trembled, and the fourth yellow halo burst out.", "Rank 4 Human Class Martial Soul!", "Su Mo felt excited and continued devouring.", "When he finished all Class 4 Lv 1 Beast Souls, he started to devour Class 5 Lv 1 Beast Souls.", "He could clearly feel that these Beast Souls were more powerful than those before.", "10 Beast Souls!", "30 Beast Souls!", "50 Beast Souls!", "100 Beast Souls!", "140 Beast Souls!", "Even after he devoured the 140th Beast Soul, he was depressed to find that his Martial Soul had still not progressed.", "The higher the level of his Martial Soul, the harder it was to progress.", "“I hope the last 10 Beast Souls won’t disappoint me.”", "Crack! Crack! Crack!", "After he crushed and devoured the last 10 all at once, his Devouring Martial Soul finally changed.", "Another yellow halo appeared again.", "Five yellow halos. It was Rank 5 Human Class Martial Soul!", "He was overjoyed and immediately used his Martial Soul to absorb the aura from heaven and earth with all his strength.", "Strands of aura quickly convered to him and entered his body.", "After his Martial Soul leveled up, it absorbed aura 10 times faster than it did at Rank 3 Human Class.", "After a long time, he stood up in high spirits.", "“Su Yu, you’re called the first genius of the Sus, and you have a Rank 5 Human Class Martial Soul, right? Just wait until I crush you in the clan meeting.”", "Su Mo smiled.“Also, Liu Yushan, you’ll know how stupid your choice was.”", "Then, he went to the clan armory and picked out a steel long sword.", "He needed to practice swordsmanship.", "He could not use the Spirit-slayer Sword often because its level was too high.", "He knew that it was not smart to show off his wealth.", "He would cultivate not onlyDivine Wind Swordplaybut alsoShadow StepsandPrimordial Qi Manual.", "These three manuals were Lower Lv 3 Cultivation Skills. His strength would greatly increase when he had successfully cultivated them.", "Divine Wind Swordplaybelonged to the Wind System and had four moves.", "The first move was Gale Blade.", "The second move was Separating Remnant Clouds.", "The third move was Wind Roaring in the Sky.", "The fourth move was Divine Wind Kill.", "Each move was harder to practice, and more powerful than the one before.", "The key point ofDivine Wind Swordplaywas speed. The moves must be fast beyond the limits.", "Shadow Stepswas a profound footwork. When he reached its Great Completion, he could move shadowless.", "As toPrimordial Qi Manual,a cultivation skill, the practicer could cultivate Primordial Genuine Qi, which was 10 times more powerful than the genuine Qi inClouds Skill.", "In the following days, he practiced swordsmanship and movement in daytime and cultivated Primordial Qi at night. As a result, his strength was stably improving.", "One day, he was practicing swordplay in the yard.", "The water-like sword radiance formed a shining sword curtain, and the unstoppable sword Qi sliced the air into pieces.", "Knock! Knock! Knock!", "Right at that moment, someone began knocking furiously on his door.", "Su Mo frowned and thought,“This man isn’t knocking on my door, he’s pounding onit,like he wants to smash it to pieces.”", "“Who is it?”", "Su Mo opened his door with a cold face."]}, "Chapter 12": {"Name": "The Punitive Visit", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo opened the door.", "A middle-aged man in his 40s stood behind the door with a face of indifference.", "He was Su Tai, the Fourth Elder of the Sus.", "“What do you want, Fourth Elder?” Su Mo asked coldly.", "“Humph! Su Mo, you’d better go to the meeting hall at once.”", "Su Tai smirked with a hint of gloating in his eyes.", "“The meeting hall? What for?”", "Su Mo felt confused.", "Su Tai impatiently scolded, “Stop with all the questions! You’ll know when you get there.”", "“Humph!” Su Mo grunted and walked toward the meeting hall.", "“Loser, you shouldn’t be so arrogant. I can’t wait to see you be punished today.”", "Su Tai sneered and followed closely behind.", "In the meeting hall—", "Su Hong sat in dignity in the seat of honor.", "Beneath him, several elders and junior disciples of the Sus were sitting to his left.", "On the right were two middle-aged men and three young men of the Weis, all of them fuming with an accusatory look.", "“Why hasn’t Su Mo arrived yet?”", "A middle-aged man of the Weis wearing a brocade robe asked sullenly.", "“Haha! Our Fourth Elder has already informed him. He’ll be here any minute,” said an elder of the Sus with a conciliatory smile.", "“Su Mo hurt my son. How will you punish him?” Another middle-aged man asked.", "He was Wei Wankong, the Master of the Weis.", "“Ah…”", "The present elders of the Sus remained speechless. They all wanted to say that the Weis could punish Su Mo however they liked, but they did not dare to speak before Su Hong.", "Nobody wanted to talk first and infuriate Su Hong.", "“Su Hong, your son hurt my son and destroyed my son’s cultivation. If you don’t do something about it, the Weis will never forget this,” said Wei Wankong, who coldly scanned the room and fixed his eyes on Su Hong.", "“Since Su Mo had evil intentions and hurt your son, we should let you punish him at will.”", "The First Elder replied before Su Hong could.", "His eyes were full of gloating.", "“How dare you?”", "Su Hong abruptly shouted and looked at him. “First Elder, are you the Master? Can you make decisions for the Sus?”", "“You…!”", "The First Elder was furious but could not refute him, and his expression suddenly became stony.", "“Master Wei, we don’t clearly know about the incident and can’t make a decision until my son is here,” Su Hong said to Wei Wankong.", "“Humph! I’m looking forward to a satisfactory result.” Wei Wankong sneered.", "“It will definitely meet your demands!” The Sus’ elders showed fake beaming faces.", "While some of them cursed Su Mo inwardly.", "“Why did that piece of trash choose to hurt Wei Lin, out of all people?”", "“That loser just got us into deep water! “", "None of the elders were willing to offend the Weis. While the Sus and Weis were regarded as the two largest clans, the latter was more powerful than the former.", "The Weis had ruled over Sunnywood City for over 200 years, so they had a profound background.", "However, the Sus only rose into prominence in the past few decades, so their background was less profound than the Weis’.", "The Weis sneered at the desperate Su elders, their faces full of contempt.", "Everyone waited in silence.", "The atmosphere in the hall was very grim.", "After a while, footsteps sounded outside of the door.", "Su Mo and the Fourth Elder entered the hall.", "“Su Mo, do you confess your crime?”", "The First Elder suddenly yelled as soon as Su Mo entered the hall.", "“Confess my crime?” With a glint in his eyes, Su Mo asked, “First Elder, what have I done wrong? Why should I confess?”", "“You maliciously mutilated the second son of Master Wei. You’re the scum of our clan and have embarrassed us greatly. What do you have to say for yourself?”", "The First Elder, with his determined gaze and unstoppable aura, wanted to fix the crime on Su Mo.", "“Su Mo, describe to us how you hurt Master Wei’s second son.” Su Tai, the Fourth Elder, also ordered.", "The other elders also echoed him. Now that the First Elder had taken the lead, they did not hold back.", "Now, all the elders of the Sus were on the First Elder’s side.", "The first elder not only was as powerful as Su Hong, but also, more importantly, he had a genius son.", "Su Yu had a Rank 5 Human Class Martial Soul, and as the first genius of the Sus, he would rule the clan someday.", "All of the Weis only watched silently.", "“Maliciously? Scum?”", "Su Mo laughed and indifferently asked, “Elders, as soon as I entered the hall, you said I’m malicious, called me a scum, and want my confession. How are you so sure that I’m guilty since you know nothing?”", "Glancing at the Wei clan, Su Mo realized that the Weis came here!", "“How dare you to quibble?” The First Elder yelled, and his looked extremely gloomy.", "Su Mo’s eyes grew cold. He sneered and said, “First Elder, you asked me to confess before hearing my explanation. Am I guilty just because you say I am? Is everything I said quibbling? Are you an elder of the Sus or the Weis?”", "“You…!”", "The First Elder was incensed. He did not expect Su Mo to be so sharp-witted.", "“It’s enough, Mo’er. Tell us about it in detail.”", "Su Hong said as he glared at the First Elder with narrowed and piercing eyes.", "“Alright!”", "Su Mo immediately gave them a specific description of what had happened.", "However, he did not mention Su Qingqing by name and only explained that Wei Lin wanted to abduct a girl.", "Su Qingqing was just a common inferior in the Sus, and he did not want to get her in trouble.", "“Humph!”", "As soon as Su Mo finished speaking, Wei Wankong burst out shouting, “Douchebag, you hurt my son, and you deserve to die, period.”", "“That’s right. You’re so mean! Death sentence!”", "“You should have known that you would die for provoking the Weis.”", "The Weis all started to yell one by one.", "“Wei Lin attempted to break my limbs and destroy my elixir field, so I was forced to maim him.”", "Su Mo ignored the Weis and instead asked indifferently, “Elders, in your opinion, was it criminal of me to defend myself against someone who wanted to destroy me?”", "“Outside of the mansion, all disciples of our clan can only be bullied by others, and if we fight back, we’ll be criminals. Am I right?”", "His brilliant words made all the elders sullen and silent.", "“Master Wei, it’s pretty clear that your son wanted to break my son’s limbs and destroy his elixir field, so he had to defend himself. Your son brought the trouble to himself.”", "“It’s impossible!”", "Wei Wankong shouted loudly with a cold expression. “My son’s misfortune is all your son’s fault. If you don’t let me handle this little piece of sh*t, you’ll face the wrath of the Weis!”", "“Humph! Destroying scumbag like your son is doing everyone a favor!” Su Mo disdainfully responded.", "“Fu*ker, go to hell!”", "Wei Wankong screamed angrily, suddenly stood up and flew toward Su Mo.", "A bleak aura of killing desire radiated from his body and enveloped the entire hall"]}, "Chapter 13": {"Name": "A Fight to the Death", "Translator": "Transn", "Editor": "Transn", "Story": ["No one had expected Wei Wankong to suddenly lose his temper.", "At a very high speed, Wei Wankong rushed in front of Su Mo and swung his palm toward him.", "If this Spiritual Martial Realm martial artist hit Su Mo, Su Mo would definitely die.", "Su Mo was frozen by Wei Wankong’s powerful aura and could not dodge his move at all.", "There was simply too vast of a difference between their strength.", "“How dare you!”", "Su Hong suddenly shouted and rushed toward Wei Wankong with a burst of genuine Qi, swinging at his head.", "If Wei Wankong did not stop, he could kill Su Mo, but he would also need to endure Su Hong’s attack.", "Su Hong’s strike could break even blocks of steel, not to mention Wei Wankong’s head.", "Therefore, Wei Wankong had to give up on killing Su Mo and turned around to block Su Hong.", "Boom!", "Their palms crashed together and released a strong sweeping force.", "Thud! Thud! Thud!", "Both men were struck back a few steps. They were equal in this confrontation!", "The pale-faced Su Mo, who was standing nearby, was pushed back a dozen steps by the air blast, narrowly escaping injury.", "“Wei Wankong!”", "Su Hong yelled thunderously with killing desire in his eyes. “How dare you attack my son in my own house? Are you questioning my authority?”", "“Humph! Your son got lucky today!”", "Wei Wankong was not rattled by the furious Su Hong at all and wore a calm expression.", "“Mo’er, are you okay?” asked Su Hong hastily as he went over to Su Mo, glancing over Wei Wankong.", "“I’m fine. Thank you, father!”", "Su Mo nodded and looked at Wei Wankong with cold eyes full of killing desire.", "“You old dog, I’ll keep this in mind and kill you some day!”", "Su Mo’s bleak voice was filled with terrifying killing desire.", "“A loser like you? Kill me?”", "With a disdainful expression, Wei Wankong then signaled to someone behind him with a wink.", "A haughty young man from the Weis walked out holding a spear and said, “Trash, you maimed the second young Master of our clan, which is unforgivable. I, Wei Liang, challenge you to a fight to the death. Do you dare to accept?”", "Wei Wankong could not kill Su Mo in one strike and obviously could not do it again, so he ordered Wei Liang to challenge Su Mo and kill him.", "“Fight to the death?”", "The Sus were all shocked.", "As a genius disciples, Wei Liang had reached Lv 6 Qi Cultivation Realm at a very young age. He actually challenged Su Mo!", "“Wei Wankong, Wei Liang is 17 years old and three years older than my son, right? Besides, hasn’t his cultivation has reached Lv 6?”", "Su Hong frowned and asked flatly, “You let an older disciple with a higher cultivation challenge my son. Do you have no shame?”", "He knew exactly what Wei Liang was thinking.", "He just wanted to kill Su Mo in battle!", "Wei Liang smiled faintly. “Master Su, I’m indeed three years older than Su Mo, but this isn’t an excuse. I’ll always be three years older than him, so does that mean I can never fight him?”", "He smirked at Su Mo contemptuously and said, “Su Mo, if you admit that you’re a piece of trash, destroy your own cultivation, and break your arms and legs, I won’t challenge you.”", "Su Mo coldly glanced at him.“Lv 6 Qi Cultivation Realm?”", "“Alright, I accept your challenge. But our fight will take place two weeks later.”", "Su Mo agreed to his challenge without hesitation.", "“Mo’er…” Su Hong was surprised.", "“Father, I have a plan. Please don’t worry!” Su Mo said with a wave of his hand.", "Su Hong frowned with worry, but he knew that his son was a calm person and never reckless, so he did not say anything else.", "“Well, Su Mo, remember what you said. In two weeks, at the Central Square of Sunnywood City, you and I are going to fight to the death.”", "Wei Liang was overjoyed and had a trace of contempt in his eyes.", "At that moment, the Weis laughed with disdain.", "“Su Mo would definitely die in two weeks.”", "The elders of the Sus were also secretly sneering at him. Su Mo was too stupid to bear Wei Liang’s provocation, and sealed his own fate.", "Su Mo’s death was insignificant to them. He was merely a piece of trash with a Rank 1 Human Class Martial Soul.", "“Master Su, see you in two weeks. Farewell!”", "The Weis left in high spirits.", "News of Su Mo and Wei Liang’s fight to the death quickly spread throughout Sunnywood City.", "Suddenly, that was all everyone was talking about!", "In the courtyard—", "Su Mo and his father sat face to face.", "“Mo’er, was it too reckless to accept Wei Liang’s challenge?”", "Su Hong was still worried.", "“Father, don’t worry. I’m sure I can defeat Wei Liang in two weeks,” Su Mo said confidently.", "Looking at Su Mo’s confident face, Su Hong could do nothing but nod. Su Mo’s strength had greatly increased recently, and Su Hong thought it might have been something miracle happened to him, so he did not say anything more.", "With a sigh, Su Mo took out a milk-white crystal from his storage pouch and asked, “Father, do you recognize this crystal?”", "“Hmm?”", "As soon as he saw it, Su Hong immediately became alert and asked, “Mo’er, this is a Spiritual Stone. Where did you get it?”", "“Spiritual Stone? I got it by accident. Father, what can it do?” Su Mo asked.", "“Spiritual Stones contain a great amount of Spiritual Qi that can be absorbed into the body to increase cultivation. However, only the Spiritual Martial Realm martial artists can use them. A Spiritual Stone has so much Spiritual Qi that it could blast a Qi Cultivation Realm martial artist to death.”", "“They are very expensive. Yours looks like the cheapest Lower Spiritual Stone, but it still worth thousands of taels of gold.”", "“They are extremely rare, and even our entire clan can’t get many in a year!”", "“It’s that valuable?” Su Mo was suddenly shocked.", "“Father, I have a lot of Spiritual Stones. You can take them!”", "Su Mo waved his hand, and a small pile of at least 100 glittering Spiritual Stones suddenly appeared on the stone table.", "“What?”", "Su Hong widened his eyes in disbelief.", "“100 Spiritual Stones?”", "“Each worth thousands of taels of gold?”", "That would be hundreds of thousands of taels of gold, which was many times the yearly income of the Sus.", "“Father, I happened to come upon an ancestor’s cave, and these Spiritual Stones were all from there,” Su Mo said honestly to his puzzled father.", "Su Hong supressed his shock, thought for a while, and said, “Mo’er, since they’re yours, you should keep them. They’re enough for you to buy a lot of cultivating resources to quickly improve your strength.”", "Su Hong did not accept the Spiritual Stones.", "“Haha! Father, just take them! I have a lot!”", "Su Mo smiled. He had about 200 Spiritual Stones. He took out half of them, and there were about 100 left in the storage ring.", "“There are still some more left?”", "Su Hong was stunned but immediately nodded happily and said, “I didn’t think you’d get so lucky. Well! In that case, I’ll take them. With these Spiritual Stones, the breakthrough of my cultivation is just around the corner.”", "He had a beaming face.", "Su Hong’s cultivation had been stagnant at the Peak Lv 4 Spiritual Martial Realm for many years, but with so many Spiritual Stones, before long, he could progress to Lv 5 Spiritual Martial Realm.", "Once he succeeded, he would have few opponents in Sunnywood City."]}, "Chapter 14": {"Name": "Laughable Scoundrel", "Translator": "Transn", "Editor": "Transn", "Story": ["After Su Hong left, Su Mo was about to begin cultivating.", "A beautiful young girl with thin brows and bright eyes came into his yard. It was Su Qingqing.", "“Brother Su Mo, I’m so sorry for causing you all these troubles. If it wasn’t for me, the Weis wouldn’t have been after you!”", "Su Qingqing felt incredibly guilty and repeatedly apologized to him.", "When she heard that the Weis were demanding revenge and that he and Wei Liang would have a battle to the death in two weeks, she was incredibly anxious.", "“Haha! Qingqing, don’t blame yourself. I’ll be fine!”", "Su Mo consoled her with a smile. “Wei Liang is no match for me at all. Do you think I’ll lose to him?”", "“Of course not. You’ll definitely be the winner!” said Su Qingqing confidently, shaking her head.", "“Haha! Then stop worrying!”", "“But…”", "Although Su Qingqing was quite confident that Su Mo would defeat Wei Liang, she was still anxious.", "After all, Wei Liang was a powerful genius among the Weis.", "“Qingqing, you will awaken your Martial Soul next year, right? If you cultivate well and become powerful, nobody will dare to bully you ever again!”", "He had a good feeling about this innocent girl, mostly because she was very pretty.", "“Yes, I’ll become powerful in the future, and then I can protect you!”", "Her determination was very adorable.", "After chatting with Su Qingqing for a while, Su Mo sent her off and started to cultivate.", "He sat down cross-legged, concentrated hard, and released his Martial Soul to absorb aura from heaven and earth.", "Although he currently stood at Lv 3 Qi Cultivation Realm, he also cultivated Primordial Qi. This made his genuine Qi very dense and powerful, so he was no worse than a Lv 4 Qi Cultivation opponent.", "Additionally, his physical strength had the force of four tigers, so he could also physically rival a Lv 4 martial artist without using Qi.", "Even so, for now, he was no match for Wei Liang, who stood at two realms higher at Lv 6.", "He had already cultivatedDivine Wind SwordplayandShadow Steps, but he was only in the beginner’s realm after three days and had limited combat forces.", "After two hours, he opened his eyes and stopped cultivating.", "Having packed some food and water into his storage ring, he set out with his longsword.", "He was heading to Breezewind Mountain again.", "While his Martial Soul had reached Rank 5 Human Class and cultivated much faster, it would still be difficult for him to defeat Wei Liang in two weeks if he cultivated the normal way.", "The fastest way to improve his power was through farming and killing.", "His Devouring Martial Spirit was insanely strong because it could not only level up his martial soul by devouring Beast Souls and the others’ Martial Souls, but also his cultivation by devouring Blood Qi and energy.", "Therefore, fighting and killing would be the quickest method to increase his strength.", "He also wanted to buy Beast Souls, since he possessed many Spiritual Stones. Even a few stones would sell for the price of tens of thousands taels of gold.", "However, he dismissed this idea because precious Spiritual Stones should be saved for the future when he was at a higher level.", "When passing through the clan’s noisy martial practice field, he noticed several disciples gathering together with noise and excitement.", "In the center of the martial practice field, two young men were stirring up wind and Qi in an intense training battle.", "“Hmm? It’s Su Yu!”", "Su Mo recognized one of them as Su Yu, whom he had not seen for some days.", "The young man Su Yu was fighting was a stocky young man.", "Su Peng, a strengthful young disciple among the Sus. It was rumored that he had reached the Peak Lv 5 Qi Cultivation Realm at only the age of 18.", "Their fight was even-matched, and it was hard to tell who was winning.", "“Brother Su Yu is really amazing. I can’t believe he becomes powerful as Su Peng in such short time!”", "“Brother Su Yu has a Rank 5 Human Class Martial Soul and is the first genius of our clan, so I’m not surprised.”", "“Since Brother Su Yu was prioritized by the clan and in seclusion for a long time, it makes sense that his strength has boomed.”", "“Haha! I think that Brother Su Yu will soon be as powerful as Su Tianhao, the top master among the Sus’ inferiors.”", "The disciples burst into a heated discussion as the fight intensified.", "Su Yu finally figured out Su Peng’s weakness and fiercely attacked him, forcing him to stumble back again and again.", "Su Yu took the opportunity to launch his final attack. He punched Su Peng’s chest, making his opponent spit blood and stumble back.", "“Wow, Brother Su Yu won!”", "“Long live Brother Su Yu!”", "“…”", "Following Su Yu’s victory, the field went into a big uproar.", "Su Yu stood proudly in the middle of the field in high spirits and look around in a haughty manner.", "“Hmm?”", "Then, he caught a glimpse of Su Mo nearby and laughed disdainfully.", "“Wow, ‘the number one genius’ of our clan is here!”", "He lifted his chin, looked down on Su Mo and emphasized “the number one genius” to express his sarcasm.", "“Haha, the loser is here!”", "“The loser will be dead in a few days!”", "“…”", "Many disciples looked at Su Mo scornfully.", "Although he had recently made his name for defeating Su Heng and destroying Wei Lin, the second son of the Wei clan, everyone thought that his glory would end soon.", "He was doomed to be a loser for the rest of his life due to his Rank 1 Human Class Martial Soul.", "Su Mo glanced at them coldly and kept walking with no regard for them.", "“Stop!”", "Su Yu’s eyes grew cold, and he stepped out of the crowd and stood in Su Mo’s face.", "“How dare a loser ignore me!”", "This enraged him greatly.", "“Su Mo, let’s have a training battle. I won’t fight back until after 100 moves.”", "Su Yu sneered.", "“No fighting back until after 100 moves?”", "“That is a blatant insult to Su Mo!”", "“I’m not interested!” Su Mo indifferently replied.", "“Not interested? Hmph! In two weeks, you won’t get to fight me even if you want to!”", "Su Yu scoffed, “You must be really ignorant or cocky to fight Wei Liang to the death, so you’d better enjoy your last few days.”", "Su Yu sneered in his heart and thought,“You’re asking to die by choosing to fight against Wei Liang.”", "“My fights are none of your business.”", "“Haha, of course your survival has nothing to do with me.”", "Su Yu slightly smiled and said, “Actually, since we awakened our Martial Souls, you don’t deserve my attention at all.”", "“You’re no match for me in terms of honors, status, or women!”", "Su Yu was very happy with his present situation. He had a Rank 5 Human Class Martial Soul and was the first genius of his clan. Furthermore, both his cultivation and clan status had rapidly improved.", "Su Mo was nothing to him.", "He felt refreshed upon mocking Su Mo, as if he were floating in heaven.", "“Is that so?”", "Su Mo arched his brow and sneered back, “Honestly, I’ve never wanted to compete with you because you’re just a laughable scoundrel who doesn’t deserve my attention.”", "“You…!”", "Su Yu was furious, and his face turned livid.", "“Hmph! You only have a few more days to gloat! In two weeks, I’ll be there and witness your death.”", "Su Yu held back his anger upon thinking that Su Mo would die soon.", "Su Mo gave him a disdainful smirk and left without saying anything.", "“Am I going to die?”", "“We’ll see who dies!”"]}, "Chapter 15": {"Name": "Bloody Blade Stockade", "Translator": "Transn", "Editor": "Transn", "Story": ["On a shady path 80 kilometers away from Sunnywood City, with the long sword on his back, Su Mo used his body movement to rush toward Breezewind Mountain", "Breezewind Mountain was over 100 kilometers away from Sunnywood City, but with his speed, he could reach it within one hour.", "“Hmm? It smells really strongly of blood!”", "On his way to the mountain, Su Mo keenly smelled blood in the air.", "“What happened?”", "“Where from?”", "He stopped, and after some pondering, he decided to follow the smell.", "After a while, he came across a small village with about 100 households.", "However, the whole village was in ruins. Most of the houses had collapsed, and corpses scattered on the ground.", "Scarlet blood dyed the ground and converged into streams, making the place look like hell itself.", "That was where the thick smell of blood was coming from.", "“What is this?”", "Su Mo was quite appalled at this sight, even though he thought he had seen everything.", "“Who could be so vicious to slaughter an entire village?”", "He was extremely incensed, and his eyes grew cold.", "After taking a deep breath, he rushed into the village.", "The whole village was dead silent, but the strewn corpses, broken limbs, and scarlet blood were everywhere. It was appalling.", "Many of the corpses were dead women, children, and old people. He saw a three or four-year-old little girl lying in a pool of her own blood, with a knife stabbed through her body.", "All of these things made him very angry, and his face darkened.", "“Who is so inhumane that he can commit such a formidable crime?”", "“Ah! Ah!”", "Suddenly, he heard a faint groaning sound.", "Su Mo hastily ran toward the sound, and he soon arrived at a collapsed ruin and found an old, gray-haired man.", "The old man was covered in blood with half of his body crushed under the ruin. He was heavily wounded, but still alive.", "“Sir, are you alright?”", "Su Mo hurriedly walked forward, removed the ruins, and helped the old man up.", "He realized that the old man’s stomach had been cut open, and his guts were flowing out. There was no chance he could survive.", "“What I’ve done to you, my Lord! It’s unfair! Ooh, ooh…!” The old man was in a daze and burst into tears.", "“Sir, what happened?” Su Mo asked him.", "The old man stopped crying and regained consciousness gradually.", "“Please save my granddaughter! Please! Please!” implored the old man as he looked at Su Mo and abruptly grabbed his hands.", "“Sir, don’t worry! Just tell me what happened,” Su Mo asked.", "“The Bloody Blade Stockade looted our village and slaughtered all of us.”", "The old man was in grief, yet his eyes were filled with resentment.", "“The Bloody Blade Stockade?”", "Su Mo’s eyes narrowed, for he had heard of the Bloody Blade Stockade.", "It was said that the Bloody Blade Stockade was a bunch of bandits stationed 100 kilometers from Sunnywood City who often committed cruel crimes like this.", "They were evil in every way, but they were very smart to not attack powerful groups and only targeted the weak.", "Therefore, the Bloody Blade Stockade had always gotten their way for years instead of being uprooted.", "“How many were there? What’s their strength?”", "Su Mo’s eyes were cold, and he felt a raging desire to kill them.", "“It was a small team with about 20 people, but they all were powerful martial artists above Lv 3 Qi Cultivation Realm.”", "The old man had lost too much blood, and his voice trailed off. “Our village had only five martial artists of the Qi Cultivation Realm, and none of them could rival them, so they were all killed in a short time!”", "“Young man, please save my granddaughter. She was abducted, and as long as you can save her, I’ll be your servant in my next life.”", "He pleaded to Su Mo, without considering if Su Mo would be able to defeat those bandits.", "Judging from Su Mo’s expensive clothes, the old man could tell that he was an inferior of some big clan, so he would certainly save his granddaughter.", "“Sir, don’t worry! You got it.”", "Su Mo nodded seriously.", "He was experiencing a mix of emotions. He knew that the laws of nature dictated that the strong would always be to prey upon the weak.", "“Well! Well! Thank you…!”", "The old man gave him a faint smile, then his head tilted, and he died.", "“The Bloody Blade Stockade, huh?”", "Su Mo stood up with his fists clenched, and his eyebrows furrowed with killing desire. “You dirtbags don’t deserve to live.”", "Then, he dashed off and followed the horse tracks out of the village.", "The village had just been robbed, so the bandits should still have been nearby.", "He was going to kill all of those animals.", "…", "“Giddy up! Giddy up!”", "The Bloody Blade Stockade bandits spurred their war horses along a mountainous path.", "They were slowed down by the 20 to 30 ladies they had captured.", "Some of these ladies were 30 or 40 years old, and some were only 12 or 13 years old. No matter if they were married women or maidens, they were all very pretty.", "“Brothers, let’s take a rest here and continue after a meal,” ordered the tall leader of the bandits.", "Soon, the bandits stopped to rest. They lit a bonfire and roasted some game.", "Then, they gathered all the ladies together.", "“Haha! I didn’t expect so many pretty women this time. I can’t wait any longer!”", "A bandit smiled disgustingly and lewdly looked at those ladies.", "“Haha! I haven’t touched a woman for over a month, so let’s really enjoy ourselves this time!”", "Another scar-faced bandit laughed, fixed his eyes on a maiden in green, and said creepily, “This girl is beautiful! Damn! I’ve never seen such a pretty girl in my life.”", "A 15-year-old maiden in green stood out among the ladies with her outstanding looks, which attracted the bandits’ attention.", "The simple clothes on her could not disguise her elegance.", "“Humph! If you want to save your little ass, you’d better leave her alone. I’m about to give her to the chief!” The leader scolded coldly.", "“Haha! Since she’s a give for the chief, I won’t touch her.”", "The scar-faced bandit shivered at the thought of the chief’s cruelty and gave the leader a big smile.", "Thud! Thud! Thud!", "“Hmm?”", "Right at that moment, one of the ladies started to run away while the bandits were not paying attention and made it dozens of meters away in the blink of an eye.", "“Haha! Leader, leave her to me!”", "The scar-faced bandit laughed coldly and chased her in excitement, catching her in no time.", "“Haha! Little cunt, trying to run under my watch? I’ll teach you a lesson right now!”", "He chuckled vilely and dragged her into a grassy field.", "“Ah!”", "Not long after he disappeared, a loud scream emerged from the grass."]}, "Chapter 16": {"Name": "Su Mo’s Strength", "Translator": "Transn", "Editor": "Transn", "Story": ["“Haha! Has the third son of Ma become impotent? Did he finish as soon as he went in?”", "“Haha! What a loser. Let’s see if he still has the guts to brag in front of us.”", "The bandits could not help but mock him when they heard the screams coming from the bushes.", "However, their expressions soon changed.", "After a long time, the scar-faced bandit still had not emerged.", "The bushes were completely silent.", "“What happened? Why hasn’t he come out yet?”", "All the bandits were confused.", "“Ma the Third…”", "The bandits began yelling his nickname, but there was no reply from the bushes.", "“You two, go take a look,” ordered the leader of the bandits to two men next to him.", "The two looked at each other and walked into the bushes.", "However, they did not make a single sound after entering the bushes, as if they had completely disappeared, just like the scar-faced bandit.", "All the bandits finally could not sit still any longer and stood up with grave expressions.", "“Damn it, what happened?”", "“Fu*k! What the hell!”", "“Humph! I want to know who has the guts to mess with the Bloody Blade Stockade!”", "The leader of the bandits yelled with a grave expression, “You two, stay here to watch over these women. The rest come check it out with me!”", "Clang! Clang! Clang!", "They unsheathed their steel sabers and approached the bushes in a fan shape.", "“Huff… Huff…”", "Many of them were panting and alert, prepared for any potential danger.", "Soon after they stepped into the bushes, they saw three mangled corpses in the grass.", "It was the scar-faced bandit and the two bandits who had come to check on him.", "The three bodies did not even look like human anymore. They were completely emaciated and drained of their blood and Qi, as if they had been mummified.", "If not for their clothes, the bandits would not be able to tell that the corpses were their companions.", "“Hiss!”", "“Hiss! Hiss!”", "Although these bandits were cruel murderers who were numb to death, they all hissed in shock.", "“Is this…. the work of a vampire?” one of the bandits asked.", "However, there was no one in sight.", "“No, they were killed by a human. Look at their necks.”", "An astute bandit noticed that there was a thin slice on each of the three corpses’ necks.", "Killed in one sword stroke!", "This was the same for all three men.", "“Ah! Ah…!”", "Suddenly, something strange happened again.", "Two screams came from behind them.", "The terrified screams of the women followed.", "“Damn it…!”", "All the bandits retreated in shock.", "The bandits saw that the two men they had left behind were lying on the ground.", "Next to the two men stood a young man. He was around 15 years old, held a bloody sword, and was looking at them coldly.", "When the women saw this man run out and swiftly kill two people, they began screaming in terror.", "“Don’t be afraid. I won’t hurt you!” said the young man to the women.", "That young man was Su Mo.", "He had followed the scar-faced bandit and saw him trying to do unspeakable things to a woman, so he entered the bushes, killed the scar-faced bandit, and saved the young woman.", "Then, he killed the other two bandits.", "Afterwards, he also devoured all of their blood and Qi.", "All three bandits were at Lv 3 Qi Cultivation Realm, and after Su Mo devoured their blood and Qi, he immediately reached the Peak Lv 3 Qi Cultivation Realm.", "Then, when the bandits came to inspect the situation, he circled back around and killed the two guards.", "Thus, Su Mo effortlessly killed five men in a row.", "“Who are you? How dare you challenge the Bloody Blade Stockade?” asked the leader, who sized up Su Mo coldly.", "“I’m the one to kill all of you!”", "Su Mo’s eyes were cold, and he exuded a fierce murderous aura.", "“Humph! Peak of Lv 3 Qi Cultivation Realm, and you want to kill us all?”", "The bandit leader sensed Su Mo’s cultivation and chuckled. He waved at his subordinates, and they immediately surrounded Su Mo.", "The leader was at Lv 5 Qi Cultivation Realm and very powerful. Three or four of his men were at Lv 4, and the others were at Lv 3.", "With all their strength, he naturally was not afraid of a scrawny Lv 3 kid.", "However, he still did not let his guard down, since this kid had somehow mummified all the bodies that he killed.", "Also, this kid must be considerably powerful since he had managed to kill all those men without a sound.", "“You’ll see.”", "Su Mo grinned. The benefits from devouring all the blood Qi had begun to boil his blood.", "“Kill him!”", "The bandit leader ordered his men with a wave, while he stood still and watch.", "“Kill!”", "“Kill! Kill!”", "Four bandits roared, and rushed toward Su Mo and cut with their glinting steel sabers at him.", "The bandit leader chuckled. He believed that this attack would instantly kill the kid.", "All four attacking bandits were at Lv 3 Qi Cultivation Realm. Together, they would overpower even a Lv 4 martial artist.", "Su Mo scoffed at their attack and said, “Go to hell!”", "“Whoosh!”", "Su Mo used Shadow Steps to dodge their attack.", "“Whoosh!”", "A dazzling sword radiance appeared, and Sword Qi shot out everywhere.", "“Ah! Ah…!”", "With a series of cries, all four bandits immediately collapsed and died.", "Killed with one stroke!", "“What…”", "All the other bandits stared in disbelief.", "They could not understand how this kid at Lv 3 Qi cultivation could be so powerful.", "“Kill! Everyone! There’s no way a low-level kid can kill us all!”", "The bandit leader roared with a livid face and led the rush forward.", "He carried a giant billhook, which he forcefully brought down upon Su Mo.", "This billhook weighed at least 100 kg. Combined with the leader’s cultivation of Level Five, one hack was enough to split even metal into two.", "Whoosh!", "Su Mo did not dodge his attack but instead met it with his sword.", "Gale Blade!", "Su Mo channeled all of his genuine Qi and his physical strength to carry out the first move of Divine Wind Swordplay, Gale Blade.", "Clang!", "The billhook and sword violently crashed into each other and gave off a thunderous noise.", "Su Mo’s entire body shook, and he and the bandit leader both staggered back three steps.", "Both men were equal in this attack!", "Although the bandit leader was at Lv 5 Qi Cultivation Realm, which was two whole realms higher than Su Mo’s, his cultivation skill and martial arts techniques were only Medium Lv 1.", "Su Mo was only at Lv 3 Qi Cultivation Realm, but his Primordial Original Qi was incredibly strong and made his true ability equal that of Lv 4.", "Also considering his physical strength, he could easily contend with Lv 4 martial artists.", "He also had cultivated a Lower Lv 3 Martial Skill, the Divine Wind Swordplay.", "If he had begun cultivating this skill earlier, he would have been able to defeat the bandit leader with that stroke.", "“How is this possible?” the bandit leader roared in shock.", "“How can you be so powerful at only Peak Lv 3 Qi Cultivation Realm?”"]}, "Chapter 17": {"Name": "Kill Them All", "Translator": "Transn", "Editor": "Transn", "Story": ["The bandit leader was incredibly shocked by Su Mo’s abilities.", "He was fully aware of his own strength, and common Lv 5 Qi Cultivation Realm martial artists were no match for him.", "How could he not be shocked that he was forced back by a Lv 3 martial artist?", "“Ahhh!”", "While the bandit leader was lost in confusion, two more screams tore through the air.", "Su Mo’s sword was as fast as lightning and as nimble as wind, so his sword Qi was unstoppable.", "Three more bandits were instantly killed.", "This small group of bandits used to have 20 men. However, Su Mo killed nine men before, and he just killed three more, so now there were only eight left.", "“Die!” Su Moyelled, his body as swift as a flash. With a glint of his sword, two more bandits were slashed in the waist and collapsed to the ground, spilling their guts everywhere.", "“Hurry! Surround and kill him! Hurry!” screamed the bandit leader.", "He raised his giant war saber and charged toward Su Mo.", "This time, Su Mo did not directly block his attack. He used his swiftness to weave between the men, and with every flash of his sword, he struck down a bandit.", "“Screw you!” roared the bandit leader angrily. No matter how hard he swung his war saber, he had never touched a hair on Su Mo’s body.", "After Su Mo practiced the Lower Lv 3 body move,Shadow Steps, his dexterity had been greatly increased. Although he had only begun to cultivateShadow Steps, his movement was way beyond the bandit leader’s capabilities.", "Besides their leader, the other bandits were all at Lv 3 or Lv 4 Qi Cultivation Realm, so very few stood a chance against Su Mo’s sword.", "Even if they blocked one strike, they could not block another.", "With Sword Qi spreading everywhere and sword radiance shining, Su Mo killed one man with every step he took.", "Soon, the bandit leader had become a commander without soldiers.", "Even the men who tried to run were killed by a single strike before they could get away.", "“You’ve killed so many men of my Bloody Blade Stockade! I won’t let you get away with it!”", "The bandit leader issued this threat but turned around to run away. He could tell that he was at a disadvantage.", "There was no way that he could kill his opponent!", "“You’re going nowhere!”", "Su Mo blocked the bandit leader’s path.", "“Don’t push me! Even though I can’t kill you, you also can’t kill me!” The bandit leader yelled.", "“Really? I’ve told you that you will all die today!”", "Su Mo sneered condescendingly, which immediately enraged the bandit leader.", "“You must be looking for death! I’ll show you just how powerful I am.”", "The bandit leader roared, and his Martial Soul rose up behind him, bathed in yellow light.", "His Martial Soul was a three-meter-tall Fierce Bear.", "After activating his Martial Soul, the bandit leader’s abilities at least multiplied. He drew out his shining war saber and swung it forcefully towards Su Mo.", "Su Mo did not dodge it and stood silently in place.", "The bandit leader was overjoyed to see this, and he channeled all his force into his swing to incapacitate Su Mo with one strike.", "Su Mo smiled coldly. When the bandit leader’s war saber was about to come down, he sheathed his sword.", "This action instantly shocked the bandit leader.", "“Is this boy dumb?”", "However, he was even more excited. Now that his enemy had sheathed his weapon, this was his chance to kill him.", "Just as the bandit leader’s war saber was about to reach Su Mo, a shining long sword appeared in Su Mo’s hand with a flash.", "This was the Spirit-slayer Sword, a Medium Lv 4 weapon.", "Su Mo grasped the Spirit-slayer Sword and swung it up to meet the war saber.", "Clang! Splash!", "When the weapons met, the bandit leader’s war saber was shattered. The Spirit-slayer Sword did not lose any momentum and cut through the bandit leader’s neck like lightning, causing his head to fly up and spew blood everywhere.", "Huff!", "Su Mo let out a sigh after killing all of the bandits.", "“Spirit-slayer Sword, you didn’t let me down!”", "Su Mo looked at the longsword in his hands and smiled. His Medium Lv 4 weapon was really exceptional.", "Weapons of different levels and grades varied greatly in quality, not to mention that the bandit leader’s weapon was a common Lv 1.", "Since the two weapons were not even at the same level, it was not surprising that his sword could slice through the war saber.", "When faced with these degenerates, Su Mo was not stupid enough to fight fairly.", "After killing all the bandits, Su Mo looked towards the kidnapped women, who were all shell-shocked and unresponsive.", "“Alright, all of the bandits have been killed! You’re all free!”", "Su Mo said, waking the women.", "“Thank you, kind sir!”", "All the women kneeled on the ground and bowed their heads to Su Mo in thanks.", "“You can all get up! It isn’t safe here. Go back to your village first!”", "Su Mo waved his hand and asked them to stand. Although their village had been destroyed, he could only ask them to go back.", "Luckily, most of the bandits had war horses that the women could ride back to the village.", "“Sir, I’ll never forget your kind deed today. Could you tell me your name? I’ll bear it in mind forever.”", "A young girl in green quietly said as she nervously walked up to Su Mo.", "She was the girl whom the scar-faced bandit had lusted after, and the one who was being taken as a gift to chief brigands.", "Her skin was as white as snow, her beauty unparalleled, and her eyes as clear as a spring. Although she was wearing rags, she exuded an undeniable elegance.", "The girl had the appearance of a fallen angel, making her desirable but incorruptable.", "Su Mo had only just realized this outstanding beauty among the women.", "“How could such a small village produce such a gem?”", "Judging purely by appearance, this girl surpassed even Luo Huan, the leader of Purple Gold Pavilion. However, she seemed shyer than the charismatic Luo Huan.", "“My name is Su Mo! Go back first, and I’ll come later and help you bury your relatives.”", "Su Mo smiled and led a war horse over to her.", "“Yes, sir.” The girl lightly nodded.", "After everyone had left, Su Mo stared at the pile of corpses with excitement glinting in his eyes.", "“With all these bloodessence, breaking through my cultivation shouldn’t be a problem!”", "Su Mo immediately walked over, sat down cross-legged, and released his Devouring Martial Spirit.", "The longer he waited, the more essence these bodies would lose. Moreover, their Martial Souls would disappear after a while, which would be a great loss!", "Su Mo used all his force to activate his Devouring Martial Spirit, which quickly sucked in all the bandits’ Martial Souls and Blood Qi.", "Most of these bandits’ Martial Souls were Rank 2 or 3 Human Class, so Su Mo’s Martial Soul was not affected after devouring them.", "However, the great amount of Blood Qi became a surge of pure energy after it was devoured and absorbed into Su Mo’s body.", "Su Mo suddenly experienced a spike in genuine Qi!", "Boom!", "In the blink of an eye, Su Mo’s cultivation broke through the bottleneck of Lv 3 and entered into Lv 4 Qi Cultivation Realm.", "The Blood Qi was so strong that Su Mo’s cultivation continued to rise after reaching Level Four.", "Early Lv 4 Qi Cultivation Realm!", "Middle Lv 4 Qi Cultivation Realm!", "Late Lv 4 Qi Cultivation Realm!", "Peak Lv 4 Qi Cultivation Realm!", "Finally, after Su Mo finished devouring everyone’s Blood Qi, his cultivation stopped at Peak Lv 4 Qi Cultivation Realm, which was only a step away from Lv 5.", "He was not disappointed and was instead satisfied that he had increased his cultivation by one level.", "“If I keep killing and taking other people’s Blood Qi and Martial Souls like this, won’t my cultivation skyrocket?” Su Mo thought excitedly.", "However, he shook his head.“If I continue this, even though my strength will improve quickly, I will also lose my humanity and become a bloodthirsty monster.”", "Su Mo had always been a moral person who had no sympathy for enemies and villains, but slaughtering the innocent was no different from those bandits.", "Then, he took a deep breath, stood up, took all of the mummies’ belongings and left."]}, "Chapter 18": {"Name": "Gu Lanxi, the Daughter of the Gus", "Translator": "Transn", "Editor": "Transn", "Story": ["The village that had been looted was called the Gu Clan village.", "Now, the whole village was in ruins and resounding with the sound of crying.", "When he came back, Su Mo saw dozens of men carrying dead bodies. There were big pits behind the village that had been dug to bury the bodies.", "After talking to the men, he found out that they were a hunting squad that had survived the slaughter because they were out hunting.", "“You saved so many of our women and killed all the bandits to avenge us. Thank you very much! Please accept my gratitude!”", "The leader of the hunting squad instantly bowed to him respectfully after learning that Su Mo had saved the women.", "“Brother, you’re welcome. Let’s first bury the deceased and help them rest in peace!”", "Su Mo said and waved his hand to the leader.", "“Alright!”", "The leader nodded silently and continued to carry the bodies.", "“Hmm?”", "Su Mo looked around and saw the gorgeous maiden from before kneeling down before a body and crying.", "The corpse belonged to the old, gray-haired man whom he had talked to.", "“She must be that old man’s granddaughter!”Su Mo instantly realized.", "Walking over and squatting down next to her, he lightly patted her shoulder and consoled her. “I’m so sorry for your loss!”", "However, the maiden continued sobbing, as if she had not heard him.", "“Alas…”", "Su Mo secretly sighed and thought,“Parting with the dead is the most painful thing in life!”", "“Master, I’m an orphan and was abandoned in the wilderness as a child. Grandpa found me and raised me.”", "The maiden slowly said in a bitter tone, “Grandpa treated me like his own granddaughter, always saving the best things for me and offering me a good life, but it’s all my fault that he’s dead.”", "“Why am I not a martial artist?”", "“If I’d been a powerful martial artist, I would’ve been able to protect grandpa and our village!”", "“If I’d been a powerful martial artist, grandpa and all the other villagers wouldn’t have died!”", "“…”", "She kept talking, and Su Mo could not tell if she was talking to him or just murmuring to herself.", "Her body shook continuously, and big teardrops rolled down her cheeks.", "Su Mo listened to her in silence.", "“Survival of the fittest means that the strong preys on the weak, so things never end well for the weak!”", "After a long time, she stopped crying.", "“You must toughen up if you don’t want your grandpa to worry in heaven.” Su Mo could not do anything but comfort her.", "“I’m so sorry to let you see me like this!” she said bashfully, wiping the tears from her face.", "“It’s fine. Let’s first bury your grandpa and help him rest in peace,” said Su Mo. They then buried the old man behind the village.", "After that, Su Mo was about to leave.", "The villagers had buried all the deceased and came here to show their gratitude to him again.", "Su Mo returned all the belongings the bandits had stolen to the villagers and was ready to leave.", "“Young master!”", "Suddenly, a voice chirped behind him. Su Mo turned around and saw the maiden in green.", "“I… I want to follow you. Would you be willing to take me in?”", "She slowly walked toward Su Mo and was tightly gritting her teeth, as if she had made up her mind.", "She stared at Su Mo with her bright, beautiful eyes, as if she was afraid of being rejected by him.", "Su Mo was startled and did not know why she would want such a thing.", "“Why do you want to follow me?”", "He, of course, did not mind having such a beautiful girl around.", "However, he still had to understand her intentions. After all, he could not foolishly take her home simply due to her attractiveness.", "“I want to learn to practice martial arts with you.”", "Her tender face was full of resolve, and she said, “I think you’re a good person. Only by following you can I be a powerful martial artist.”", "“You can rest assured that I won’t be a burden to you, since I can cook, wash clothes, and do chores. I’m even willing to be your servant, so please take me in!”", "She looked very pitiful, and her eyes widened anticipation. After she spoke, she started to kneel.", "Su Mo hurriedly pulled her up and said, “Since you’re willing to follow me, come, and I’ll teach you cultivation.”", "“Of course, if you want to leave in the future, I won’t stop you.”", "Su Mo sighed in his heart.“The maiden may have seemed weak, but she was strong-willed and resolute.”", "“Thank you, Young Master!”", "She gave him a rare and charming smile, which stopped his heart.", "Then, Su Mo took the maiden back to Sunnywood City.", "They did not ride horses and instead walked back.", "She had not awakened her Martial Soul to be a real martial artist, but she had reached Lv 6 Body Tempering. Thus, she could easily walk dozens of kilometers.", "On the way, Su Mo chatted a lot with her and got a general understanding of who she was.", "She was called Gu Lanxi, a very beautiful name.", "She was 14 years old this year and 15 in two months, so she was almost the same age as him.", "At dusk, they reached the Su clan.", "“Holy crap! Where did Su Mo find such an appealing girl?”", "“The piece of trash probably knows that he’ll die soon, so he wants to enjoy his last two weeks.”", "“You may be right! Damn it, why all beauties are wasted on losers!”", "When Su Mo brought Gu Lanxi into the mansion of the Sus, many people were instantly drawn to her looks.", "Many disciples spoke sourly out of admiration, jealousy, and in most cases, contempt.", "Su Mo led her into his yard and arranged a room for her.", "His yard had four rooms. One was for himself, and the other three were empty.", "“Xi’er, this is where you’ll stay.”", "Su Mo helped her clean up the room and gave her some daily essentials. “If you need anything later, just let me know.”", "“Thanks a lot!” She lightly nodded.", "“As for cultivating, I’ll buy you some elixirs to help you accomplish your Body Tempering as soon as possible.”", "He added, “When you finish your Body Tempering, I’ll find a way to help you awaken your Martial Soul.”", "“Alright. Sorry to bother you!”", "The maiden felt somehow touched and greatly respected him.", "“Haha! Xi’er, you don’t need to be so polite. I’m very casual.”", "Su Mo lightly smiled and said, “Don’t call me ‘young master’ anymore, it sounds very awkward. You can just call me by my name.”", "“I… I can’t do that!”", "She hastily waved her hands and anxiously said, “You did me a great favor, so how can I directly call you by your name? That is quite disrespectful. Besides, I’m only your maid, and I wouldn’t dare to call you that.”", "Er!", "Su Mo was instantly speechless and thought,“She’s too uptight!”", "“Who says you’re my maid? From now on, you’re my little sister,” Su Mo said seriously.", "Hearing this, she suddenly widened her bright eyes and stared at him intently.", "“So you don’t want to be my little sister?” Su Mo deliberately pretended to be angry and asked her.", "“No… No, I want to!”", "Her face was blushing, and his words touched her heart.", "“Haha! Come on, call me brother,” Su Mo smiled and said teasingly.", "“Er… Brother Su Mo!” she said very quietly with her head down, her face blushing with shame.", "“Haha…” Su Mo burst into laughter."]}, "Chapter 19": {"Name": "Visiting Luo Huan Again", "Translator": "Transn", "Editor": "Transn", "Story": ["In the breezy yard.", "Su Mo was practicing his swordplay.", "His sword was very nimble and moved like the wind. Its sword momentum was sometimes like a light breeze, and sometimes a wild gale.", "At that moment, Su Mo’s heart was completely calm, and he had a clear grasp onDivine Wind Swordplay. His entire body was one with the air, and in his mind appeared the paths, the speed, and the changes of the wind.", "He continually thrust his sword, practicing the moves ofDivine Wind Swordplayagain and again, faster and faster.", "“Gale Blade!”", "His long sword danced with its radiance that broke through the air, giving off a piercing sound.", "“Swirling Winds and Clouds!”", "The wind was integrated with the sword so that as the sword moved, the wind followed.", "“Wind Roaring in the Sky!”", "A strong gale arose, and the sword momentum then combined with the wind, sending the sword shadow everywhere.", "“Final Hit of Heavenly Wind!”", "The wind stopped, and the sword shadows disappeared, and a loud whistling sound arose. A beam of sword radiance shot out swiftly from the sky at a lightning speed.", "The beam shot through the hard stone wall with a crack, sending rock fragments everywhere and leaving behind a half-meter-long mark.", "Huff!", "Su Mo sheathed his sword and stood up.", "“If I keep cultivating the four moves of Divine Wind Swordplay at this speed, I’ll reach its Minor Completion in no time!”Su Mo thought happily.", "Although he had not yet reached the Minor Completion ofDivine Wind Swordplay, he was very close. His attack was more than twice as strong as when he first started.", "“This is how powerful Lv 3 martial arts techniques really are!”Su Mo exclaimed inwardly.", "Su Mo had not left the city for five to six days and spent most of his time cultivating martial arts techniques.", "Besides making great progress in Divine Wind Swordplay, he was also steadily improving his Shadow Steps, which was also close to the Minor Completion.", "As for his cultivation, Su Mo was still at Peak Lv 4 Qi Cultivation Realm. His realm still needed some time to stabilize after increasingly so rapidly last time, so it would be hard for him to make another breakthrough for a while unless he devoured a large amount of Qi blood again.", "Although his cultivation had not increased, his physical strength had greatly improved. He now had a Rank 5 Human Class Martial Soul, which could devour aura from heaven and earth for his physical cultivation 10 times faster than before.", "He was almost done with Stage 2 Elephants Strength Skill. His physical strength was equivalent to 1250 kilograms, or the strength of five tigers, and he could contend with an Lv 5 Qi Cultivation Realm martial artist.", "“Brother Su Mo, you should rest for a while!”", "A girl in white walked out of her room, holding a cup of steaming tea, and handed it to Su Mo.", "“Haha! Xi’er, are you comfortable here?” Su Mo asked with a smile.", "Gu Lanxi’s white robe elegantly floated around her body, making her look like an angel.", "As the saying goes, clothes make the man. Su Mo had only bought her two pieces of regular clothes, but they made Gu Lanxi even more stunning.", "Even Su Mo could not help but feel tempted by such a timeless beauty.", "“Yes, Brother Su Mo. I’m very happy here.” The young girl smiled charismatically.", "“Haha! Xi’er, you’ve been here for so long, but I haven’t shown you around yet. I’ll take you on a walk outside,” said Su Mo with a smile, “and we’ll buy some cultivating resources on the way.”", "“Yes!” The girl lightly nodded.", "Su Mo and Gu Lanxi walked out of the Sus.", "Su Mo originally wanted to find his father, but since Su Mo had given him the 100 Spiritual Stones, Su Hong had been in seclusion. It seemed that he was breaking through the cultivation bottleneck, so Su Mo did not want to disturb him.", "Su Mo went to Purple Gold Pavilion again with Xi’er.", "When they walked into the lobby, a young maid walked over and said, “Hello, how can I help you?”", "“I want to see your pavilion leader, Luo Huan!” said Su Mo bluntly with a smile.", "“What?” The young maid looked at him in shock and thought,“What kind of person do you think you are to directly ask for our leader?”", "“Master, our leader is very busy. If you need to buy elixirs, weapons, or other goods, I can help you with that.” The young maid refused politely.", "She had encountered many men who had demanded to see the leader.", "Her beauty had charmed countless people, so many men came by only to see her for themselves.", "She glanced at Xi and thought,“This young man is such a player! Isn’t he satisfied with his beautiful companion?”", "“Oh, really? Can you handle exchanges involving over 500kg of gold?” asked Su Mo with a smile.", "“Ah! 5… 500kg of gold?”", "The young maid was instantly shocked and hastily said, “Please wait a minute, Master. I’ll go get the leader immediately.” She then hurried off.", "The young maid did not suspect Su Mo. Purple Gold Pavilion was very reputable in Sunnywood City, and no one would dare to cause trouble there.", "Soon, she swiftly returned and said to Su Mo, “Master, our leader is waiting for you!”", "Once again in the side hall, Su Mo saw Luo Huan, the leader of Purple Gold Pavilion.", "Luo Huan sat in the main seat of the side hall, wearing the same tight leather dress. Her body was voluptuous, and her eyes were full of charm and temptation.", "From afar, Su Mo could smell a faint and seductive fragrance.", "No man she seduced would be able to resist her.", "“After such a long time, Leader Luo is still beautiful as always,” said Su Mo with a calm face, not revealing a hint of his infatuation.", "“Haha! Young Master Su is joking. How can I compare to the beauty next to you!” said Luo Huan.", "She looked at Xi’er and could not help but feel amazed.", "She had a powerful background and had traveled far beyond Sunnywood City. However, she had never seen such a pure beauty.", "Hearing Luo Huan’s praise, Xi’er instantly became bright red and lowered her head shyly.", "“Leader Luo, what price does this pavilion offer for Spiritual Stones?” asked Su Mo, cutting to the chase.", "“Does Young Master Su have Spiritual Stones?” Luo Huan arched her brows and asked with surprise, “How many do you have, and of what quality are they?”", "Su Mo opened his hand to reveal a milk-white crystal and said, “It’s this type of Spiritual Stone, but I only have few.”", "Su Mo planned on only selling a couple of such stones. Even though Purple Gold Pavilion had an impeccable reputation, it was too risky to reveal all the expensive stones at once.", "Besides, five Spiritual Stones were already worth an enormous amount of wealth.", "“This is a Spiritual Stone of Lower Grade. I can offer you 130kg of gold for one stone,” said Luo Huan, who looked at it and quietly gasped.", "“Alright, I have five Spiritual Stones, so that equals 650kg of gold.”", "Su Mo took out four more stones and gave them to her.", "“Young Master Su, do you need to purchase anything else?” asked Luo Huan, accepting the Spiritual Stones with a smile.", "Su Mo saw her smile and felt as if he had been ripped off.", "“I want Beast Souls. How much is a Class 9 Lv 1 Beast Soul?” asked Su Mo.", "Now, low-level Beast Souls did very little to increase his Martial Soul, so he wanted to buy Class 9 Lv 1 Beast Souls.", "“20 kg of gold.”", "“Please give me 30!”", "Su Mo currently had so much money that he did not care about 500kg of gold.", "“Also, I want 20 Body Tempering Elixirs.”", "Those were for Xi’er so that she could quickly complete her Body Tempering.", "Body Tempering Elixirs could fortify her body constitutions and increase her physical strength.", "However, these elixirs could only be taken once every two weeks, and taking more had no additional effect.", "Luo Huan gave the order, and soon Su Mo had 30 Class 9 Lv 1 Beast Souls and 20 Body Tempering Elixirs.", "“By the way, Leader Luo, I also have some Demonic Cores that I can sell to you!”", "Su Mo took out from his storage ring some Demonic Cores that he had captured in Breezewind Mountains.", "“Alright, 30 Beast Souls is 600kg of gold, and 20 Body Tempering Elixirs is 50kg. That’s 650kg in total, so you still have 100 kg left.”", "“These Demonic Cores are worth 25kg, so I’ll give you 125kg of gold.”", "Su Mo took the gold ticket for 125kg and said, “Leader Luo, since I’ve bought everything that I needed, farewell!”", "“Haha! Goodbye, Young Master Su!” said Luo Huan with a charming smile.", "After he left, Luo Huan fell into deep contemplation.", "“So many Beast Souls. What is he hiding?”", "“If it weren’t for his low-level Martial Soul, I would recommend him to the island.”"]}, "Chapter 20": {"Name": "The Son of the City Governor", "Translator": "Transn", "Editor": "Transn", "Story": ["“Xi’er, are you hungry?” asked Su Mo as they walked along the streets of Sunnywood City. “Let’s go enjoy the delicacies at Rongxuan Pavilion. Many of their specialties contain demonic beasts’ meat, which will greatly help your cultivation!”", "“Okay! It’s all up to you, Brother Su Mo!”", "Xi’er nodded and felt greatly moved by Su Mo’s kindness. Over the past few days, she had gotten to know his character.", "He was gentle, easygoing, generous, and sincere.", "She was overjoyed that she had made the right decision to follow him.", "Rongxuan Restaurant was the best one in Sunnywood City.", "The interior decoration of the five-story building was extremely luxurious. This bustling restaurant was where many wealthy martial artists ate and entertained guests.", "Su Mo walked up to the door, holding Gu Lanxi’s hand.", "“Brother Su Mo, it must be expensive to eat here!”", "Xi’er could not help but comment at the sight of this luxurious restaurant. Born into a poor family, she naturally felt a little timid about such an upscale place.", "“Haha! Xi’er, we’re tycoons now. Money isn’t a thing!” said Su Mo with a smile.", "The girl grew silent as she remembered witnessing Su Mo spend more than 500kg of gold in the blink of an eye.", "They immediately caught many people’s attention as soon as they entered, but most of the attention was focused on the girl.", "Their eyes were full of infatuation.", "They were jealous of Su Mo and thought,“How did the loser young master of the Sus manage to win such a beauty?”", "“Su Mo, over here!”", "Suddenly, a voice called to him from the lobby of the restaurant.", "“Hmm?”", "Su Mo turned around and found that Su Heng had actually called to him.", "Su Heng and another teenager were sitting near the window.", "The handsome young man was donned in fine clothes and was gazing at them intently.", "To be exact, he was gazing at Xi’er.", "Su Mo frowned at them. He knew that the young man in fine clothes was the son of the Sunnywood City Governor—Lin Xiao.", "“Why are they eating together?”", "However, since Su Heng buried the hatchet and invited him, Su Mo would not put on airs, either.", "Su Mo walked over while holding her hand.", "Seeing them hold hands, Lin Xiao’s eyes glinted with an undetectable trace of bleakness.", "“Should we sit here?” asked Su Mo when standing in front of them.", "However, Su Heng did not respond to Su Mo, and Lin Xiao did not even glance at him.", "Lin Xiao stood up, smiled gently at Xi’er, and said, “Hi, my name’s Lin Xiao, son of the city governor. Please have a seat!”", "Having glanced at him, Xi’er turned to look at Su Mo.", "If Su Mo did not answer, she would not accept anyone else’s invitation.", "Su Mo sneered at Lin Xiao’s hidden intention, but he still said, “Xi’er, let’s sit here!”", "He then pulled a chair over to sit down.", "“You don’t deserve to sit here, you loser.”", "Lin Xiao suddenly barked at Su Mo with a darkened expression.", "“What do you mean?” Su Mo squinted and asked coldly.", "“Didn’t I make myself clear? You, a piece of trash with a Rank 1 Human Class Martial Soul, don’t deserve to sit with me!”", "Lin Xiao glared at Su Mo, thinking,“This guy really has no self-awareness!”", "Subsequently, he smiled gently at Xi’er and said, “Please do me the honor of sitting with me and drinking the most delicious wine in Rongxuan Pavilion.”", "With a sincere expression, Lin Xiao invited Xi’er once again.", "Her’s eyes revealed a hint of disgust, and she refused to sit down. She became annoyed by their humiliation of Su Mo.", "“You two are jerking me around?” Su Mo asked indifferently without becoming enraged.", "“Yes, we are! So what?”", "With his face full of disdain, Su Heng proudly said, “Su Mo, if you know what’s good for you, you’d better give this beauty to the son of the city governor, or you’ll be in deep water.”", "“Su Heng, as a disciple of the Sus, how dare you to kiss up to him?”", "Su Mo smiled mockingly and said, “Was my last lesson to you not enough? Are you itching for another beating?”", "“You…!”", "Su Heng was furious. It took him two entire weeks to fully recover from the injuries Su Mo inflicted.", "Su Mo’s words had uncovered this bad memory. If he were not wary of Su Mo’s strength, he would have struck him at once.", "“Su Mo, right? I won’t say it again. She stays, but you get out!” Lin Xiao stopped smiling and ruthlessly snapped.", "“Get out?”", "Su Mo raised his eyebrows, coldly smiled, and gently flicked his extended hand.", "Crack!", "A crisp and loud slap echoed in the restaurant.", "Suddenly, a clear palm print appeared on Lin Xiao’s face.", "The scene silenced the crowd around and shocked them. They obviously had not expected that the useless young master of the Sus would actually slap the son of the city governor on his cheek!", "“This guy is done for. Even if he isn’t killed, he’ll at least lose a layer of skin!”", "Everyone was watching the incident with great interest and taking guesses at what would happen.", "No one was happier than Su Heng who could now watch Su Mo be taught a lesson by the son of the city governor.", "“Haha!Su Mo, you’re exceptionally stupid!”", "“The son of the city governor is at Lv 5 Qi cultivation Realm, and you should never provoke him. You’ll meet a miserable end today!”", "Su Heng wildly laughed in his mind.", "The slap was even more unexpected for Lin Xiao, who was now frozen in shock.", "He soon snapped out of it. Feeling the stinging mark on his cheek, he scanned the eyes of all the people watching him.", "The raging and boiling anger in his mind was all-consuming.", "As the son of the city governor, he had been widely adored for all his life.", "No one in Sunnywood City dared to hit him. Even his father, the city governor, did not beat him at all.", "However, he had been slapped by a loser in public.", "“You… slapped me?”", "His deep voice sounded like a beast’s roar in the back of his throat, and his eyes flashed like those of poisonous snakes.", "“Are you a retard or a stupid fu*ker? Don’t you know whether you’ve been slapped?”", "Su Mo acted in a nonchalant fashion as if he had done nothing.", "Everyone fell silent and looked at Su Mo with sympathy.", "“Is he a fool?”", "“His Martial Soul is trash, and so is his mind!”"]}, "Chapter 21": {"Name": "Rank 6 Human Class", "Translator": "Transn", "Editor": "Transn", "Story": ["“I really don’t get it. Who gave a piece of trash like you, with a Rank 1 Human Class Martial Soul, the guts to strike me? Do you know what the consequences are?”", "Lin Xiao narrowed his eyes, but he did not immediately explode in anger.", "“I also don’t understand why you keep calling me a piece of trash. Where does your confidence come from? Is it simply because you’re the city governor’s son?” Su Mo smiled mockingly and continued. “In my eyes, your status is completely worthless!”", "“Go to hell!”", "Lin Xiao could not control his anger any longer. He swung his fist at Su Mo without hesitation.", "His fist hurtled towards Su Mo’s face with a great gust of aura.", "Many of the spectators even closed theireyes and resisted to watch what was about to happen.", "They knew that Su Mo’s face would be bloodied beyond recognition if Lin Xiao’s fist met its target.", "Su Heng was the only one who was grinning from ear to ear. He wanted nothing more than for this punch to kill Su Mo!", "However, Lin Xiao’s fist was unexpectedly stopped halfway.", "A palm was wrapped around Lin Xiao’s fist, directly blocking his punch.", "This palm firmly clenched Lin Xiao’s fist like an iron claw. He could not move an inch despite his best efforts.", "“How… How could this be?”", "Lin Xiao’s expression changed drastically.", "“What?”", "The spectators widened their eyes in shock.“How can it be? How can Su Mo block Lin Xiao’s punch so easily? Moreover, he is composed while Lin Xiao is bright red in the face.”", "“Is this the full extent of your power? You’re just a good-for-nothing, yet you’re still so arrogant! How ridiculous!” Su Mo scoffed.", "He applied slight pressure with his hand, producing a cracking sound.", "Ah!", "Lin Xiao screamed as the stinging pain in his fist caused him to twist his face in agony. Heavy drops of sweat dripped from his cheek.", "“How dare you?” Lin Xiao roared.", "“Why wouldn’t I dare? People who respect others are also respected, and people who insult others are also insulted. Beat it, you piece of trash!”", "Su Mo calmly flung his arm, sending Lin Xiao flying out of the window.", "The spectators were stood with their mouths agape, thinking“Su Mo is too insolent!”", "“Is he really a piece of trash with a Rank 1 Human Class Martial Soul?”", "“It seems like the rumors are false!”", "“Su Mo, you wait! I’ll make you pay for my humiliation 100 times over!” Lin Xiao screamed furiously from outside the restaurant.", "He knew that he was no match for Su Mo and did not want to stay any longer. Thus, he slunk away with his tail between his legs.", "After taking care of Lin Xiao, Su Mo directed his gaze at Su Heng.", "Su Heng shivered in fear of the chill emanating from Su Mo. He asked in a shaky voice, “Su Mo, what… what do you want?”", "“Scram!” Su Mo spat coldly.", "Su Heng froze, feeling his face pale with disgrace.", "However, he was too afraid to say anything else and hastily scurried out of the restaurant.", "After getting rid of the two men, Su Mo had also lost his interest in eating there.", "“Xi’er, let’s order a couple of dishes and have the restaurant deliver them home.”", "“Alright.”", "Su Mo called the waiter and ordered several dishes to be delivered to the Sus. He then left the restaurant with Xi’er.", "…", "Su Hong entered the yard just after Su Mo and Xi’er finished eating", "“Mo’er!”", "“Father, you’re finally out of seclusion!” Su Mo exclaimed.", "Su Hong said with a smile, “Yes, I am!”", "He then was instantly stunned when he saw a beautiful girl in the yard.", "“Xi’er, this is my father.” Su Mo introduced his father to Xi’er.", "“Greetings, Master.”", "She immediately got up and bowed to Su Hong.", "“Father, this is Xi’er.”", "After Su Mo made the introductions, he told his father about everything that had happened to her village.", "“Since Xi’er is willing to follow you, you must take good care of her in the future.”", "Su Hong gave Xi’er a careful once-over and secretly gave his approval. The hint of joy in his eyes spoke volumes.", "Noticing the mirth in his father’s eyes, Su Mo rubbed his nose speechlessly. It seemed that his father had gotten the wrong idea.", "“Father, have you made a breakthrough in your cultivation?” asked Su Mo, trying to change the subject.", "Though he could not sense his father’s cultivation, it was easy to guess the answer from his father’s happy demeanor.", "“That’s right! I have!”", "Su Hong nodded with a pleased smile. His cultivation had remained stagnant for many years, and a breakthrough made him feel satisfied.", "Su Mo was also happy for his father. Su Hong had already been an expert in Sunnywood City, but now with his improved cultivation, he had few opponents besides a couple of old men in long-term seclusion.", "The father and son chatted for a while. Su Hong then asked seriously, “Mo’er, you’ll be fighting Wei Liang in a few days. How confident are you in winning?”", "He was still worried. After all, Wei Liang was a genius of the Weis, and his strength should not be underestimated.", "“Don’t worry, Father! I won’t say I have complete confidence in winning, but 80 to 90% odds is fair,” said Su Mo with a smile.", "He was not bragging. Though he had only reached the Peak Lv 4 Qi cultivation Realm, his genuine Qi was equivalent to that of Lv 5. Paired with his human body that was equal to Lv 5, he was not much weaker than a master at the Lv 6.", "Moreover, after cultivating three types of Lv 3 techniques, he now had the ability to contend with a Lv 6 martial artist.", "Su Mo was also confident that he would be able to break through into the Lv 5 in the next few days.", "“Good. Though I don’t know where your assurance comes from, I’m relieved as long as you’re confident!”", "Su Hong nodded and said, “I still have things to attend to, so I’ll take my leave.”", "After his father left, Su Mo also prepared to continue his cultivation.", "“Xi’er, take these Body Tempering Elixirs. Try your best to reach the peak of the Body Tempering Realm by the end of this year, so you can awaken your Martial Soul next year.”", "Su Mo handed Xi’er all the Body Tempering Elixirs he had bought.", "“Don’t worry, Brother Su Mo. I definitely won’t let you down.”", "A hint of confidence appeared in Xi’er’s eyes. “When I become powerful, I’ll be able to protect you!”", "“Haha! Silly girl, I’ll still have to protect you!”", "Su Mo laughed heartily, gently pinched her delicate cheeks, and said flirtatiously, “How soft!”", "Eek!", "Xi’er’s face instantly became bright red, and she ran away with a squeal.", "“Haha!”", "Su Mo burst out laughing and then entered his room to begin his cultivating.", "He sat cross-legged on the bed and first took out 30 Soul Crystals.", "“30 Class 9 Lv 1 Beast Souls should be enough for my Martial Soul to advance to Rank 6 Human Class, right?”", "With a smile on his face, Su Mo crushed a Soul Crystal, and an Ox-like Beast Soul immediately floated out of it.", "He hurriedly released his Martial Soul to devour the Beast Soul.", "The Devouring Martial Soul trembled lightly before becoming calm again.", "“A Class 9 Lv 1 Beast Soul is just as powerful as I expected!”", "After devouring the Beast Soul, he felt a massive power being absorbed into his Devouring Martial Soul.", "It felt much stronger than that of a Class 5 Lv 1 Beast Soul.", "Su Mo continued devouring the Beast Souls.", "Five!", "10!", "20!", "25!", "When he devoured the 28th Beast Soul, his Devouring Martial Soul suddenly shook and emitted a piercing yellow light.", "A sixth yellow halo appeared over it.", "Rank 6 Human Class Martial Soul!", "Su Mo smiled brightly and devoured the two remaining Soul Crystals.", "“A Rank 6 Human Class Martial Soul should be the most highly-ranked one in Sunnywood City! I wonder how powerful it’ll be.”", "He channeled all his power into his Devouring Martial Soul, and its dark vortex began spinning rapidly.", "Its rotating speed was now twice as fast as before, collecting all the Spiritual Qi around Su Mo.", "The majestic Spiritual Qi almost enveloped Su Mo’s entire body. The whole room seemed to have transformed into a sea of Spiritual Qi.", "Su Mo became overjoyed and called on his Martial Soul with all his strength.", "Massive amounts of Spiritual Qi entered Su Mo’s meridians, where he converted them into genuine Qi.", "The genuine Qi inside his body became incredibly dense. When it came to a breaking point, that was the time when he would break into the Lv 5 Qi cultivation realm."]}, "Chapter 22": {"Name": "Ten-to-One Odds", "Translator": "Transn", "Editor": "Transn", "Story": ["The days leading up to Su Mo and Wei Liang’s fight flew by quickly.", "Today, Su Mo would fight with Wei Liang.", "On the day of the fight, no less than 1000 people filled Central Square in Sunnywood City, and they were bustling with chatter.", "“I didn’t think a fight between two young disciples would attract so many people!”", "“Exactly! The Master and elders of the Weis, as well as people from Mansion of City Governor have all come.”", "“Many people from the Sus also come! Their Master and first elder are here, too!”", "“Who do you think will win today’s fight to the death?”", "“Who do you think? Of course, Wei Liang will!”", "“I don’t think so. I’ve heard Su Mo is quite strong and even beat up the son of the city governor the other day.”", "“Even so, Su Mo is no match for Wei Liang. I’ve heard Wei Liang’s cultivation has reached the peak Lv 6 Qi Cultivation Realm.”", "“…”", "A simple spectator stand had been set up in the square.", "The Weis sat on the left. Wei Wankong sat in the middle, with elders flanking him and inferior disciples behind him, including Wei Liang.", "On the right sat the Sus. Su Hong, the first elder, and some other elders were here, too.", "Su Heng and the other disciples stood behind them.", "Besides the Weis and the Sus, many big shots in Sunnywood City sat there, who were here on the Weis’ invitation.", "The Weis wanted everyone in the city to witness a disciple from their family sadistically kill the young master of the Sus.", "“Su Hong, why isn’t your son here yet? Does he get cold feet?” Wei Wankong glanced at Su Hong and asked mockingly after noticing Su Mo’s absence.", "“Humph! Don’t worry! Since my son dared to accept the challenge, he’ll definitely come!” Su Hong huffed back coldly.", "Wei Wankong sneered and thought, “Gloat on! Let’s see how smug you’ll be when your son dies!”", "“Su Mo’s here!”", "Loud cheers came from the outside of the square.", "The crowd automatically parted to make way for a young man and lady.", "The young man was carrying a long sword and was very handsome, while the young lady was such a beauty that she drew everyone’s attention.", "They were Su Mo and Xi’er.", "Everyone thought that they were such a lovely match, but they also lamented that Su Mo would die very soon.", "Su Mo and Xi’er walked onto the spectators stand toward Su Hong.", "“Father.” Su Mo saluted Su Hong.", "“Mo’er, I look forward to your performance,” said Su Hong with a nod.", "“Su Mo, since you’re already here, let’s not waste any time!” Wei Wankong sneered as he glanced at Su Mo. He then looked around and loudly said, “Ladies and gentlemen, today is the voluntary fight to the death between Wei Liang of our family and Su Mo of the Sus. Let Heaven determine their lives! With you all as witnesses, neither family can challenge the outcome afterward!”", "“Let Heaven determine their lives!”", "“Let Heaven determine their lives!”", "The crowd was instantly invigorated and cheered.", "A wide smile appeared on Wei Wankong’sface. He said all of this, because he believed that Su Mo would undoubtedly die today.", "However, if Su Hong lost his mind after his son’s death and recklessly waged war against the Weis, there would be horrible consequences.", "Now that he had said this in front of countless citizens of Sunnywood City, Su Hong would have no reason to argue after Su Mo’s death.", "“Alright. Let’s begin!”", "Wei Wankong took his seat again and nodded to Wei Liang, who was standing behind him.", "With a spear in his hand, Wei Liang stepped out and flew to the center of the square.", "“Su Mo, come and meet your death!”", "Wei Liang glared at Su Mo murderously with his long spear pointing to him.", "Su Mo glanced at his opponent and turned to Xi’er, saying, “Xi’er, stay by my father’s side.”", "He was about to leave and meet Wei Liang’s challenge when Xi’er grabbed the hem of his clothes.", "“Brother Su Mo!” Xi’er looked extremely worried.", "“Don’t worry, Xi’er. I’ll be fine,” said Su Mo while patting her hand to comfort her.", "Suddenly, a loud voice came from outside of the square.", "“Purple Gold Pavilion is starting a handicap. The odds of Wei Liang’s victory is one-to-one. The odds of Su Mo’s victory is ten-to-one. Hurry up and place your bets!”", "Hearing this, many went to place their bets.", "Most betted on Wei Liang’s victory.", "Su Mo was momentarily speechless and cursed in his head,“Ten-to-one odds? Purple Gold Pavilion is really looking down on me!”", "“Master, we’re going to place some bets as well!” said the elders of the Sus with malice in their eyes.", "The First Elder Su Yue, the Fourth Elder Su Tai, and the others wagered a good deal of money on the outcome.", "Though they were from the Sus, they betted on Wei Liang’s victory. How ironic!", "A few people nearby, who were hesitating, made their decisions when they saw that even the elders of the Sus made such a bet.", "“Purple Gold Pavilion will rake in a huge profit this time!”thought Su Mo with the tempting figure of Luo Huan flashing in his mind.", "As so many people bet on Wei Liang, Purple Gold Pavilion would earn a fortune if Su Mo won.", "“Father, go and bet on me! The money is ours to take!”", "With his ten-to-one odds, a bet of 50kg of gold would make a return of 500kg. How could he let such a great opportunity slip out of his hands?", "“Alright! I’ll bet 100kg of gold on you!” Su Hong smiled and placed his bet on Su Mo.", "“Haha! Since Master Su is so confident, we will definitely match you on that!”", "Wei Wankong laughed and wagered a decent amount of money on Wei Liang.", "The Weis was ecstatic about how easy it would be to make money from this obvious outcome.", "After everyone placed their bets, Su Mo flew onto the field in a flash and stopped 10 meters away from Wei Liang.", "The fight was about to start!", "People fixed their gazes on the field.", "“Su Mo, this date next year will be the anniversary of your death.”", "Wei Liang sneered. He did not see Su Mo as a worthy opponent at all.", "“Really? Wei Liang, I suggest you give this fight your all strength today. Otherwise, you don’t even deserve my full effort,” Su Mo said with a smile.", "“How dare you speak so arrogantly!” Wei Liang angrily shouted and said, “I hope you won’t kneel down and beg for mercy later, but even if you do that, I still won’t let you live.”", "“Are you done with your nonsense? Hurry up and attack! I don’t have all day,” Su Mo said calmly with a relaxed expression.", "“Die for your arrogance!”", "Wei Liang was completely enraged with genuine Qi spreading all over his body and turning into a fierce sweeping wind.", "…", "Su Yu and Liu Yushan stood closely together among the crowd of spectators, watching the two fighters on the field.", "“Yushan, I didn’t want to come, but you insisted. What’s so interesting about a predictable fight?” Su Yu shrugged and said flatly.", "“Though his talent is too poor to deserve me, he’s still my cousin and was very kind to me in my childhood. He’s fighting to the death today, so I have to come.” Liu Yushan sighed.", "She still harbored feelings for Su Mo, but those feelings meant nothing in the face of martial arts. Thus, she had abandoned them without hesitation.", "“Wei Liang’s cultivation is at the Lv 6 Qi Cultivation Realm. Even I can’t defeat him easily, not to mention that failure, Su Mo!”", "Su Yu pursed his lips and said with certainty, “For some reason, Su Mo’s strength has greatly improved recently, but at most, he’s at the Lv 4. He’ll be killed by Wei Liang with one move…”", "Before Su Yu could finish speaking, his face froze.", "Su Mo had completely released his breath at the Lv 5 Qi Cultivation Realm.", "“Even if he’s at the Lv 5, he’ll still be defeated eventually.” Su Yu scoffed with an unpleasant look on his face.", "As the top genius in the Sus, he had just reached the Lv 6 with the help of plenty of resources from the family.", "How did Su Mo with his rubbish Martial Soul reach the Lv 5 so unexpectedly?", "How did he cultivate this?", "Su Yu could not understand this."]}, "Chapter 23": {"Name": "The Meteor Spearplay", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo and Wei Liang stood in the middle of the square, facing each other.", "Su Mo’s aura was surging, and his fighting desire was burning. His Lv 5 cultivation was fully exposed for everyone to see.", "That was right. He had successfully broken the Lv 4 bottleneck and entered the Lv 5 two days ago.", "With his cultivation breakthrough, his strength had naturally increased as well. He now possessed complete confidence in his victory today.", "He would show everyone how he, the so-called piece of trash, would turn this battle around.", "“Damn! Su Mo actually has the Lv 5 cultivation!”", "“Didn’t they say his Martial Soul is only at the Rank 1 Human Class? How does he have such a high cultivation?”", "“It looks like all the rumors are fake! The Sus must have lied to us!”", "When everyone realized what Su Mo’s true cultivation was, theystarted raising a commotion and chatted among themselves furiously.", "Unless there was a large disparity in the cultivation, a martial artist couldn’t hide his cultivation by obscuring his aura.", "Moreover, martial artists who cultivated low-level cultivation skills would find it hard to determine the cultivation of those who practiced high-level ones.", "Su Mo cultivated Lv 3 cultivation skills, and he had never shown off his level, so no one knew his true cultivation.", "On the spectator stand, the Weis was also surprised to see Su Mo’s cultivation, but not by much.", "The Lv 5 Qi Cultivation Realm?", "It still was not good enough!", "Unlike the composed Weis, the Sus were all gripped with shock.", "They knew that Su Mo’s Martial Soul was indeed at Rank 1 Human Class. They had seen it with their own eyes, so it could not be a mistake.", "Logically, it was not possible for a person with a Rank 1 Human Class Martial Soul to achieve an Lv 5 Qi Cultivation Realm even within five to six years.", "How long had it been since Su Mo awakened his Martial Soul?", "It was less than two months!", "Su Yue, the first elder, grew sullen, but a sneer soon appeared on his face. He thought that Su Hong must have bought a bunch of elixirs to forcibly increase Su Mo’s cultivation.", "Otherwise, Su Mowould not have had such a cultivation at all.", "A couple weeks ago, Su Hong had even taken 500kg of gold from their treasury.", "Since then, the First Elder began controlling the Sus’ finances with an iron fist. He ruled that even the Master could not withdraw so much money at will without the elders’ approval.", "If Su Hong wanted to train Su Mo, he had to use his own money.", "The Sus would not waste their money and resources on training a piece of trash with a Rank 1 Human Class Martial Soul.", "Su Hong glanced at the elders beside him and took in their expressions. A cold smile appeared on his face.", "He naturally knew what they were thinking, but he did not want to say anything.", "In the middle of the square, Wei Liang raised his eyebrow at the raging Su Mo and laughed. “You have an Lv 5 cultivation. No wonder you’re so arrogant. However, do you really think that’s enough to beat me?”", "“Are you spouting all this nonsense to flaunt your superiority?” Su Mo asked impatiently.", "“Humph! Since you want to die, I’ll help you!” Wei Liang snorted and brandished his spear, hurling it at Su Mo’s chest.", "Like a dragon emerging from the sea, his silver spear moved with a harsh screech as it pierced toward Su Mo.", "“It’s pretty powerful, but sadly, it’s too slow!”", "Su Mo shook his head and dodged the spear, leaving only a residual shadow where he had just stood.", "Wei Liang’s pupils shrunk in surprise, thinking,“How fast!”", "“Su Mo, you can’t defeat me just by relying on your speed.”", "Operating the genuine Qi inside him, Wei Liang suddenly stomped on the ground. He flew out like a sharp arrow and pounced on Su Mo like a rain of 1,000 spears.", "His spear suddenly transformed into countless shadows, completely enveloping Su Mo.", "“Let’s see how you’ll dodge this time,” Wei Liang said with a sneer.", "Rip! Rip! Rip!", "The white shadow of the spear pierced the air and stacked on each other tier upon tier, completely trapping Su Mo in.", "“Not bad, but I’ll still break them!”", "Instead of drawing his sword, Su Mo launched punch after punch, and his powerful fist force eventually broke through the shadow that covered the sky.", "Boom! Boom!", "The bursting sound of the air continued to ring loud and clear, sending sand and pebbles everywhere.", "“Impossible! I’ve only used 70 or 80 percent of my strength, but it still shouldn’t be easily broken by an Lv 5 martial artist!”", "Wei Liang’s expression changed, and he began to get serious.", "What he did not know was that Su Mo’s Ninefold Ocean Wave Fist had reached the Great Completion Realm, and his physical strength was also very strong.", "“Once again! Meteor Spearplay!”", "This time, Wei Liang put all his strength into his attack.", "The dazzling spear radiance grazed the sky, as if meteors were falling.", "“That’s the Meteor Spearplay of the Weis! Su Mo’s going to lose!”", "“I’ve heard that Meteor Spearplay is an Upper Lv 1 martial art technique and has incredible power. I didn’t expect Wei Liang to practice this technique!”", "“I think Su Mo will be killed with a single strike.”", "Everyone started exclaiming as they watched the radiance speeding past them. It was so fast that there was no way to dodge it, so it had to be met head-on.", "On the spectators stand, Su Hong and Xi’er nervously kept their eyes trained on the arena.", "Meanwhile, the Weis all smiled.", "It was over for Su Mo!", "Just then, an indifferent voice rang from the middle of the square.", "“Not bad. You’re worthy enough for me to draw my sword!”", "Su Mo’s expression was calm as he unsheathed his long sword. The white radiance shone as he wielded the sword at a greater speed than Wei Liang’s spear.", "In all honesty, Su Mo could avoid that attack if he dodged with all his effort, but Wei Liang had roused his fighting spirit.", "Therefore, he decided to draw his sword.", "Boom!", "The point of sword hit the point of spear. Boom! The sword Qi was everywhere and the spear light flashed.", "Both men were forced backward.", "“What? Su Mo actually fought off this move!”", "“Unbelievable! Su Mo’s realm is one rank lower than Wei Liang’s, but he can compete with him!”", "“…”", "The crowd outside the square instantly erupted with endless chatter.", "“Interesting! There’s actually someone with the strength to fight beyond his rank in this remote town!”", "Outside the square, a charming figure stood behind the crowd and watched the fight from a distance.", "She wore a veil covering her face, but judged from her enchanting figure, she must be a stunning beauty.", "She was the leader of Purple Gold Pavilion, Luo Huan.", "She had been here the whole time, watching the fight silently.", "She was rather curious about Su Mo.", "In the middle of the square, Wei Liang’s expression was very ugly. He felt embarrassed after failing to defeat Su Mo after so many moves.", "Wei Liang felt very embarrassed, because he did not defeat Su Mo after a series of strikes.", "“Su Mo, I’ll admit you’re pretty good, but it’s impossible for you to win today!” Wei Liang shouted.", "“Really? I’ve already taken three of your moves. Why don’t you take three of mine?” Su Mo smiled without responding to Wei Liang’s statement.", "“Humph! Never mind three strikes. I can take hundreds of strikes from you. Bring them on!”", "Wei Liang’s tone was disdainful, but his expression was grim.", "Su Mo’s strength was far beyond his expectations. He had completely stopped underestimating Su Mo.", "Su Mo smiled gently and suddenly charged at Wei Liang at an incredible speed.", "Whoosh!", "The long sword in his hand seemed to be dancing, flashing with a liquid sword radiance before suddenly disappearing."]}, "Chapter 24": {"Name": "A Crushing Victory", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo’s sword hurtled towards Wei Liang’s neck like a traceless bolt of lightning.", "“What?”", "Wei Liang was so startled that all his hairs stood on end, and an acute fear arose in his heart.", "He had never seen such strange swordsmanship before.", "“Fast!”", "“So fast that it moved without a trace!”", "Wei Liang had no time to duck, so he let out a shout and used his spear to block his body.", "Clang!", "As the long sword hit the spear, Wei Liang felt a strong jolt travel through his body. His arms went numb, and he was forced to stumble back.", "Su Mo’s blood was boiling, and Qi blood was pouring profusely from him. His first strike did not hit its target, so he swung his force again with powerful genuine Qi and physical force.", "“Gale Blade!”", "The sword ray glinted and pierced the air, and its shadow swept toward Wei Liang’s head.", "Huff!", "Wei Liang shouted and waved his spear, forming a shield against Su Mo’s sword.", "Boom!", "The long sword swung down violently, and its immense force sent Wei Liang flying back a dozen meters.", "“How could it be? How could you be this powerful?” Wei Liang roared in shock.", "His hands were fractured, and his entire arm was completely numb. He could barely hold the spear in his hand.", "His blood was also boiling with Qi blood rising up his throat, but he forced it back down.", "“Nothing is impossible! Those were two of my moves, and here’s another one.” Su Mo said coldly and immediately attacked again, leaving Wei Liang no time for recovery.", "Blast through Stray Clouds!", "Pew!", "The sword radiance glinted, and all the surrounding airflow immediately began to rumble. Suddenly, a cyclone appeared, tearing up all its surroundings and heading straight towards Wei Liang.", "“Howl!” Wei Liang roared as a fear of imminent death arose in him, and a seven-foot-long spear appeared on his back surrounded by yellow light.", "Wei Liang’s Martial Soul with four yellow halos was also a long spear, and it meshed well with the weapons he used.", "Rank 4 Human Class Martial Soul!", "“Starlight Illuminating the Earth!”", "This time, Wei Liang did not simply defend himself. Instead, he used his Martial Soul and all the genuine Qi in his body to enact his strongest move to counter Su Mo’s attack.", "After he released his Martial Soul, Wei Liang’s power increased at least by half.", "The spear rattled and tore through the air to meet the approaching attack.", "Boom!", "The fierce attacks violently crashed into each other.", "Poof!", "A stream of blood shot into the air. Wei Liang’s body flew back like a limp sack and fell to the ground.", "Silence!", "Everything surrounding them was dead silent.", "All the spectators were completely dumbfounded and could not believe their eyes. The result was way beyond their expectation.", "Su Mo had gained a crushing victory over Wei Liang!", "Wei Liang was defenseless against Su Mo!", "After a moment of silence, the entire square erupted with deafening noise.", "“My God, Wei Liang actually lost!”", "“Is this Su Mo’s actual power?”", "“What kind of Rank 1 Human Class Martial Soul could do that? The Sus have been lying to us!”", "“Tsk tsk, it’s so impressive that he’s that powerful with only an Lv 5 cultivation!”", "“…”", "The chaotic chatter went on for a long time.", "On the spectators stand even Su Hong seemed stunned. Even though he believed in his son, he was still surprised by Su Mo’s strength.", "Unlike the shocked Su Hong, Xi’er was smiling joyfully.", "Su Mo had a special place in her heart, and her impression of him was merging with the dashing hero she met two weeks ago.", "Back then, when Xi’er was kidnapped by bandits, she had already given up her will to live. If those bandits had tried to tarnish her chastity, she would have immediately killed herself.", "However, at that moment, a handsome young man had come out of nowhere, rescued her, and avenged her.", "She vowed to follow Su Mo not only because she wanted to become stronger, but also out of her thankfulness and idolization toward him.", "In the Weis’ camp, every member of the Weis was stone-faced, especially Wei Wankong, who was sulking and secretly cursing Wei Liang for being a failure.", "In a 30 meter-high tower with 300 meters from the square, a well-dressed handsome young man watched the square from afar with a sour look on his face.", "He huffed coldly and turned away.", "This young man was Lin Xiao.", "On the square, Wei Liang stood up pathetically and could not help but spit out another mouthful of blood.", "“This can’t be possible!”", "His eyes were filled with shock, and he could not accept his loss.", "“Ha! Wei Liang, didn’t you want to kill me?” Su Mo asked with a mocking smile.", "“You…!”", "Wei Liang’s face contorted, and he roared with a crazed look in his eyes. “I haven’t lost, and you’ll still die today!”", "He suddenly took out a black medicinal pill from his pocket and swallowed it.", "Boom!", "After swallowing the pill, Wei Liang’s body noticeably shriveled.", "At the same time, the breath in his body dramatically increased. In a matter of seconds, he reached an equivalent of Lv 7 Qi Cultivation Realm.", "“It’s a Seething Blood Pill!”", "“My God, Wei Liang ate a Seething Blood Pill!” The crowd immediately exclaimed.", "The Seething Blood Pill was an extremely potent elixir that caused a martial artist’s blood to erupt and their body to dry up in 15 minutes.", "The benefit was that during this time span, this person’s strength would greatly increase.", "Of course, the cost was that the person would die of blood loss as the time passed.", "However, if the martial artist stopped the effects of the pill earlier, he could survive, but this would prevent him from pursuing martial arts in the future.", "“Stop it!” Su Hong stood up in the spectators stand and yelled angrily at the Weis. “Wei Wankong, how dare your disciple to use the Seething Blood Pill in an official match! This battle is canceled.”", "Wei Wankong was stunned, but then his sulking expression turned into a smile.", "He had not expected Wei Liang to take a Seething Blood Pill, either.", "However, since he had already taken it, this battle could turn in his favor.", "“Su Hong! You’ve never said that medicinal pills couldn’t be used before the battle began.” Wei Wankong chuckled and continued, “We’ve agreed before that the results of this battle and their lives would be decided by fate. Are you going back on your word?”", "“You…” Su Hong shouted angrily, “This battle is no longer fair. I object to it.”", "He then yelled into the arena, “Mo’er, this battle is over! You can come back!”", "After he took the Seething Blood Pill, Wei Liang’s cultivation was equivalent to Lv 7 Qi Cultivation Realm. Su Hong was not willing to watch his son be killed.", "In the arena, Su Mo heard his father’s call but did not move.", "He coldly glanced at Wei Liang and said to Su Hong, “Father, I don’t see any issue in testing his current abilities!”", "Su Mo’s eyes surged with fighting desire, and his blood boiled.", "“Seething Blood Pill?”", "“Lv 7 Qi Cultivation Realm?”", "“Who knows who’s going to win or lose!”", "“Mo’er…” Su Hong was extremely worried.", "“Father, don’t worry! I know what I’m doing.”", "Su Hong sighed and nodded in defeat while secretly preparing to save Su Mo if his life was in danger.", "“Great, he’s indeed quite brave. Su Hong, since your son wants to keep fighting, let’s continue!” Wei Wankong laughed."]}, "Chapter 25": {"Name": "Final Hit of Heavenly Wind", "Translator": "Transn", "Editor": "Transn", "Story": ["In the arena, Wei Liang’s genuine Qi surged, and his strength at least doubled.", "The influx of strength made him feel like he could bring down the sky.", "“Su Mo, I’ll admit that you’re exceptionally strong. I’ve underestimated you.” A cold light gleamed in Wei Liang’s eyes as he continued, “Now, you no longer stand a chance.”", "“Do you really think you’re definitely going to win?” Su Mo asked calmly.", "“Is that not the case?”", "“How about this, Wei Liang? Let’s not waste each other’s time and settle this in one move!”", "Su Mo’s eyes blazed with fighting desire.", "“Alright, ending this match quickly is exactly what I wanted.” Wei Liang roared, and the genuine Qi in his body increased infinitely and all poured into his spear. The spear shook and emitted a blinding light.", "Su Mo’s face was solemn, and, like his opponent, he put aside his mocking attitude.", "He twirled his long sword, which was surging with Primordial Genuine Qi. The sword radiance grew much brighter.", "At that moment, Su Mo’s mind was as still as water and only focused on his burning desire to kill.", "Everyone held their breath and kept their eyes glued to the arena.", "It was finally the deciding moment!", "“Starlight Illuminating the Earth!”", "Wei Liang attacked first with his usual strongest move, but this move was far more powerful than before. His spear turned into a raging dragon that crazily shot toward Su Mo.", "Suddenly, everything came to a standstill, and all that was left was the blinding light of the spear.", "Whoosh!", "Su Mo threw his body forward and lept into the air.", "An unparalleled sword radiance pierced the air so violently that it seemed to break the restraints of space and time.", "Final Hit of Heavenly Wind!", "This was the last and most fatal move of Divine Wind Swordplay.", "This move was overpowering, sharp, strange, and ethereal.", "This move shocked all of the Sus and the Weis!", "This move shocked all of the spectators!", "Su Mo’s swordsmanship did not belong to the Sus’. They had never seen such powerful and sharp swordplay.", "Wei Liang felt the menace of this attack more than anyone, but both men had made their moves, so there was no going back.", "Wei Liang could only howl and increase his genuine Qi to make his attack 30 percent more powerful.", "Boom!", "Amidst everyone’s shock, the two attacks violently crashed into each other and exploded like meteors hitting the earth.", "Boom!", "The air streams from the explosion shattered the ground and sent debris flying everywhere.", "Su Mo and Wei Liang’s silhouettes were enveloped in a layer of smoke. No one from the outside could tell what was going on.", "On the spectators stand, everyone got up from their seats and fixed their gazes on the square.", "“Who won?”This was the question burning in everyone’s minds.", "The smoke dissipated after a while, revealing Su Mo and Wei Liang standing five feet away from each other.", "Everyone stared with wide eyes.", "Everything was dead silent.", "Pfft!", "At this moment, they heard a slight noise.", "In the middle of the square, Su Mo’s body shook, and he spat out a mouthful of blood.", "“What?”", "”Su Mohas lost?”", "“At the end of the day, the powerfulSu Mohas still been defeated!”", "The spectators were shocked, but they soon realized that no matter how powerful Su Mo was, the gap between their cultivations was too great to overcome.", "Just as this idea popped into their minds, they met with a surprise.", "Clunk!", "The spear in Wei Liang’s hand dropped to the ground with an echoing sound.", "Amidst everyone’s stunned stares, Wei Liang’s tall figure came crashing down and sent up a cloud of dust.", "Upon closer inspection, everyone saw a terrifying sword wound on Wei Liang’s body.", "The gash extended from his neck to his abdomen, practically slicing him in two.", "However, since the Seething Blood Pill had almost dried up all of his blood, he was not bleeding much.", "Hiss!", "Gasps were heard everywhere among the crowd.", "“So Wei Liang actually lost!”", "Everyone looked at Su Mo in awe.", "This martial artist with a Lv 5 cultivation was able to kill Wei Liang, who was at Lv 7.", "Nothing like this had ever happened in the history of Yunyang City.", "Who was a genius?", "Su Mo was a true genius!", "The entire square erupted with thunderous noises, including the adoring screams of young women.", "“Haha! Great! Great!” On the stand, Su Hong was beaming and could not contain his laughter. His son never failed to surprise him.", "One person’s joy was another’s sorrow. Unlike the overjoyed Su Hong, Wei Wankong was stone-faced. This time, not only was he unable to avenge his son, he also lost a genius disciple.", "He wanted to scream in rage, but he was too prideful to do so.", "He himself had said in front of everyone that it would be a fight to the death.", "In the end, he could only scoff and order for Wei Wankong’s body to be collected. He then pathetically left in defeat along with the members of his family.", "“Mo’er, how are you doing? Are you badly hurt?” Su Hong asked with concern as he approached Su Mo.", "“Haha! Father, I’m fine! It’s just a scratch.” Su Mo shook his head with a smile. He was telling the truth. He only suffered some trauma to his abdomen, which would heal in a couple of days.", "This was due to Su Mo’s physical strength. Elephant’s Strength Skill not only made him powerful but also greatly improved his physical resilience.", "Otherwise, even if he was not killed by this blow, he would still be severely injured.", "“Alright, since this battle is over, let’s go home!” said Su Hong.", "“Brother Su Mo, let me help you walk,” said Xi’er while rushing to put her arm around him.", "“Xi’er, it’s just a minor injury.”", "“You spit up blood! How is that a minor injury?” Xi’er shook her head and insisted on helping him.", "Su Mo smiled helplessly. Next to Xi’er, he could smell the faint fragrance of her body, and he was instantly captivated.", "Subsequently, he accompanied his father to collect the winner’s prize and returned home.", "Having betted 100 kg of gold, Su Hong walked away with a whopping 1,000 kg of gold.", "Aside from him, everyone else had lost their bets and were all wailing in despair!", "The First Elder and other members of the Sus had all lost their bets and were extremely displeased.", "Prior to the match, they were certain that Su Mo would lose, so they had bet heavily against him.", "Now, they had lost all their money.", "As the crowd slowly thinned out, Su Yu and Liu Yushan stood outside the square in shock.", "Liu Yushan’s emotions were complicated. She had always believed that Su Mo was not good enough for her, but his performance today proved her wrong.", "A faint feeling of regret stirred in her heart.", "“He only has a Rank 1 Human Class Martial Soul. Even if he’s strong now, it’s only temporary. He can’t go far in martial arts!” said Su Yu.", "His words gradually calmed her down.", "…", "“Xi’er, wasn’t I cool?” asked Su Mo shamelessly on their way home.", "“Very cool!” said the girl shyly with a faint blush spreading on her face.", "“Did you fall in love with me?” Su Mo was in a great mood and teased her mischievously.", "Xi’er was instantly embarrassed and practically buried her flushed face in the ground.", "“Haha!” Su Mo burst out laughing.", "After they returned to the Sus, his father gave him healing elixirs.", "Su Mo began to heal in seclusion."]}, "Chapter 26": {"Name": "The Sky Yuan Sect", "Translator": "Transn", "Editor": "Transn", "Story": ["Just after sunrise, next to a crystal-clear pond behind the Sus mountain, sword radiance glittered as sword Qi sliced the air into a million pieces.", "Su Mo was practicing his swordplay. Ever since his fight with Wei Liang a month ago, he had gained a deeper understanding of Divine Wind Swordplay.", "Actual battles were the best way to practice.", "Lately, he had been coming here every morning to practice his swordplay.", "Divine Wind Swordplay had four movements. Two weeks ago, he had reached the Minor Completion Realm of the first three, and two days ago, he had reached the Minor Completion of the last one, boosting his strength tremendously.", "Su Mo did not neglect his cultivation over the course of the month, which had steadily increased to the Peak Lv 5 Qi Cultivation Realm.", "His Rank 6 Human Class Martial Soul cultivated extremely quickly, so he spent most of his time cultivating his physical body.", "His cultivation of Elephant’s Strength Skill had reached the late stage of Lv 2, making his body as strong as six tigers and equivalent to a Lv 6 Qi Cultivation Realm martial artist.", "If he had fought Wei Liang with his current strength, Su Mo would have been able to instantly kill him with one move.", "Nearby, Xi’er sat on a smooth boulder, resting her cheeks on her hands. She wore a snow-white dress with a blue jade pendant.", "“Xi’er, do you want to learn this swordplay?” asked Su Mo with a grin, having finished practicing.", "“Haha! Brother Su Mo, I’m very dumb. I don’t know if I can learn such profound swordplay,” Xi’er said with a smile.", "“Who said you’re dumb? Xi’er is smarter than everyone else.” Su Mo smiled and then seriously said, “Xi’er, you’ve reached the Lv 8 of the Body Tempering Realm, right? Soon, when you complete it and awaken your Martial Soul, I’ll teach you how to practice swordplay.”", "The Body Tempering Realm toughened one’s body, so it would be strong enough to awaken a Martial Soul.", "“Uh-huh!” Xi’er nodded.", "“Also, I always see you wearing this jade pendant and staring at it. Is there a story to it?” Su Mo asked, sitting down next to her and looking at her pendant.", "“Of course, you don’t have to tell me if you don’t want to. I’m just asking.” Su Mo hastily added when he saw her smile had disappeared.", "“Brother Su Mo, this jade pendant is related to my birth story.”", "She took off her jade pendant and gently said, “When grandpa found me back then, I was still a baby. The only thing he found on me was this jade pendant. Perhaps, this jade pendant is the only thing related to my real identity.”", "Su Mo took the jade pendant from her and studied it carefully.", "The sea-blue jade pendant was the size of a child’s palm and had the word “Xuan” carved on the back. This script was extremely elegant and gave off a powerful aura.", "Su Mo could tell that this was no ordinary pendant.", "“Xi’er, if I ever get the chance, I’ll definitely help you find your birth parents,” Su Mo seriously said after handing her the pendant.", "“That’s alright, Brother Su Mo. I’m very happy with my life, and I feel lucky to be able to watch you practice swordplay every day.” Xi’er smiled.", "“Haha! You silly girl!” Su Mo gently rubbed her head.", "“Let’s go home, Xi’er!” Su Mo walked back to the Sus with her.", "…", "After returning, Su Mo went to the Sus’ martial practice field.", "The clan had an announcement to make today about the clan meeting.", "A lot of disciples already gathered in the martial practice field. Many of them greeted Su Mo when they saw him.", "“Hello, Cousin Su Mo!”", "“Hello, Brother Su Mo!”", "After Su Mo proved his strength to everyone in the fight last month, no one dared to call him a piece of trash anymore.", "Of course, a majority of them still wanted nothing to do with him.", "These people, including Su Heng and Su Yu, believed that Su Mo’s powerful strength was temporary, and his accomplishments would nevertheless be limited due to his low-level Martial Soul.", "Su Yu was also on the martial practice field. He glanced at Su Mo as he approached from a distance but quickly looked away.", "Though the fight last month had shocked him, he still looked down on Su Mo.", "With a Rank 1 Human Class Martial Soul, Su Mo would never be able to catch up with him.", "A group had gathered around Su Yu, chattering about something excitedly.", "“Brother Su Yu, I’ve heard that Brother Tianhao and Su Hai have returned from the Sky Yuan Sect.”", "“Yes! I’ve heard both of them reached Lv 9 Qi Cultivation Realm. They’re really terrifying!”", "“Haha! Brother Su Yu’s Martial Soul is of a higher level than theirs. It won’t be long before you enter the Sky Yuan Sect and surpass them.”", "“Are Su Tianhao and Su Hai back?”", "Su Mo overheard their conversation from afar and raised his eyebrows.", "Su Tianhao and Su Hai were respectively the sons of the third and fourth elders. They were the strongest among the young Su disciples.", "Last year, they left the Sus at the age of 18 to join the Sky Yuan Sect, one of the four sects of Skymoon Country.", "No one expected they would reach Lv 9 Qi Cultivation Realm in just one year.", "Just then, the crowd stirred.", "“Here comes Brother Tianhao and Brother Su Hai!”", "Su Mo turned his head and saw two young men slowly walking over.", "Their aura was extremely powerful and greatly surpassed everyone else’s.", "Su Tianhao was tall and slim, wearing a yellow robe and a stern expression.", "The other stocky man dressed completely in black was Su Hai.", "“Brother Tianhao!”", "“Brother Su Hai!”", "Just as the two reached the martial practice field, a group of young disciples crowded around them with adoring expressions.", "“Brother Tianhao, Brother Su Hai, can you tell us what the Sky Yuan Sect is like?”", "“Yes, yes! I’ve heard that the Sky Yuan Sect is brimming with masters and geniuses. Is that true?”", "“…”", "The crowd fired one question after another about the Sky Yuan Sect.", "Su Tianhao looked prideful and showed no interest in answering their questions.", "On the contrary, Su Hai was full of smiles and answered. “You’re right. The Sky Yuan Sect has 5,000 disciples, and each of them is a genius.”", "That’s not all. The sect has all kinds of powerful cultivation skills and martial arts techniques, as well as countless miraculous pills.", "Each month, we receive all kinds of resources, and our cultivation improves by strides.", "I’m so valued in the sect that I’ve heard some elders want me as their disciple!”", "“…”", "The more Su Hai blabbered on, the more excited and exaggerated he became, spewing spittle all over the place.", "However, all the surrounding disciples were mesmerized and envious. Even Su Yu was entranced by the stories.", "Su Mo’s lip curled. Though he was not familiar with the Sky Yuan Sect, he knew that Su Hai was bragging.", "As one of the four sects in Skymoon Country, it made sense that every disciple was a genius there.", "However, Su Hai’s Martial Soul was only at Lv 4, which probably placed him in the bottom tier of the sect. How could he receive so much attention and be selected as a disciple by elders?", "He was just talking crap!", "Su Hai loftily raised his head and smugly took in everyone’s jealous stares.", "He greatly enjoyed the feeling of being envied.", "Just then, Su Hai noticed Su Mo’s unimpressed expression out of the corner of his eye and instantly became enraged.", "“Haha! Su Mo, I’ve heard your strength is equivalent to Lv7 Qi Cultivation Realm, and you killed Wei Liang last month,” he said with a smirk.", "Su Mo did not reply.", "Su Hai then abruptly changed his tone and scoffed. “However, with your strength, you’re nothing to me!", "I know you only have a Rank 1 Human Class Martial Soul. You’ll never reach the Peak of the Qi Cultivation Realm, never mind entering the Sky Yuan Sect.”", "Su Mo frowned. What was wrong with this guy? He had done nothing to deserve his ridicule!", "“Whether or not I’m capable of entering the Sky Yuan Sect is none of your business,” he said flatly.", "“Humph! You’re just a powerless nobody!” Su Hai coldly scoffed, and then he turned to Su Yu with a smile. “Su Yu, I’ve heard you have a Rank 5 Human Class Martial Soul. Not bad. At the end of this year, you can take the sect’s entrance exam. It won’t be a problem for you.", "Of course, all members with Rank 4 Human Class Martial Souls can take the exam, but that rank is the minimum requirement for entry, so it’ll be hard to pass the exam. Back then, Brother Tianhao and I had exerted great effort to pass it.”", "“Haha! Next year, I’ll definitely enter the Sky Yuan Sect.” Su Yu smiled confidently and glanced at Su Mo with mocking eyes."]}, "Chapter 27": {"Name": "The Martial Arts Competition in Sunnywood City", "Translator": "Transn", "Editor": "Transn", "Story": ["In the martial practice field, Su Mo ignored Su Yu and the others. Instead, he sat down to meditate.", "After a while, Su Hong arrived on the martial practice field with the elders.", "“Please be quiet, everyone. May I have your attention?”", "Su Hong held his hand up to silence everyone.", "“Our yearly family martial arts competition will be held in 10 days.” When the crowd grew quiet, Su Hong continued, “However, unlike those in the past, the elimination match has been changed to a challenge match. The winner will be able to enter the Sunnywood City Martial Arts Competition.", "The City Martial Arts Competition is a joint competition between our family, the Weis, and the City Governor’s Mansion. Each family will send 10 superior disciples to attend this competition, and our three families will grant large rewards to those who perform well in the competition.", "The 10 disciples from our family will be selected from the challenge match. Before the match begins, we’ll select 10 seeded disciples. Other disciples can challenge them, and if they defeat the seeded disciples, they can replace them.”", "Su Hong explained the family competition and the Sunnywood City competition carefully.", "“Who are the 10 seeded disciples?” someone asked.", "“We’ll discuss this soon,” the First Elder said.", "He looked around and continued, “Su Tianhao and Su Hai, you’re both outstanding among our inferior disciples, so both of you are definitely seeded disciples. Yu’er, you should also work hard. You have the highest Martial Soul among the Sus, and you’re the first genius of our family, so live up to your title. In this competition, you three are critical to our family’s victory. You must win glory for our clan.”", "The others all nodded and did not doubt his words. They all believed that these three were the main talents of the Sus.", "Su Yu and Su Hai looked extremely arrogant.", "Su Tianhao maintained a stony expression. He was the most powerful among all the young disciples, so he did not care about this level of competition.", "“Alright, you may now be dismissed. Be industrious in your cultivating,” said Su Hong, waving his hands.", "When the disciples left, Su Hong found Su Mo and said, “Mo’er, you’ll be one of the seeded disciples.”", "“Haha, Father, I’m actually not that interested in the martial arts competition,” Su Mo said with a chuckle.", "“Mo’er, this martial arts competition will offer generous prizes, and the City Governor’s Mansion is even gifting the winner an Energy-boosting Elixir. Other rankings will have big rewards as well,” Su Hong said.", "“Oh, Energy-boosting Elixir!” Su Mo’s eyes instantly lit up.", "The Energy-boosting Elixir was an Upper Lv 1 elixir. It was very precious for martial artists between Lv 7 and Lv 9 Qi Cultivation Realm, because it could save them three months’ worth of cultivation.", "Additionally, martial artists below Lv 7 Qi Cultivation Realm could use it to break through their realms.", "“Both the Weis and the City Governor’s Mansion have powerful disciples who have cultivated in Sects. I don’t expect you to enter the top three. I’ll be very satisfied if you enter the top 10.”", "Su Hong did not want to give him too much pressure. After all, he knew that Su Mo had only cultivated for a short time and was weaker than the disciples in Sects.", "“Haha, father, don’t worry. I’ll try my best to rank high.” Su Mo smiled, his eyes twinkling.", "“Only top 10? My father has such low expectations for me!”", "“Good.” Su Hong patted him on the shoulder with relief.", "After going back to his room, Su Mo sat down cross-legged and started to cultivate.", "He had to cultivate harder if he wanted to win the martial arts competition.", "That was right. He wanted to win!", "Either he did not compete, or he would aim to be the champion.", "He sat cross-legged with closed eyes. The three-meter-high Devouring Martial Soul suspended behind him and crazily sucked in aura from heaven and earth.", "When his Devouring Martial Soul had just awakened, it was only one and a half meters high, but now, as its level progressed, it was three meters high.", "The Devouring Martial Soul rotated and emitted an invisible suction to devour all the surrounding Spiritual Qi.", "Su Mo used the Lv 2 cultivation skill of Elephant’s Strength Skill. His giant mass of Spiritual Qi became elephant-shaped runes, which continuously entered his body.", "His body felt a little numb, which meant it was being increasingly reinforced.", "Lvs 1 to 3 of Elephant’s Strength Skill mainly enhanced his strength and fortified his body.", "His cultivation of Elephant’s Strength Skill had reached the late stage of Lv 2, which gave his body the strength of six tigers.", "With his cultivation speed, it would take at most a couple of days to complete Lv 2 and begin cultivating Lv 3.", "Elephant’s Strength Skill could refine Spiritual Qi at a formidable speed and could absorb any amount of it at an alarming speed.", "His Martial Soul at Rank 6 Human Class still could not absorb Spiritual Qi as quickly as his body.", "Time trickled by slowly.", "Three days later, Su Mo felt that his body was saturated with Blood Qi and could not absorb the elephant-shaped runes anymore.", "He opened his eyes and stopped cultivating.", "He had completed Lv 2 of Elephant’s Strength Skill.", "Next, he needed to cultivate Lv 3 cultivation skill.", "However, in order to speed up his cultivation, he decided to go on a trip.", "Sunnywood City’s martial arts competition would be held soon, so he decided to go back to Breezewind Mountain to increase his strength.", "There, he could kill as many beasts as he wanted and devour their Beast Souls, essence, and blood.", "Stepping out of his room, he saw Xi’er practicing her punches in the yard.", "She was cultivating the Body Tempering Fist. She waved her fists, shouting with determination.", "Her pretty face was glistening with beads of sweat.", "“Xi’er, I’m going to Breezewind Mountain to hunt demonic beasts. I’ll be back tomorrow,” he said to her.", "“Brother Su Mo, I want to go, too. Please take me!” Xi’er stopped cultivating and looked at him excitedly.", "“Alright! Let’s go!” After considering this for a while, Su Mo nodded.", "Although the mountain was dangerous, he could protect her as long as they did not go too deep into the mountain.", "They left Sunnywood City for Breezewind Mountain immediately.", "…", "In a quiet yard in the City Governor’s Mansion sat a handsome young man who wore a silk robe.", "He was holding a flirtatious maiden in blue in his arms, kneading her hip and sizeable breasts.", "He was Lin Xiao, the son of the city governor.", "Just then, a voice said from outside of the yard, “Young master, I have something to report.”", "Lin Xiao frowned but did not let go of the maiden. He shouted, “Come on in!”", "Immediately, a tall middle-aged guard walked in and bowed to him.", "“Young master, Su Mo left town!” he said.", "“Hmm? With whom?” Lin Xiao asked excitedly, and his eyes lit up.", "“It is just him and Lady Xi’er.” The guard replied.", "“Excellent! I’m in luck! Take several people with you to kill him and steal Lady Xi’er back.” Lin Xiao was overjoyed and added hurriedly, “Remember, you can’t hurt her. Send her to my room at night.”", "“Yes, sir!” The guard said before leaving.", "Lin Xiao’s face was full of excitement. Since he saw Xi’er last time, he had not been able to get her beautiful figure out of his mind.", "He had been tirelessly thinking about how he could make her his woman.", "Therefore, he had dispatched someone to keep an eye on Su Mo and her.", "Now, to his joy, his dream was about to come true.", "As soon as he imagined her dainty face and the charming figure lying under his body, Lin Xiao began to blush furiously.", "Suddenly, he lost all interest in the beautiful maiden in his arms."]}, "Chapter 28": {"Name": "The Siege", "Translator": "Transn", "Editor": "Transn", "Story": ["Outside Sunnywood City, Su Mo held Xi’er’s hand as they walked along the mountain trail.", "“Xi’er, if we encounter any demonic beasts, hide behind me,” he said.", "“Uh-huh!” Xi’er nodded.", "After a while, they arrived and entered Breezewind Mountains.", "Howl!", "A Class 2 Lv 1 lion-like demonic beast lept out at them, and Su Mo easily punched it to death.", "“Xi’er, close your eyes!” he said.", "Xi’er was a little bit surprised but did not ask why and obediently closed her eyes.", "Su Mo released his Martial Soul, which instantly devoured the demonic beast’s Beast Soul, essence, and blood.", "He told Xi’er to close her eyes, not because he did not trust her and did not want her to know his secret, but because he wanted to protect her.", "He did not want her to be traumatized by watching a demonic corpse turn into a mummy.", "“Alright, Xi’er, let’s go!” said Su Mo while taking the Demonic Core out of the demonic beast.", "Xi’er opened her eyes, and she was astonished to see that the corpse had been reduced to a bag of bones.", "“Brother Su Mo, what happened to this demonic beast?” Xi’er asked in astonishment, and her eyes were filled with confusion.", "The demonic beast had been so big and mighty, but in the blink of an eye, it turned into a mummy.", "She knew that Su Mo had done this.", "She also knew that Su Mo had made her close her eyes, so she would not see it.", "However, she still could not help but ask what had happened.", "“I devoured its essence and blood. That’s why it looks like this now.” Su Mo admitted truthfully.", "“Devoured?”", "Xi’er was even more confused, for she did not understand how it could be done.", "“Haha, Xi’er, if you want to how, I’ll show you later,” Su Mo said with a smile.", "Xi’er only shook her head and said, “Since you don’t want me to see it, then I won’t. Let’s go, Brother Su Mo!”", "Most of the demonic beasts in the outskirts of the mountain were below Class 3 Lv 1.", "Since Xi’er slowed him down, Su Mo killed every demonic beast they encountered and devoured their Beast Souls, essence, and blood.", "Xi’er closed her eyes every time Su Mo killed a demonic beast, despite her curiosity.", "Although Su Mo allowed her to watch, she insisted against it.", "Because Su Mo did not want her to see, she would not do so.", "Su Mo could only shake his head helplessly at her stubbornness.", "Boom!", "He killed a Class 3 Lv 1 demonic beast again.", "Just when he was about to devour it, he suddenly sensed something and turned around.", "Swish! Swish! Swish!", "Seven or eight men in black suddenly jumped out of the woods behind them and quickly surrounded Su Mo and Xi’er.", "“What do you want?” Su Mo asked with a frown, hastily pulling Xi’er behind him and giving them a once-over.", "The men held steel broadswords, and their dense aura indicated that they were all masters. They surrounded Su Mo and Xi’er without saying a word and obviously had bad intentions.", "“Su Mo, give us the girl, and I might consider letting you live.”", "The leader of this group was a tall and strong middle-aged man with a cold face and eyes full of killing desire.", "Su Mo arched his brows after hearing that.", "“They’re here for Xi’er, and they know my identity. It seems they came prepared,”Su Mo thought.", "“Who are you?” Su Mo snapped at them.", "“A dying man has no business knowing.” The middle-aged man sneered, and then he waved his hands and shouted, “Kill him!”", "He was obviously unwilling to waste his time, so he gave a prompt order.", "Whoosh! Whoosh!", "The others waved their long sabers and sprang toward Su Mo.", "These people had a very powerful aura and were all at Lv 7.", "If combined, they could even rival someone at Lv 8.", "Swish!", "Su Mo quickly pulled Xi’er away, and they dodged the sabers, leaving only a shadow where they had just stood.", "“Xi’er, get on my back and hold tight!” Su Mo pulled her onto his back.", "Although they were all at Lv 7 Qi Cultivation Realm, it was impossible for them to kill him.", "Su Mo was only slightly threatened by the leader, who seemed to be at the Peak Lv 8 Qi Cultivation Realm, far more powerful than the others.", "If he were fighting a master at the Peak Lv 8 Qi Cultivation Realm one-on-one, he would definitely be able to slip away easily if he could not win.", "However, protecting Xi’er was his top priority.", "Xi’er also understood the severity of the situation, so she obediently climbed onto Su Mo’s back.", "Su Mo felt the softness and fragrance of her body, but before he could enjoy it, a long saber hit toward him.", "“Whoosh!”", "Su Mo used his body move to dodge to the side of a man in black.", "Clash!", "After a long sword came out of its sheath, with a flash of sword radiance, a stream of blood sprayed out.", "Killed in one move!", "Su Mo stepped back rapidly after the kill.", "“What?”", "The men in black were so astonished that he could kill someone in such a short time.", "“He’s so fast!” the leader said in shock.", "Just a month ago, Su Mo’s strength was rarely equivalent to the Lv 7, but now, he could instantly kill a Lv 7 martial artist.", "“You’re still going to hell today!” the leader roared, pulling out his revolving saber and hacking toward Su Mo.", "“Whoosh! Whoosh! Whoosh!”", "He hacked three times in a row, and three sharp gusts of sword Qi went zig-zagging toward Su Mo.", "The saber Qi blocked Su Mo from dodging, so he had to face it directly.", "“Gale Blade!”", "Su Mo swung his sword with the power of surging winds. Soon, the sword radiance burst out and cut the saber Qi in front of him.", "Boom!", "The saber Qi was shattered and turned into a fierce wind that swept around.", "Uh!", "Suddenly, a muffled groan escaped from Xi’er’s lips.", "Su Mo turned back and found Xi’s face was pale as white paper. She was biting her lips so hard to hold her moans back.", "Su Mo was shocked and felt guilty for not noticing.", "Xi’er was so weak that she could not withstand the aftershocks of the attacks.", "However, there was no time to think. As soon as he countered this attack, more attacks came from the other men.", "The saber radiance shined like streaks of lightning, heading toward Su Mo’s vital parts.", "Swirling Winds and Clouds!", "As a sword slashed, a fierce wind forced both the men and Su Mo back.", "He could have beaten those men, but he had to make sure that Xi’er could avoid the aftershock of his attack.", "Before Su Mo could find his footing, the saber radiance swept toward his stomach.", "The leader had attacked him again.", "The others also attacked him fiercely and did not give Su Mo the slightest break.", "The leader struck him at his most vulnerable time, which was after Su Mo finished his last strike and before he could strike again.", "In order to protect Xi’er, Su Mo had to reign in his attacks, so he could not display his full strength.", "Su Mo could no longer resisting the attack and could only try his best to dodge it.", "Puff!", "Although Su Mo managed to dodge the blade, the saber Qi still left a deep wound on him.", "His blood streamed out of the wound.", "“Brother Su Mo!” Xi’er was horrified, and tears appeared in her eyes.", "“Brother Su Mo, just put me down and forget about me. You should run!” Xi’er said, sobbing.", "“Xi’er, don’t be silly. They can’t trap me if I don’t want to stay.”", "Su Mo laughed, and then he swiftly shifted his direction and dashed deeper into the woods.", "In the blink of an eye, he had run dozens of meters.", "“Follow him and don’t let him get away!” The leader ordered and led his men after Su Mo."]}, "Chapter 29": {"Name": "I Will Protect You Forever", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo quickly passed through the thick mountain forest with Xi’er on his back.", "Those men in black kept following him at more than 100 meters behind.", "Su Mo fully applied his body move to widen the distance between them.", "Shadow Steps were for close combat, so they did not have a great effect on long-distance running.", "Of course, the key reason was that his skills could not be comprehensively applied in the high mountains and the thick forest full of thistles and thorns.", "Besides, Su Mo also had Xi’er on his back.", "“Su Mo, you can’t get away!” the middle-aged man in black yelled behind him.", "Su Mo smiled disdainfully, thinking,“If it weren’t for Xi’er’s safety, you’d be running away from me!”", "“Brother Su Mo, I beg you. Just put me down!” Xi’er said on his back.", "“Xi’er, stop! I won’t leave you for as long as I’m alive!” Su Mo said firmly.", "Xi’er felt deeply touched by Su Mo’s words.", "With Xi’er on his back, Su Mo ran like the wind, which caused him to bleed unstoppably.", "“I can’t keep doing this!”", "Su Mo frowned. Bleeding would only make his body weaker.", "“I have an idea!”", "Suddenly, Su Mo had an idea and began running in another direction.", "A moment later, he saw a small cave.", "This was the same place where he had found the Purple Spirit Fruit.", "Su Mo entered the cave quickly with Xi’er on his back.", "He glanced around the cave. The corpse of Wei Long, whom he had killed, had been eaten by demonic beasts and reduced to pieces of cloth.", "“Xi’er, wait for me here. I’ll go out to kill these dogs,” Su Mo said, putting Xi’er down.", "“Brother Su Mo!” Xi’er firmly grasped Su Mo’s hands, looking worried.", "“Don’t worry! I’ll protect you forever! I can’t be killed easily!”", "Su Mo patted Xi’er’s soft hands and kissed her forehead gently. After that, he turned to leave.", "Xi’er stood there in a daze, like she had been shocked by electricity.", "“I will protect you forever!”Feeling the residual warmth on her forehead, Xi’er recalled Su Mo’s words.", "She cried! Her tears flowed down her cheeks!", "However, a joyful smile appeared on her face.", "Su Mo went out of the cave, seeing that it had been surrounded by several men in black.", "At that moment, Su Mo blocked the entrance of the cave, so Xi’er was quite safe.", "Without her on his back, he could easily slaughter these enemies.", "“Su Mo, you have nowhere to run!” the leader said with a cold laugh. He had not expected that Su Mo would be so foolish to hide in a cave.", "Now, Su Mo was trapped like a rat in a hole.", "“Who said I need to escape? It’s time for you to escape!” Su Mo sneered, thinking,“These pieces of trash want to kill me. What a joke!”", "“How dare you still be so rude on your deathbed!” The middle-aged leader scorned him and shouted, “Attack him!”", "He led the way, chopping his revolving saber toward Su Mo.", "Buzz!", "Su Mo’s refined sword disappeared and was replaced by a silvery long sword.", "It was Spirit-slayer.", "“You’re courting death!” Su Mo shouted loudly and bore down on the incoming saber without dodging.", "“Final Hit of Heavenly Wind!”", "Su Mo applied his strongest movement.", "The middle-aged man in black was the leader of the enemies, so if he was killed, the others would not stand a chance.", "His unmatched sword radiance was like dazzling starlight, rising into the sky and tearing through the air.", "The saber and sword then crashed into each other violently.", "Boom!", "A fierce burst of force erupted in all directions.", "Crack!", "The leader’s long saber was broken. The sword radiance halted for a second before shooting toward the leader with full strength.", "“What?”", "The leader was frightened, but it was too late for him to dodge, so he could only turn his body to protect his vital organs.", "Slice!", "With a flash of sword radiance, a long arm flew into the air and sprayed red blood everywhere like rain.", "“Ah!!”", "The leader screamed, and his face twisted in severe pain.", "He retreated quickly away from Su Mo.", "Su Mo did not attack him again, but instead, he turned and aimed his long sword toward the other men in black.", "“Whoosh! Whoosh! Whoosh!”", "Su Mo’s eyes glinted coldly, and his body flitted around, leaving a series of residual shadows as his long sword kept attacking.", "“Gale Blade!”", "“Swirling Winds and Clouds!”", "“Wind Roaring in the Sky!”", "These men in black only had an Lv 7 Qi cultivation Realm, so they were even weaker than Wei Liang. There was no way they could defeat Su Mo.", "With the Spirit-slayer Sword, Su Mo became so powerful that he could kill a man with each step.", "In no time, the rest of them were all killed.", "“What…”", "The injured leader was greatly frightened and stared at Su Mo in horror.", "Realizing that it was impossible to kill Su Mo, he turned to escape quickly without hesitation.", "“Whoosh!”", "Su Mo suddenly sprang forward to block the leader’s path.", "“Do you think you can escape today?” Su Mo asked indifferently.", "“Su Mo, I beg you… let me go.”", "The leader’s arm was cut off, and he lost a great deal of blood. His complexion turned as white as paper.", "“Well, if you tell me who you are and why you’re trying to kill me, I might consider letting you go,” Su Mo said with a sneer.", "“We’re guards of the Mansion of the City Governor. His son wants to kill you and capture Xi’er.” The leader concealed nothing from Su Mo.", "He was the same guard who had reported Su Mo’s whereabouts to Lin Xiao.", "He knew that it was impossible for him to go back to the Mansion of the City Governor, for he had failed his task and missed an arm. If he went back, he would be killed.", "Therefore, he did not intend to hide any information.", "“Swish!”", "As Su Mo was lost in thought, the middle-aged man turned around and escaped.", "Having seen Su Mo kill the others in a short time, he knew Su Mo would not let him go.", "“Whoosh!”", "After he ran only a few steps, a sharp sword radiance instantly shot toward him and penetrated his heart.", "Su Mo’s eyes glinted coldly. He was never soft-hearted to his enemies.", "“So it’s Lin Xiao? He will pay the price for your actions,” Su Mo murmured.", "After all the men in black were killed, Su Mo hurried to enter the cave.", "He saw that Xi’er had come out of the cave and was standing at the entrance, staring at Su Mo.", "“Xi’er!” he called toward her.", "“Brother Su Mo!”", "She suddenly ran like the wind to Su Mo and entered his arms, holding his waist tightly.", "Su Mo smelled her elegant fragrance, and he was calmed by the touch of her soft body.", "“Xi’er, don’t be afraid! I’ve killed them.” Su Mo patted her back to comfort her.", "After a while, she left Su Mo’s arms, slightly blushing.", "“Xi’er, weren’t you curious about how I mummified the demonic beasts?” Su Mo said suddenly, “In fact, human beings are the same. In a second, I’ll swallow their essence and blood.”", "Su Mo went to the corpses and sat cross-legged, releasing his Martial Soul."]}, "Chapter 30": {"Name": "Two Consecutive Level-ups", "Translator": "Transn", "Editor": "Transn", "Story": ["Su Mo sat cross-legged next to the corpses of the men in black and released his Devouring Martial Soul.", "Their essence, blood, and Martial Souls immediately converged toward him.", "Their Martial Souls, including the leader’s, were all only at Rank 3 Human Class Martial Soul, so they barely had an impact on Su Mo’s Martial Soul progression.", "However, most of them were at Lv 7, and the leader was at Lv 8, so their essence and blood held a great amount of energy.", "After devouring only half of their essence and blood, Su Mo felt his genuine Qi increase intensely and break through a barrier in cultivation.", "He had reached Lv 6 Qi Cultivation Realm!", "As he kept devouring, his cultivation was still rapidly increasing.", "Early Lv 6 Qi Cultivation Realm!", "Middle Lv 6 Qi Cultivation Realm!", "Late Lv 6 Qi Cultivation Realm!", "When Su Mo’s cultivation had almost reached the peak Lv 6 Qi Cultivation Realm, he had devoured all the remaining essence.", "All the corpses became mummies.", "Huff!", "He slowly exhaled a mouthful of heavy air.", "He turned to look at Xi’er, who was staring at Su Mo with her mouth slightly ajar and a stunned face.", "“Xi’er, now you know what I meant!” He stood up and walked toward her.", "“Brother Su Mo, this…”", "Xi’er was shocked beyond words and stared at him with wide eyes.", "“Haha, this is my Martial Soul’s special ability.” Su Mo explained with a smile.", "Even he himself had been extremely shocked by this ability at first.", "He had never heard of Martial Souls that could turn essence into Qi, or more importantly, increase their level.", "“Oh!” Xi’er nodded in confusion.", "“Let’s keep hunting demonic beasts!”", "“Brother Su Mo, your wound is still bleeding!” Xi’er exclaimed, looking at the gash on his body.", "“It’s alright. It’s just a scrape. I’ll be fine after I take an elixir!” he said with a wave of his hand and swallowed a healing elixir.", "Once the pill healed his wound, he and Xi’er continued to forge into the woods.", "Boom! Boom! Boom!", "Su Mo crazily killed demonic beasts as he went like a maniac.", "Anything that walked into his path was instantly killed.", "He would have killed the flying beasts, too, if only he could reach them!", "Soon, he had walked over 15 kilometers into the woods and killed more than 40 demonic beasts.", "However, even after he devoured their Beast Souls, essence, and Qi, his Martial Soul and cultivation still did not progress.", "All these demonic beasts were of Class 4 or 5 Lv 1. They had little effect on his Martial Soul, and their blood only increased his cultivation to the peak Lv 6 Qi Cultivation Realm.", "The essence and blood of more than 40 Class 4 and 5 Lv 1 demonic beasts was not even equivalent to the essence and blood of a martial artist at Lv 8 Qi Cultivation Realm.", "As they got deeper into the woods, they began to meet demonic beast with higher levels.", "Roar!", "A giant Demonic Bear appeared in front of him.", "This bear was as black as ink, almost seven meters tall, and weighed about 1500 kilograms. Its massive body exuded a thick cloud of demonic Qi.", "This was definitely a Class 6 Lv 1 Demonic Beast.", "“Haha!”", "Su Mo was overjoyed and swiftly ran forward.", "Roar!", "Spotting a human that had ventured into its territory, the Demonic Bear immediately let out a roar that shook the entire forest.", "Its giant body thundered towards Su Mo, breaking countless tall trees in its path. It swung its paws, which were as big as millstones, towards Su Mo’s head.", "Although this Demonic Bear was only Class 6 Lv 1, its massive body and powerful strength made it equivalent to a Class 7 Lv 1 one.", "Swish!", "Despite this, the Demonic Bear still could not block Su Mo’s brilliant sword, which immediately cut off its paw and half of its head.", "Blood and brains spewed everywhere.", "Boom!", "The Demonic Bear’s giant body immediately crashed down.", "Su Mo immediately devoured its essence and blood, transformed it into genuine Qi, and absorbed it into his elixir field.", "The genuine Qi in his elixir field had already reached the brink.", "He wanted to break through to Lv 7 but was still unsuccessful after two tries.", "“It’s still not enough. I need a little more!”", "Su Mo moved on with Xi’er.", "On the way, he kept killing and devouring.", "Finally, after Su Mo had killed and devoured eight Class 6 Lv 1 demonic beasts and two Class 7 Lv 1 ones, his elixir field swelled.", "His genuine Qi increased greatly once again, and an aura arose from his body that was much stronger than that of Lv 6.", "He entered the Lv 7 Qi Cultivation Realm!", "In a short couple of hours, Su Mo had progressed from the Peak Lv 5 into the Lv 7 Qi Cultivation Realm.", "If other martial artists learned about his cultivation speed, they would be scared to death.", "“Leveling-up is too easy!” Su Mo exclaimed with joy.", "He had originally estimated that it would take him two days in Breezewind Mountain to reach Lv 7.", "He had not expected that he would achieve it in only half a day.", "“It’s so fast!”", "Devouring essence and blood increased his cultivation much faster than he had expected.", "Of course, all of the men in black had also helped greatly.", "“If I kept killing here for two weeks, would my cultivation reach the Spiritual Martial Realm?”", "Su Mo’s heart was burning with excitement.", "However, he soon rejected this notion.", "Increasing his cultivation this way no doubt muddled his genuine Qi and made it unstable.", "Also, after he killed the guards from the Mansion of the City Governor and prevented Lin Xiao from getting his way, Lin Xiao would probably send more men after him.", "It was best for Xi’er’s safety to go home soon.", "Su Mo could tell from the sky that it was still early in the afternoon, so he decided to hunt a few more demonic beasts before taking Xi’er back.", "He continued killing and ended up hunting more than 10 Class 7 Lv 1 demonic beasts by nighttime.", "After he devoured them, Su Mo’s cultivation reached Late Lv 7 Qi Cultivation Realm.", "His cultivation had improved drastically.", "However, his Martial Soul had still not progressed even after devouring all of these Beast Souls.", "Su Mo estimated that if he wanted to increase his Martial Soul to Rank 7 Human Class, he would have to devour at least a couple hundred more Class 7 Lv 1 Beast Souls.", "This task was too big to be undertaken by killing demonic beasts one by one.", "It was better to buy them directly.", "It was late, and Su Mo did not want to stay any longer. He swiftly left Breezewind Mountain with Xi’er and returned to Sunnywood City."]}}